Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x3763 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xfa9c4): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xe7424): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x6e7f): C:/Users/volod/STM32CubeIDE/workspace_1.12.0/STM32F767Zi_FreeRTOS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <2a>   DW_AT_encoding    : 5	(signed)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_type        : <0x2f0>
    <30>   DW_AT_decl_file   : 4
    <31>   DW_AT_decl_line   : 49
    <32>   DW_AT_decl_column : 1
    <33>   DW_AT_sibling     : <0x2f0>
 <2><37>: Abbrev Number: 3 (DW_TAG_enumerator)
    <38>   DW_AT_name        : (indirect string, offset: 0x25fc7): NonMaskableInt_IRQn
    <3c>   DW_AT_const_value : -14
 <2><3d>: Abbrev Number: 3 (DW_TAG_enumerator)

    <309>   DW_AT_decl_line   : 43
    <30a>   DW_AT_decl_column : 24
    <30b>   DW_AT_type        : <0x30f>
 <1><30f>: Abbrev Number: 5 (DW_TAG_base_type)
    <310>   DW_AT_byte_size   : 1
    <311>   DW_AT_encoding    : 8	(unsigned char)
    <312>   DW_AT_name        : (indirect string, offset: 0xfaba2): unsigned char
 <1><316>: Abbrev Number: 5 (DW_TAG_base_type)
    <317>   DW_AT_byte_size   : 2
    <318>   DW_AT_encoding    : 5	(signed)
    <319>   DW_AT_name        : (indirect string, offset: 0xc1a35): short int
 <1><31d>: Abbrev Number: 6 (DW_TAG_typedef)
    <31e>   DW_AT_name        : (indirect string, offset: 0xd49fd): __uint16_t
    <322>   DW_AT_decl_file   : 5
    <323>   DW_AT_decl_line   : 57
    <324>   DW_AT_decl_column : 25
    <325>   DW_AT_type        : <0x329>
 <1><329>: Abbrev Number: 5 (DW_TAG_base_type)
    <32a>   DW_AT_byte_size   : 2
    <32b>   DW_AT_encoding    : 7	(unsigned)
    <32c>   DW_AT_name        : (indirect string, offset: 0xf8f4f): short unsigned int
 <1><330>: Abbrev Number: 5 (DW_TAG_base_type)
    <331>   DW_AT_byte_size   : 4
    <332>   DW_AT_encoding    : 5	(signed)
    <333>   DW_AT_name        : (indirect string, offset: 0x161c9): long int
 <1><337>: Abbrev Number: 6 (DW_TAG_typedef)
    <338>   DW_AT_name        : (indirect string, offset: 0xa6316): __uint32_t
    <33c>   DW_AT_decl_file   : 5
    <33d>   DW_AT_decl_line   : 79
    <33e>   DW_AT_decl_column : 25
    <33f>   DW_AT_type        : <0x343>
 <1><343>: Abbrev Number: 5 (DW_TAG_base_type)
    <344>   DW_AT_byte_size   : 4
    <345>   DW_AT_encoding    : 7	(unsigned)
    <346>   DW_AT_name        : (indirect string, offset: 0x641d6): long unsigned int
 <1><34a>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <34b>   DW_AT_type        : <0x343>
 <1><34f>: Abbrev Number: 5 (DW_TAG_base_type)
    <350>   DW_AT_byte_size   : 8
    <351>   DW_AT_encoding    : 5	(signed)
    <352>   DW_AT_name        : (indirect string, offset: 0x76b90): long long int
 <1><356>: Abbrev Number: 5 (DW_TAG_base_type)
    <357>   DW_AT_byte_size   : 8
    <358>   DW_AT_encoding    : 7	(unsigned)
    <359>   DW_AT_name        : (indirect string, offset: 0x35787): long long unsigned int
 <1><35d>: Abbrev Number: 8 (DW_TAG_base_type)
    <35e>   DW_AT_byte_size   : 4
    <35f>   DW_AT_encoding    : 5	(signed)
    <360>   DW_AT_name        : int
 <1><364>: Abbrev Number: 5 (DW_TAG_base_type)
    <365>   DW_AT_byte_size   : 4
    <366>   DW_AT_encoding    : 7	(unsigned)
    <367>   DW_AT_name        : (indirect string, offset: 0x153b7): unsigned int
 <1><36b>: Abbrev Number: 6 (DW_TAG_typedef)
    <36c>   DW_AT_name        : (indirect string, offset: 0x4b77c): uint8_t
    <370>   DW_AT_decl_file   : 6
    <371>   DW_AT_decl_line   : 24
    <372>   DW_AT_decl_column : 19
    <373>   DW_AT_type        : <0x303>
 <1><377>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <378>   DW_AT_type        : <0x36b>
 <1><37c>: Abbrev Number: 9 (DW_TAG_const_type)
    <37d>   DW_AT_type        : <0x36b>
 <1><381>: Abbrev Number: 6 (DW_TAG_typedef)
    <382>   DW_AT_name        : (indirect string, offset: 0xbe17c): uint16_t
    <386>   DW_AT_decl_file   : 6
    <387>   DW_AT_decl_line   : 36
    <388>   DW_AT_decl_column : 20
    <389>   DW_AT_type        : <0x31d>
 <1><38d>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <38e>   DW_AT_type        : <0x381>
 <1><392>: Abbrev Number: 9 (DW_TAG_const_type)
    <393>   DW_AT_type        : <0x381>
 <1><397>: Abbrev Number: 6 (DW_TAG_typedef)
    <398>   DW_AT_name        : (indirect string, offset: 0xf8b3f): uint32_t
    <39c>   DW_AT_decl_file   : 6
    <39d>   DW_AT_decl_line   : 48
    <39e>   DW_AT_decl_column : 20
    <39f>   DW_AT_type        : <0x337>
 <1><3a3>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <3a4>   DW_AT_type        : <0x397>
 <1><3a8>: Abbrev Number: 9 (DW_TAG_const_type)
    <3a9>   DW_AT_type        : <0x3a3>
 <1><3ad>: Abbrev Number: 10 (DW_TAG_array_type)
    <3ae>   DW_AT_type        : <0x397>
    <3b2>   DW_AT_sibling     : <0x3bd>
 <2><3b6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3b7>   DW_AT_type        : <0x364>
    <3bb>   DW_AT_upper_bound : 14
 <2><3bc>: Abbrev Number: 0
 <1><3bd>: Abbrev Number: 10 (DW_TAG_array_type)
    <3be>   DW_AT_type        : <0x397>
    <3c2>   DW_AT_sibling     : <0x3cd>
 <2><3c6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <3c7>   DW_AT_type        : <0x364>
    <3cb>   DW_AT_upper_bound : 5
 <2><3cc>: Abbrev Number: 0
 <1><3cd>: Abbrev Number: 12 (DW_TAG_union_type)
    <3ce>   DW_AT_byte_size   : 4
    <3cf>   DW_AT_decl_file   : 1
    <3d0>   DW_AT_decl_line   : 1015
    <3d2>   DW_AT_decl_column : 9
    <3d3>   DW_AT_sibling     : <0x3fe>
 <2><3d7>: Abbrev Number: 13 (DW_TAG_member)
    <3d8>   DW_AT_name        : u8
    <3db>   DW_AT_decl_file   : 1
    <3dc>   DW_AT_decl_line   : 1017
    <3de>   DW_AT_decl_column : 22
    <3df>   DW_AT_type        : <0x377>
 <2><3e3>: Abbrev Number: 13 (DW_TAG_member)
    <3e4>   DW_AT_name        : u16
    <3e8>   DW_AT_decl_file   : 1
    <3e9>   DW_AT_decl_line   : 1018
    <3eb>   DW_AT_decl_column : 22
    <3ec>   DW_AT_type        : <0x38d>
 <2><3f0>: Abbrev Number: 13 (DW_TAG_member)
    <3f1>   DW_AT_name        : u32
    <3f5>   DW_AT_decl_file   : 1
    <3f6>   DW_AT_decl_line   : 1019
    <3f8>   DW_AT_decl_column : 22
    <3f9>   DW_AT_type        : <0x3a3>
 <2><3fd>: Abbrev Number: 0
 <1><3fe>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <3ff>   DW_AT_type        : <0x3cd>
 <1><403>: Abbrev Number: 14 (DW_TAG_structure_type)
    <404>   DW_AT_byte_size   : 4096
    <406>   DW_AT_decl_file   : 1
    <407>   DW_AT_decl_line   : 1013
    <409>   DW_AT_decl_column : 9
    <40a>   DW_AT_sibling     : <0x5a2>
 <2><40e>: Abbrev Number: 15 (DW_TAG_member)
    <40f>   DW_AT_name        : (indirect string, offset: 0x10774d): PORT
    <413>   DW_AT_decl_file   : 1
    <414>   DW_AT_decl_line   : 1020
    <416>   DW_AT_decl_column : 6
    <417>   DW_AT_type        : <0x5b2>
    <41b>   DW_AT_data_member_location: 0
 <2><41c>: Abbrev Number: 15 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0xf5142): RESERVED0
    <421>   DW_AT_decl_file   : 1
    <422>   DW_AT_decl_line   : 1021
    <424>   DW_AT_decl_column : 18
    <425>   DW_AT_type        : <0x5b7>
    <429>   DW_AT_data_member_location: 128
 <2><42a>: Abbrev Number: 16 (DW_TAG_member)
    <42b>   DW_AT_name        : TER
    <42f>   DW_AT_decl_file   : 1
    <430>   DW_AT_decl_line   : 1022
    <432>   DW_AT_decl_column : 18
    <433>   DW_AT_type        : <0x3a3>
    <437>   DW_AT_data_member_location: 3584
 <2><439>: Abbrev Number: 17 (DW_TAG_member)
    <43a>   DW_AT_name        : (indirect string, offset: 0xf514c): RESERVED1
    <43e>   DW_AT_decl_file   : 1
    <43f>   DW_AT_decl_line   : 1023
    <441>   DW_AT_decl_column : 18
    <442>   DW_AT_type        : <0x3ad>
    <446>   DW_AT_data_member_location: 3588
 <2><448>: Abbrev Number: 16 (DW_TAG_member)
    <449>   DW_AT_name        : TPR
    <44d>   DW_AT_decl_file   : 1
    <44e>   DW_AT_decl_line   : 1024
    <450>   DW_AT_decl_column : 18
    <451>   DW_AT_type        : <0x3a3>
    <455>   DW_AT_data_member_location: 3648
 <2><457>: Abbrev Number: 17 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0xf5156): RESERVED2
    <45c>   DW_AT_decl_file   : 1
    <45d>   DW_AT_decl_line   : 1025
    <45f>   DW_AT_decl_column : 18
    <460>   DW_AT_type        : <0x3ad>
    <464>   DW_AT_data_member_location: 3652
 <2><466>: Abbrev Number: 16 (DW_TAG_member)
    <467>   DW_AT_name        : TCR
    <46b>   DW_AT_decl_file   : 1
    <46c>   DW_AT_decl_line   : 1026
    <46e>   DW_AT_decl_column : 18
    <46f>   DW_AT_type        : <0x3a3>
    <473>   DW_AT_data_member_location: 3712
 <2><475>: Abbrev Number: 17 (DW_TAG_member)
    <476>   DW_AT_name        : (indirect string, offset: 0xf5160): RESERVED3
    <47a>   DW_AT_decl_file   : 1
    <47b>   DW_AT_decl_line   : 1027
    <47d>   DW_AT_decl_column : 18
    <47e>   DW_AT_type        : <0x5c8>
    <482>   DW_AT_data_member_location: 3716
 <2><484>: Abbrev Number: 16 (DW_TAG_member)
    <485>   DW_AT_name        : IWR
    <489>   DW_AT_decl_file   : 1
    <48a>   DW_AT_decl_line   : 1028
    <48c>   DW_AT_decl_column : 18
    <48d>   DW_AT_type        : <0x3a3>
    <491>   DW_AT_data_member_location: 3832
 <2><493>: Abbrev Number: 16 (DW_TAG_member)
    <494>   DW_AT_name        : IRR
    <498>   DW_AT_decl_file   : 1
    <499>   DW_AT_decl_line   : 1029
    <49b>   DW_AT_decl_column : 18
    <49c>   DW_AT_type        : <0x3a8>
    <4a0>   DW_AT_data_member_location: 3836
 <2><4a2>: Abbrev Number: 17 (DW_TAG_member)
    <4a3>   DW_AT_name        : (indirect string, offset: 0x9c0ae): IMCR
    <4a7>   DW_AT_decl_file   : 1
    <4a8>   DW_AT_decl_line   : 1030
    <4aa>   DW_AT_decl_column : 18
    <4ab>   DW_AT_type        : <0x3a3>
    <4af>   DW_AT_data_member_location: 3840
 <2><4b1>: Abbrev Number: 17 (DW_TAG_member)
    <4b2>   DW_AT_name        : (indirect string, offset: 0xf516a): RESERVED4
    <4b6>   DW_AT_decl_file   : 1
    <4b7>   DW_AT_decl_line   : 1031
    <4b9>   DW_AT_decl_column : 18
    <4ba>   DW_AT_type        : <0x5d8>
    <4be>   DW_AT_data_member_location: 3844
 <2><4c0>: Abbrev Number: 16 (DW_TAG_member)
    <4c1>   DW_AT_name        : LAR
    <4c5>   DW_AT_decl_file   : 1
    <4c6>   DW_AT_decl_line   : 1032
    <4c8>   DW_AT_decl_column : 18
    <4c9>   DW_AT_type        : <0x3a3>
    <4cd>   DW_AT_data_member_location: 4016
 <2><4cf>: Abbrev Number: 16 (DW_TAG_member)
    <4d0>   DW_AT_name        : LSR
    <4d4>   DW_AT_decl_file   : 1
    <4d5>   DW_AT_decl_line   : 1033
    <4d7>   DW_AT_decl_column : 18
    <4d8>   DW_AT_type        : <0x3a8>
    <4dc>   DW_AT_data_member_location: 4020
 <2><4de>: Abbrev Number: 17 (DW_TAG_member)
    <4df>   DW_AT_name        : (indirect string, offset: 0xf5174): RESERVED5
    <4e3>   DW_AT_decl_file   : 1
    <4e4>   DW_AT_decl_line   : 1034
    <4e6>   DW_AT_decl_column : 18
    <4e7>   DW_AT_type        : <0x3bd>
    <4eb>   DW_AT_data_member_location: 4024
 <2><4ed>: Abbrev Number: 17 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x6887a): PID4
    <4f2>   DW_AT_decl_file   : 1
    <4f3>   DW_AT_decl_line   : 1035
    <4f5>   DW_AT_decl_column : 18
    <4f6>   DW_AT_type        : <0x3a8>
    <4fa>   DW_AT_data_member_location: 4048
 <2><4fc>: Abbrev Number: 17 (DW_TAG_member)
    <4fd>   DW_AT_name        : (indirect string, offset: 0xcdf18): PID5
    <501>   DW_AT_decl_file   : 1
    <502>   DW_AT_decl_line   : 1036
    <504>   DW_AT_decl_column : 18
    <505>   DW_AT_type        : <0x3a8>
    <509>   DW_AT_data_member_location: 4052
 <2><50b>: Abbrev Number: 17 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x688b1): PID6
    <510>   DW_AT_decl_file   : 1
    <511>   DW_AT_decl_line   : 1037
    <513>   DW_AT_decl_column : 18
    <514>   DW_AT_type        : <0x3a8>
    <518>   DW_AT_data_member_location: 4056
 <2><51a>: Abbrev Number: 17 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0x688b6): PID7
    <51f>   DW_AT_decl_file   : 1
    <520>   DW_AT_decl_line   : 1038
    <522>   DW_AT_decl_column : 18
    <523>   DW_AT_type        : <0x3a8>
    <527>   DW_AT_data_member_location: 4060
 <2><529>: Abbrev Number: 17 (DW_TAG_member)
    <52a>   DW_AT_name        : (indirect string, offset: 0x6882c): PID0
    <52e>   DW_AT_decl_file   : 1
    <52f>   DW_AT_decl_line   : 1039
    <531>   DW_AT_decl_column : 18
    <532>   DW_AT_type        : <0x3a8>
    <536>   DW_AT_data_member_location: 4064
 <2><538>: Abbrev Number: 17 (DW_TAG_member)
    <539>   DW_AT_name        : (indirect string, offset: 0x94325): PID1
    <53d>   DW_AT_decl_file   : 1
    <53e>   DW_AT_decl_line   : 1040
    <540>   DW_AT_decl_column : 18
    <541>   DW_AT_type        : <0x3a8>
    <545>   DW_AT_data_member_location: 4068
 <2><547>: Abbrev Number: 17 (DW_TAG_member)
    <548>   DW_AT_name        : (indirect string, offset: 0xcdecb): PID2
    <54c>   DW_AT_decl_file   : 1
    <54d>   DW_AT_decl_line   : 1041
    <54f>   DW_AT_decl_column : 18
    <550>   DW_AT_type        : <0x3a8>
    <554>   DW_AT_data_member_location: 4072
 <2><556>: Abbrev Number: 17 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x68875): PID3
    <55b>   DW_AT_decl_file   : 1
    <55c>   DW_AT_decl_line   : 1042
    <55e>   DW_AT_decl_column : 18
    <55f>   DW_AT_type        : <0x3a8>
    <563>   DW_AT_data_member_location: 4076
 <2><565>: Abbrev Number: 17 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0x28c6): CID0
    <56a>   DW_AT_decl_file   : 1
    <56b>   DW_AT_decl_line   : 1043
    <56d>   DW_AT_decl_column : 18
    <56e>   DW_AT_type        : <0x3a8>
    <572>   DW_AT_data_member_location: 4080
 <2><574>: Abbrev Number: 17 (DW_TAG_member)
    <575>   DW_AT_name        : (indirect string, offset: 0x28cb): CID1
    <579>   DW_AT_decl_file   : 1
    <57a>   DW_AT_decl_line   : 1044
    <57c>   DW_AT_decl_column : 18
    <57d>   DW_AT_type        : <0x3a8>
    <581>   DW_AT_data_member_location: 4084
 <2><583>: Abbrev Number: 17 (DW_TAG_member)
    <584>   DW_AT_name        : (indirect string, offset: 0x28d0): CID2
    <588>   DW_AT_decl_file   : 1
    <589>   DW_AT_decl_line   : 1045
    <58b>   DW_AT_decl_column : 18
    <58c>   DW_AT_type        : <0x3a8>
    <590>   DW_AT_data_member_location: 4088
 <2><592>: Abbrev Number: 17 (DW_TAG_member)
    <593>   DW_AT_name        : (indirect string, offset: 0x28d5): CID3
    <597>   DW_AT_decl_file   : 1
    <598>   DW_AT_decl_line   : 1046
    <59a>   DW_AT_decl_column : 18
    <59b>   DW_AT_type        : <0x3a8>
    <59f>   DW_AT_data_member_location: 4092
 <2><5a1>: Abbrev Number: 0
 <1><5a2>: Abbrev Number: 10 (DW_TAG_array_type)
    <5a3>   DW_AT_type        : <0x3fe>
    <5a7>   DW_AT_sibling     : <0x5b2>
 <2><5ab>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <5ac>   DW_AT_type        : <0x364>
    <5b0>   DW_AT_upper_bound : 31
 <2><5b1>: Abbrev Number: 0
 <1><5b2>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <5b3>   DW_AT_type        : <0x5a2>
 <1><5b7>: Abbrev Number: 10 (DW_TAG_array_type)
    <5b8>   DW_AT_type        : <0x397>
    <5bc>   DW_AT_sibling     : <0x5c8>
 <2><5c0>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <5c1>   DW_AT_type        : <0x364>
    <5c5>   DW_AT_upper_bound : 863
 <2><5c7>: Abbrev Number: 0
 <1><5c8>: Abbrev Number: 10 (DW_TAG_array_type)
    <5c9>   DW_AT_type        : <0x397>
    <5cd>   DW_AT_sibling     : <0x5d8>
 <2><5d1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <5d2>   DW_AT_type        : <0x364>
    <5d6>   DW_AT_upper_bound : 28
 <2><5d7>: Abbrev Number: 0
 <1><5d8>: Abbrev Number: 10 (DW_TAG_array_type)
    <5d9>   DW_AT_type        : <0x397>
    <5dd>   DW_AT_sibling     : <0x5e8>
 <2><5e1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <5e2>   DW_AT_type        : <0x364>
    <5e6>   DW_AT_upper_bound : 42
 <2><5e7>: Abbrev Number: 0
 <1><5e8>: Abbrev Number: 19 (DW_TAG_typedef)
    <5e9>   DW_AT_name        : (indirect string, offset: 0xd5064): ITM_Type
    <5ed>   DW_AT_decl_file   : 1
    <5ee>   DW_AT_decl_line   : 1047
    <5f0>   DW_AT_decl_column : 3
    <5f1>   DW_AT_type        : <0x403>
 <1><5f5>: Abbrev Number: 10 (DW_TAG_array_type)
    <5f6>   DW_AT_type        : <0x397>
    <5fa>   DW_AT_sibling     : <0x605>
 <2><5fe>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <5ff>   DW_AT_type        : <0x364>
    <603>   DW_AT_upper_bound : 1
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 20 (DW_TAG_structure_type)
    <606>   DW_AT_byte_size   : 80
    <607>   DW_AT_decl_file   : 4
    <608>   DW_AT_decl_line   : 198
    <609>   DW_AT_decl_column : 9
    <60a>   DW_AT_sibling     : <0x711>
 <2><60e>: Abbrev Number: 21 (DW_TAG_member)
    <60f>   DW_AT_name        : SR
    <612>   DW_AT_decl_file   : 4
    <613>   DW_AT_decl_line   : 200
    <614>   DW_AT_decl_column : 17
    <615>   DW_AT_type        : <0x3a3>
    <619>   DW_AT_data_member_location: 0
 <2><61a>: Abbrev Number: 21 (DW_TAG_member)
    <61b>   DW_AT_name        : CR1
    <61f>   DW_AT_decl_file   : 4
    <620>   DW_AT_decl_line   : 201
    <621>   DW_AT_decl_column : 17
    <622>   DW_AT_type        : <0x3a3>
    <626>   DW_AT_data_member_location: 4
 <2><627>: Abbrev Number: 21 (DW_TAG_member)
    <628>   DW_AT_name        : CR2
    <62c>   DW_AT_decl_file   : 4
    <62d>   DW_AT_decl_line   : 202
    <62e>   DW_AT_decl_column : 17
    <62f>   DW_AT_type        : <0x3a3>
    <633>   DW_AT_data_member_location: 8
 <2><634>: Abbrev Number: 22 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0xdd294): SMPR1
    <639>   DW_AT_decl_file   : 4
    <63a>   DW_AT_decl_line   : 203
    <63b>   DW_AT_decl_column : 17
    <63c>   DW_AT_type        : <0x3a3>
    <640>   DW_AT_data_member_location: 12
 <2><641>: Abbrev Number: 22 (DW_TAG_member)
    <642>   DW_AT_name        : (indirect string, offset: 0x5d6d5): SMPR2
    <646>   DW_AT_decl_file   : 4
    <647>   DW_AT_decl_line   : 204
    <648>   DW_AT_decl_column : 17
    <649>   DW_AT_type        : <0x3a3>
    <64d>   DW_AT_data_member_location: 16
 <2><64e>: Abbrev Number: 22 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0x599f4): JOFR1
    <653>   DW_AT_decl_file   : 4
    <654>   DW_AT_decl_line   : 205
    <655>   DW_AT_decl_column : 17
    <656>   DW_AT_type        : <0x3a3>
    <65a>   DW_AT_data_member_location: 20
 <2><65b>: Abbrev Number: 22 (DW_TAG_member)
    <65c>   DW_AT_name        : (indirect string, offset: 0x599fa): JOFR2
    <660>   DW_AT_decl_file   : 4
    <661>   DW_AT_decl_line   : 206
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0x3a3>
    <667>   DW_AT_data_member_location: 24
 <2><668>: Abbrev Number: 22 (DW_TAG_member)
    <669>   DW_AT_name        : (indirect string, offset: 0x59a00): JOFR3
    <66d>   DW_AT_decl_file   : 4
    <66e>   DW_AT_decl_line   : 207
    <66f>   DW_AT_decl_column : 17
    <670>   DW_AT_type        : <0x3a3>
    <674>   DW_AT_data_member_location: 28
 <2><675>: Abbrev Number: 22 (DW_TAG_member)
    <676>   DW_AT_name        : (indirect string, offset: 0x37185): JOFR4
    <67a>   DW_AT_decl_file   : 4
    <67b>   DW_AT_decl_line   : 208
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x3a3>
    <681>   DW_AT_data_member_location: 32
 <2><682>: Abbrev Number: 21 (DW_TAG_member)
    <683>   DW_AT_name        : HTR
    <687>   DW_AT_decl_file   : 4
    <688>   DW_AT_decl_line   : 209
    <689>   DW_AT_decl_column : 17
    <68a>   DW_AT_type        : <0x3a3>
    <68e>   DW_AT_data_member_location: 36
 <2><68f>: Abbrev Number: 21 (DW_TAG_member)
    <690>   DW_AT_name        : LTR
    <694>   DW_AT_decl_file   : 4
    <695>   DW_AT_decl_line   : 210
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x3a3>
    <69b>   DW_AT_data_member_location: 40
 <2><69c>: Abbrev Number: 22 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0xb5a6c): SQR1
    <6a1>   DW_AT_decl_file   : 4
    <6a2>   DW_AT_decl_line   : 211
    <6a3>   DW_AT_decl_column : 17
    <6a4>   DW_AT_type        : <0x3a3>
    <6a8>   DW_AT_data_member_location: 44
 <2><6a9>: Abbrev Number: 22 (DW_TAG_member)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x13f02): SQR2
    <6ae>   DW_AT_decl_file   : 4
    <6af>   DW_AT_decl_line   : 212
    <6b0>   DW_AT_decl_column : 17
    <6b1>   DW_AT_type        : <0x3a3>
    <6b5>   DW_AT_data_member_location: 48
 <2><6b6>: Abbrev Number: 22 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0x13f07): SQR3
    <6bb>   DW_AT_decl_file   : 4
    <6bc>   DW_AT_decl_line   : 213
    <6bd>   DW_AT_decl_column : 17
    <6be>   DW_AT_type        : <0x3a3>
    <6c2>   DW_AT_data_member_location: 52
 <2><6c3>: Abbrev Number: 22 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x5418d): JSQR
    <6c8>   DW_AT_decl_file   : 4
    <6c9>   DW_AT_decl_line   : 214
    <6ca>   DW_AT_decl_column : 17
    <6cb>   DW_AT_type        : <0x3a3>
    <6cf>   DW_AT_data_member_location: 56
 <2><6d0>: Abbrev Number: 22 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xa7503): JDR1
    <6d5>   DW_AT_decl_file   : 4
    <6d6>   DW_AT_decl_line   : 215
    <6d7>   DW_AT_decl_column : 17
    <6d8>   DW_AT_type        : <0x3a3>
    <6dc>   DW_AT_data_member_location: 60
 <2><6dd>: Abbrev Number: 22 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0xa7508): JDR2
    <6e2>   DW_AT_decl_file   : 4
    <6e3>   DW_AT_decl_line   : 216
    <6e4>   DW_AT_decl_column : 17
    <6e5>   DW_AT_type        : <0x3a3>
    <6e9>   DW_AT_data_member_location: 64
 <2><6ea>: Abbrev Number: 22 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0xa750d): JDR3
    <6ef>   DW_AT_decl_file   : 4
    <6f0>   DW_AT_decl_line   : 217
    <6f1>   DW_AT_decl_column : 17
    <6f2>   DW_AT_type        : <0x3a3>
    <6f6>   DW_AT_data_member_location: 68
 <2><6f7>: Abbrev Number: 22 (DW_TAG_member)
    <6f8>   DW_AT_name        : (indirect string, offset: 0x443d7): JDR4
    <6fc>   DW_AT_decl_file   : 4
    <6fd>   DW_AT_decl_line   : 218
    <6fe>   DW_AT_decl_column : 17
    <6ff>   DW_AT_type        : <0x3a3>
    <703>   DW_AT_data_member_location: 72
 <2><704>: Abbrev Number: 21 (DW_TAG_member)
    <705>   DW_AT_name        : DR
    <708>   DW_AT_decl_file   : 4
    <709>   DW_AT_decl_line   : 219
    <70a>   DW_AT_decl_column : 17
    <70b>   DW_AT_type        : <0x3a3>
    <70f>   DW_AT_data_member_location: 76
 <2><710>: Abbrev Number: 0
 <1><711>: Abbrev Number: 6 (DW_TAG_typedef)
    <712>   DW_AT_name        : (indirect string, offset: 0xc7a53): ADC_TypeDef
    <716>   DW_AT_decl_file   : 4
    <717>   DW_AT_decl_line   : 220
    <718>   DW_AT_decl_column : 3
    <719>   DW_AT_type        : <0x605>
 <1><71d>: Abbrev Number: 10 (DW_TAG_array_type)
    <71e>   DW_AT_type        : <0x397>
    <722>   DW_AT_sibling     : <0x72d>
 <2><726>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <727>   DW_AT_type        : <0x364>
    <72b>   DW_AT_upper_bound : 11
 <2><72c>: Abbrev Number: 0
 <1><72d>: Abbrev Number: 23 (DW_TAG_structure_type)
    <72e>   DW_AT_byte_size   : 24
    <72f>   DW_AT_decl_file   : 4
    <730>   DW_AT_decl_line   : 417
    <732>   DW_AT_decl_column : 9
    <733>   DW_AT_sibling     : <0x78b>
 <2><737>: Abbrev Number: 24 (DW_TAG_member)
    <738>   DW_AT_name        : CR
    <73b>   DW_AT_decl_file   : 4
    <73c>   DW_AT_decl_line   : 419
    <73e>   DW_AT_decl_column : 17
    <73f>   DW_AT_type        : <0x3a3>
    <743>   DW_AT_data_member_location: 0
 <2><744>: Abbrev Number: 15 (DW_TAG_member)
    <745>   DW_AT_name        : (indirect string, offset: 0x636bf): NDTR
    <749>   DW_AT_decl_file   : 4
    <74a>   DW_AT_decl_line   : 420
    <74c>   DW_AT_decl_column : 17
    <74d>   DW_AT_type        : <0x3a3>
    <751>   DW_AT_data_member_location: 4
 <2><752>: Abbrev Number: 24 (DW_TAG_member)
    <753>   DW_AT_name        : PAR
    <757>   DW_AT_decl_file   : 4
    <758>   DW_AT_decl_line   : 421
    <75a>   DW_AT_decl_column : 17
    <75b>   DW_AT_type        : <0x3a3>
    <75f>   DW_AT_data_member_location: 8
 <2><760>: Abbrev Number: 15 (DW_TAG_member)
    <761>   DW_AT_name        : (indirect string, offset: 0x6c88e): M0AR
    <765>   DW_AT_decl_file   : 4
    <766>   DW_AT_decl_line   : 422
    <768>   DW_AT_decl_column : 17
    <769>   DW_AT_type        : <0x3a3>
    <76d>   DW_AT_data_member_location: 12
 <2><76e>: Abbrev Number: 15 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x8f9a5): M1AR
    <773>   DW_AT_decl_file   : 4
    <774>   DW_AT_decl_line   : 423
    <776>   DW_AT_decl_column : 17
    <777>   DW_AT_type        : <0x3a3>
    <77b>   DW_AT_data_member_location: 16
 <2><77c>: Abbrev Number: 24 (DW_TAG_member)
    <77d>   DW_AT_name        : FCR
    <781>   DW_AT_decl_file   : 4
    <782>   DW_AT_decl_line   : 424
    <784>   DW_AT_decl_column : 17
    <785>   DW_AT_type        : <0x3a3>
    <789>   DW_AT_data_member_location: 20
 <2><78a>: Abbrev Number: 0
 <1><78b>: Abbrev Number: 19 (DW_TAG_typedef)
    <78c>   DW_AT_name        : (indirect string, offset: 0x1f985): DMA_Stream_TypeDef
    <790>   DW_AT_decl_file   : 4
    <791>   DW_AT_decl_line   : 425
    <793>   DW_AT_decl_column : 3
    <794>   DW_AT_type        : <0x72d>
 <1><798>: Abbrev Number: 10 (DW_TAG_array_type)
    <799>   DW_AT_type        : <0x397>
    <79d>   DW_AT_sibling     : <0x7a8>
 <2><7a1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <7a2>   DW_AT_type        : <0x364>
    <7a6>   DW_AT_upper_bound : 39
 <2><7a7>: Abbrev Number: 0
 <1><7a8>: Abbrev Number: 10 (DW_TAG_array_type)
    <7a9>   DW_AT_type        : <0x3a3>
    <7ad>   DW_AT_sibling     : <0x7b8>
 <2><7b1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <7b2>   DW_AT_type        : <0x364>
    <7b6>   DW_AT_upper_bound : 1
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <7b9>   DW_AT_type        : <0x7a8>
 <1><7bd>: Abbrev Number: 23 (DW_TAG_structure_type)
    <7be>   DW_AT_byte_size   : 40
    <7bf>   DW_AT_decl_file   : 4
    <7c0>   DW_AT_decl_line   : 624
    <7c2>   DW_AT_decl_column : 9
    <7c3>   DW_AT_sibling     : <0x846>
 <2><7c7>: Abbrev Number: 15 (DW_TAG_member)
    <7c8>   DW_AT_name        : (indirect string, offset: 0x1cc0): MODER
    <7cc>   DW_AT_decl_file   : 4
    <7cd>   DW_AT_decl_line   : 626
    <7cf>   DW_AT_decl_column : 17
    <7d0>   DW_AT_type        : <0x3a3>
    <7d4>   DW_AT_data_member_location: 0
 <2><7d5>: Abbrev Number: 15 (DW_TAG_member)
    <7d6>   DW_AT_name        : (indirect string, offset: 0xc96f4): OTYPER
    <7da>   DW_AT_decl_file   : 4
    <7db>   DW_AT_decl_line   : 627
    <7dd>   DW_AT_decl_column : 17
    <7de>   DW_AT_type        : <0x3a3>
    <7e2>   DW_AT_data_member_location: 4
 <2><7e3>: Abbrev Number: 15 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xe1dc6): OSPEEDR
    <7e8>   DW_AT_decl_file   : 4
    <7e9>   DW_AT_decl_line   : 628
    <7eb>   DW_AT_decl_column : 17
    <7ec>   DW_AT_type        : <0x3a3>
    <7f0>   DW_AT_data_member_location: 8
 <2><7f1>: Abbrev Number: 15 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xba141): PUPDR
    <7f6>   DW_AT_decl_file   : 4
    <7f7>   DW_AT_decl_line   : 629
    <7f9>   DW_AT_decl_column : 17
    <7fa>   DW_AT_type        : <0x3a3>
    <7fe>   DW_AT_data_member_location: 12
 <2><7ff>: Abbrev Number: 24 (DW_TAG_member)
    <800>   DW_AT_name        : IDR
    <804>   DW_AT_decl_file   : 4
    <805>   DW_AT_decl_line   : 630
    <807>   DW_AT_decl_column : 17
    <808>   DW_AT_type        : <0x3a3>
    <80c>   DW_AT_data_member_location: 16
 <2><80d>: Abbrev Number: 24 (DW_TAG_member)
    <80e>   DW_AT_name        : ODR
    <812>   DW_AT_decl_file   : 4
    <813>   DW_AT_decl_line   : 631
    <815>   DW_AT_decl_column : 17
    <816>   DW_AT_type        : <0x3a3>
    <81a>   DW_AT_data_member_location: 20
 <2><81b>: Abbrev Number: 15 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x39e93): BSRR
    <820>   DW_AT_decl_file   : 4
    <821>   DW_AT_decl_line   : 632
    <823>   DW_AT_decl_column : 17
    <824>   DW_AT_type        : <0x3a3>
    <828>   DW_AT_data_member_location: 24
 <2><829>: Abbrev Number: 15 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0xdefc6): LCKR
    <82e>   DW_AT_decl_file   : 4
    <82f>   DW_AT_decl_line   : 633
    <831>   DW_AT_decl_column : 17
    <832>   DW_AT_type        : <0x3a3>
    <836>   DW_AT_data_member_location: 28
 <2><837>: Abbrev Number: 24 (DW_TAG_member)
    <838>   DW_AT_name        : AFR
    <83c>   DW_AT_decl_file   : 4
    <83d>   DW_AT_decl_line   : 634
    <83f>   DW_AT_decl_column : 17
    <840>   DW_AT_type        : <0x7b8>
    <844>   DW_AT_data_member_location: 32
 <2><845>: Abbrev Number: 0
 <1><846>: Abbrev Number: 19 (DW_TAG_typedef)
    <847>   DW_AT_name        : (indirect string, offset: 0xfc4da): GPIO_TypeDef
    <84b>   DW_AT_decl_file   : 4
    <84c>   DW_AT_decl_line   : 635
    <84e>   DW_AT_decl_column : 3
    <84f>   DW_AT_type        : <0x7bd>
 <1><853>: Abbrev Number: 10 (DW_TAG_array_type)
    <854>   DW_AT_type        : <0x397>
    <858>   DW_AT_sibling     : <0x863>
 <2><85c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <85d>   DW_AT_type        : <0x364>
    <861>   DW_AT_upper_bound : 2
 <2><862>: Abbrev Number: 0
 <1><863>: Abbrev Number: 23 (DW_TAG_structure_type)
    <864>   DW_AT_byte_size   : 16
    <865>   DW_AT_decl_file   : 4
    <866>   DW_AT_decl_line   : 736
    <868>   DW_AT_decl_column : 9
    <869>   DW_AT_sibling     : <0x8a6>
 <2><86d>: Abbrev Number: 24 (DW_TAG_member)
    <86e>   DW_AT_name        : CR1
    <872>   DW_AT_decl_file   : 4
    <873>   DW_AT_decl_line   : 738
    <875>   DW_AT_decl_column : 17
    <876>   DW_AT_type        : <0x3a3>
    <87a>   DW_AT_data_member_location: 0
 <2><87b>: Abbrev Number: 15 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0x6a9f8): CSR1
    <880>   DW_AT_decl_file   : 4
    <881>   DW_AT_decl_line   : 739
    <883>   DW_AT_decl_column : 17
    <884>   DW_AT_type        : <0x3a3>
    <888>   DW_AT_data_member_location: 4
 <2><889>: Abbrev Number: 24 (DW_TAG_member)
    <88a>   DW_AT_name        : CR2
    <88e>   DW_AT_decl_file   : 4
    <88f>   DW_AT_decl_line   : 740
    <891>   DW_AT_decl_column : 17
    <892>   DW_AT_type        : <0x3a3>
    <896>   DW_AT_data_member_location: 8
 <2><897>: Abbrev Number: 15 (DW_TAG_member)
    <898>   DW_AT_name        : (indirect string, offset: 0x6a9fd): CSR2
    <89c>   DW_AT_decl_file   : 4
    <89d>   DW_AT_decl_line   : 741
    <89f>   DW_AT_decl_column : 17
    <8a0>   DW_AT_type        : <0x3a3>
    <8a4>   DW_AT_data_member_location: 12
 <2><8a5>: Abbrev Number: 0
 <1><8a6>: Abbrev Number: 19 (DW_TAG_typedef)
    <8a7>   DW_AT_name        : (indirect string, offset: 0xbc5ba): PWR_TypeDef
    <8ab>   DW_AT_decl_file   : 4
    <8ac>   DW_AT_decl_line   : 742
    <8ae>   DW_AT_decl_column : 3
    <8af>   DW_AT_type        : <0x863>
 <1><8b3>: Abbrev Number: 23 (DW_TAG_structure_type)
    <8b4>   DW_AT_byte_size   : 148
    <8b5>   DW_AT_decl_file   : 4
    <8b6>   DW_AT_decl_line   : 749
    <8b8>   DW_AT_decl_column : 9
    <8b9>   DW_AT_sibling     : <0xa8b>
 <2><8bd>: Abbrev Number: 24 (DW_TAG_member)
    <8be>   DW_AT_name        : CR
    <8c1>   DW_AT_decl_file   : 4
    <8c2>   DW_AT_decl_line   : 751
    <8c4>   DW_AT_decl_column : 17
    <8c5>   DW_AT_type        : <0x3a3>
    <8c9>   DW_AT_data_member_location: 0
 <2><8ca>: Abbrev Number: 15 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xb6b8c): PLLCFGR
    <8cf>   DW_AT_decl_file   : 4
    <8d0>   DW_AT_decl_line   : 752
    <8d2>   DW_AT_decl_column : 17
    <8d3>   DW_AT_type        : <0x3a3>
    <8d7>   DW_AT_data_member_location: 4
 <2><8d8>: Abbrev Number: 15 (DW_TAG_member)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x46e7b): CFGR
    <8dd>   DW_AT_decl_file   : 4
    <8de>   DW_AT_decl_line   : 753
    <8e0>   DW_AT_decl_column : 17
    <8e1>   DW_AT_type        : <0x3a3>
    <8e5>   DW_AT_data_member_location: 8
 <2><8e6>: Abbrev Number: 24 (DW_TAG_member)
    <8e7>   DW_AT_name        : CIR
    <8eb>   DW_AT_decl_file   : 4
    <8ec>   DW_AT_decl_line   : 754
    <8ee>   DW_AT_decl_column : 17
    <8ef>   DW_AT_type        : <0x3a3>
    <8f3>   DW_AT_data_member_location: 12
 <2><8f4>: Abbrev Number: 15 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0xcf7e7): AHB1RSTR
    <8f9>   DW_AT_decl_file   : 4
    <8fa>   DW_AT_decl_line   : 755
    <8fc>   DW_AT_decl_column : 17
    <8fd>   DW_AT_type        : <0x3a3>
    <901>   DW_AT_data_member_location: 16
 <2><902>: Abbrev Number: 15 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0x1df8e): AHB2RSTR
    <907>   DW_AT_decl_file   : 4
    <908>   DW_AT_decl_line   : 756
    <90a>   DW_AT_decl_column : 17
    <90b>   DW_AT_type        : <0x3a3>
    <90f>   DW_AT_data_member_location: 20
 <2><910>: Abbrev Number: 15 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0x717c7): AHB3RSTR
    <915>   DW_AT_decl_file   : 4
    <916>   DW_AT_decl_line   : 757
    <918>   DW_AT_decl_column : 17
    <919>   DW_AT_type        : <0x3a3>
    <91d>   DW_AT_data_member_location: 24
 <2><91e>: Abbrev Number: 15 (DW_TAG_member)
    <91f>   DW_AT_name        : (indirect string, offset: 0xf5142): RESERVED0
    <923>   DW_AT_decl_file   : 4
    <924>   DW_AT_decl_line   : 758
    <926>   DW_AT_decl_column : 17
    <927>   DW_AT_type        : <0x397>
    <92b>   DW_AT_data_member_location: 28
 <2><92c>: Abbrev Number: 15 (DW_TAG_member)
    <92d>   DW_AT_name        : (indirect string, offset: 0x1d939): APB1RSTR
    <931>   DW_AT_decl_file   : 4
    <932>   DW_AT_decl_line   : 759
    <934>   DW_AT_decl_column : 17
    <935>   DW_AT_type        : <0x3a3>
    <939>   DW_AT_data_member_location: 32
 <2><93a>: Abbrev Number: 15 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0x71083): APB2RSTR
    <93f>   DW_AT_decl_file   : 4
    <940>   DW_AT_decl_line   : 760
    <942>   DW_AT_decl_column : 17
    <943>   DW_AT_type        : <0x3a3>
    <947>   DW_AT_data_member_location: 36
 <2><948>: Abbrev Number: 15 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0xf514c): RESERVED1
    <94d>   DW_AT_decl_file   : 4
    <94e>   DW_AT_decl_line   : 761
    <950>   DW_AT_decl_column : 17
    <951>   DW_AT_type        : <0x5f5>
    <955>   DW_AT_data_member_location: 40
 <2><956>: Abbrev Number: 15 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x1534c): AHB1ENR
    <95b>   DW_AT_decl_file   : 4
    <95c>   DW_AT_decl_line   : 762
    <95e>   DW_AT_decl_column : 17
    <95f>   DW_AT_type        : <0x3a3>
    <963>   DW_AT_data_member_location: 48
 <2><964>: Abbrev Number: 15 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x441da): AHB2ENR
    <969>   DW_AT_decl_file   : 4
    <96a>   DW_AT_decl_line   : 763
    <96c>   DW_AT_decl_column : 17
    <96d>   DW_AT_type        : <0x3a3>
    <971>   DW_AT_data_member_location: 52
 <2><972>: Abbrev Number: 15 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x74e5d): AHB3ENR
    <977>   DW_AT_decl_file   : 4
    <978>   DW_AT_decl_line   : 764
    <97a>   DW_AT_decl_column : 17
    <97b>   DW_AT_type        : <0x3a3>
    <97f>   DW_AT_data_member_location: 56
 <2><980>: Abbrev Number: 15 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0xf5156): RESERVED2
    <985>   DW_AT_decl_file   : 4
    <986>   DW_AT_decl_line   : 765
    <988>   DW_AT_decl_column : 17
    <989>   DW_AT_type        : <0x397>
    <98d>   DW_AT_data_member_location: 60
 <2><98e>: Abbrev Number: 15 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0x9565d): APB1ENR
    <993>   DW_AT_decl_file   : 4
    <994>   DW_AT_decl_line   : 766
    <996>   DW_AT_decl_column : 17
    <997>   DW_AT_type        : <0x3a3>
    <99b>   DW_AT_data_member_location: 64
 <2><99c>: Abbrev Number: 15 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0x7dd3a): APB2ENR
    <9a1>   DW_AT_decl_file   : 4
    <9a2>   DW_AT_decl_line   : 767
    <9a4>   DW_AT_decl_column : 17
    <9a5>   DW_AT_type        : <0x3a3>
    <9a9>   DW_AT_data_member_location: 68
 <2><9aa>: Abbrev Number: 15 (DW_TAG_member)
    <9ab>   DW_AT_name        : (indirect string, offset: 0xf5160): RESERVED3
    <9af>   DW_AT_decl_file   : 4
    <9b0>   DW_AT_decl_line   : 768
    <9b2>   DW_AT_decl_column : 17
    <9b3>   DW_AT_type        : <0x5f5>
    <9b7>   DW_AT_data_member_location: 72
 <2><9b8>: Abbrev Number: 15 (DW_TAG_member)
    <9b9>   DW_AT_name        : (indirect string, offset: 0xd4849): AHB1LPENR
    <9bd>   DW_AT_decl_file   : 4
    <9be>   DW_AT_decl_line   : 769
    <9c0>   DW_AT_decl_column : 17
    <9c1>   DW_AT_type        : <0x3a3>
    <9c5>   DW_AT_data_member_location: 80
 <2><9c6>: Abbrev Number: 15 (DW_TAG_member)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x39764): AHB2LPENR
    <9cb>   DW_AT_decl_file   : 4
    <9cc>   DW_AT_decl_line   : 770
    <9ce>   DW_AT_decl_column : 17
    <9cf>   DW_AT_type        : <0x3a3>
    <9d3>   DW_AT_data_member_location: 84
 <2><9d4>: Abbrev Number: 15 (DW_TAG_member)
    <9d5>   DW_AT_name        : (indirect string, offset: 0xb0b1d): AHB3LPENR
    <9d9>   DW_AT_decl_file   : 4
    <9da>   DW_AT_decl_line   : 771
    <9dc>   DW_AT_decl_column : 17
    <9dd>   DW_AT_type        : <0x3a3>
    <9e1>   DW_AT_data_member_location: 88
 <2><9e2>: Abbrev Number: 15 (DW_TAG_member)
    <9e3>   DW_AT_name        : (indirect string, offset: 0xf516a): RESERVED4
    <9e7>   DW_AT_decl_file   : 4
    <9e8>   DW_AT_decl_line   : 772
    <9ea>   DW_AT_decl_column : 17
    <9eb>   DW_AT_type        : <0x397>
    <9ef>   DW_AT_data_member_location: 92
 <2><9f0>: Abbrev Number: 15 (DW_TAG_member)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xda84b): APB1LPENR
    <9f5>   DW_AT_decl_file   : 4
    <9f6>   DW_AT_decl_line   : 773
    <9f8>   DW_AT_decl_column : 17
    <9f9>   DW_AT_type        : <0x3a3>
    <9fd>   DW_AT_data_member_location: 96
 <2><9fe>: Abbrev Number: 15 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x2a9b5): APB2LPENR
    <a03>   DW_AT_decl_file   : 4
    <a04>   DW_AT_decl_line   : 774
    <a06>   DW_AT_decl_column : 17
    <a07>   DW_AT_type        : <0x3a3>
    <a0b>   DW_AT_data_member_location: 100
 <2><a0c>: Abbrev Number: 15 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0xf5174): RESERVED5
    <a11>   DW_AT_decl_file   : 4
    <a12>   DW_AT_decl_line   : 775
    <a14>   DW_AT_decl_column : 17
    <a15>   DW_AT_type        : <0x5f5>
    <a19>   DW_AT_data_member_location: 104
 <2><a1a>: Abbrev Number: 15 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x23a8c): BDCR
    <a1f>   DW_AT_decl_file   : 4
    <a20>   DW_AT_decl_line   : 776
    <a22>   DW_AT_decl_column : 17
    <a23>   DW_AT_type        : <0x3a3>
    <a27>   DW_AT_data_member_location: 112
 <2><a28>: Abbrev Number: 24 (DW_TAG_member)
    <a29>   DW_AT_name        : CSR
    <a2d>   DW_AT_decl_file   : 4
    <a2e>   DW_AT_decl_line   : 777
    <a30>   DW_AT_decl_column : 17
    <a31>   DW_AT_type        : <0x3a3>
    <a35>   DW_AT_data_member_location: 116
 <2><a36>: Abbrev Number: 15 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0xf517e): RESERVED6
    <a3b>   DW_AT_decl_file   : 4
    <a3c>   DW_AT_decl_line   : 778
    <a3e>   DW_AT_decl_column : 17
    <a3f>   DW_AT_type        : <0x5f5>
    <a43>   DW_AT_data_member_location: 120
 <2><a44>: Abbrev Number: 15 (DW_TAG_member)
    <a45>   DW_AT_name        : (indirect string, offset: 0x89a1c): SSCGR
    <a49>   DW_AT_decl_file   : 4
    <a4a>   DW_AT_decl_line   : 779
    <a4c>   DW_AT_decl_column : 17
    <a4d>   DW_AT_type        : <0x3a3>
    <a51>   DW_AT_data_member_location: 128
 <2><a52>: Abbrev Number: 15 (DW_TAG_member)
    <a53>   DW_AT_name        : (indirect string, offset: 0x55f84): PLLI2SCFGR
    <a57>   DW_AT_decl_file   : 4
    <a58>   DW_AT_decl_line   : 780
    <a5a>   DW_AT_decl_column : 17
    <a5b>   DW_AT_type        : <0x3a3>
    <a5f>   DW_AT_data_member_location: 132
 <2><a60>: Abbrev Number: 15 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0x46e75): PLLSAICFGR
    <a65>   DW_AT_decl_file   : 4
    <a66>   DW_AT_decl_line   : 781
    <a68>   DW_AT_decl_column : 17
    <a69>   DW_AT_type        : <0x3a3>
    <a6d>   DW_AT_data_member_location: 136
 <2><a6e>: Abbrev Number: 15 (DW_TAG_member)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x19e7d): DCKCFGR1
    <a73>   DW_AT_decl_file   : 4
    <a74>   DW_AT_decl_line   : 782
    <a76>   DW_AT_decl_column : 17
    <a77>   DW_AT_type        : <0x3a3>
    <a7b>   DW_AT_data_member_location: 140
 <2><a7c>: Abbrev Number: 15 (DW_TAG_member)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x83c54): DCKCFGR2
    <a81>   DW_AT_decl_file   : 4
    <a82>   DW_AT_decl_line   : 783
    <a84>   DW_AT_decl_column : 17
    <a85>   DW_AT_type        : <0x3a3>
    <a89>   DW_AT_data_member_location: 144
 <2><a8a>: Abbrev Number: 0
 <1><a8b>: Abbrev Number: 19 (DW_TAG_typedef)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x78791): RCC_TypeDef
    <a90>   DW_AT_decl_file   : 4
    <a91>   DW_AT_decl_line   : 785
    <a93>   DW_AT_decl_column : 3
    <a94>   DW_AT_type        : <0x8b3>
 <1><a98>: Abbrev Number: 23 (DW_TAG_structure_type)
    <a99>   DW_AT_byte_size   : 104
    <a9a>   DW_AT_decl_file   : 4
    <a9b>   DW_AT_decl_line   : 954
    <a9d>   DW_AT_decl_column : 9
    <a9e>   DW_AT_sibling     : <0xc0d>
 <2><aa2>: Abbrev Number: 24 (DW_TAG_member)
    <aa3>   DW_AT_name        : CR1
    <aa7>   DW_AT_decl_file   : 4
    <aa8>   DW_AT_decl_line   : 956
    <aaa>   DW_AT_decl_column : 17
    <aab>   DW_AT_type        : <0x3a3>
    <aaf>   DW_AT_data_member_location: 0
 <2><ab0>: Abbrev Number: 24 (DW_TAG_member)
    <ab1>   DW_AT_name        : CR2
    <ab5>   DW_AT_decl_file   : 4
    <ab6>   DW_AT_decl_line   : 957
    <ab8>   DW_AT_decl_column : 17
    <ab9>   DW_AT_type        : <0x3a3>
    <abd>   DW_AT_data_member_location: 4
 <2><abe>: Abbrev Number: 15 (DW_TAG_member)
    <abf>   DW_AT_name        : (indirect string, offset: 0x2e1e0): SMCR
    <ac3>   DW_AT_decl_file   : 4
    <ac4>   DW_AT_decl_line   : 958
    <ac6>   DW_AT_decl_column : 17
    <ac7>   DW_AT_type        : <0x3a3>
    <acb>   DW_AT_data_member_location: 8
 <2><acc>: Abbrev Number: 15 (DW_TAG_member)
    <acd>   DW_AT_name        : (indirect string, offset: 0x5784b): DIER
    <ad1>   DW_AT_decl_file   : 4
    <ad2>   DW_AT_decl_line   : 959
    <ad4>   DW_AT_decl_column : 17
    <ad5>   DW_AT_type        : <0x3a3>
    <ad9>   DW_AT_data_member_location: 12
 <2><ada>: Abbrev Number: 24 (DW_TAG_member)
    <adb>   DW_AT_name        : SR
    <ade>   DW_AT_decl_file   : 4
    <adf>   DW_AT_decl_line   : 960
    <ae1>   DW_AT_decl_column : 17
    <ae2>   DW_AT_type        : <0x3a3>
    <ae6>   DW_AT_data_member_location: 16
 <2><ae7>: Abbrev Number: 24 (DW_TAG_member)
    <ae8>   DW_AT_name        : EGR
    <aec>   DW_AT_decl_file   : 4
    <aed>   DW_AT_decl_line   : 961
    <aef>   DW_AT_decl_column : 17
    <af0>   DW_AT_type        : <0x3a3>
    <af4>   DW_AT_data_member_location: 20
 <2><af5>: Abbrev Number: 15 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0xbeba0): CCMR1
    <afa>   DW_AT_decl_file   : 4
    <afb>   DW_AT_decl_line   : 962
    <afd>   DW_AT_decl_column : 17
    <afe>   DW_AT_type        : <0x3a3>
    <b02>   DW_AT_data_member_location: 24
 <2><b03>: Abbrev Number: 15 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0x1dfb5): CCMR2
    <b08>   DW_AT_decl_file   : 4
    <b09>   DW_AT_decl_line   : 963
    <b0b>   DW_AT_decl_column : 17
    <b0c>   DW_AT_type        : <0x3a3>
    <b10>   DW_AT_data_member_location: 28
 <2><b11>: Abbrev Number: 15 (DW_TAG_member)
    <b12>   DW_AT_name        : (indirect string, offset: 0x3e526): CCER
    <b16>   DW_AT_decl_file   : 4
    <b17>   DW_AT_decl_line   : 964
    <b19>   DW_AT_decl_column : 17
    <b1a>   DW_AT_type        : <0x3a3>
    <b1e>   DW_AT_data_member_location: 32
 <2><b1f>: Abbrev Number: 24 (DW_TAG_member)
    <b20>   DW_AT_name        : CNT
    <b24>   DW_AT_decl_file   : 4
    <b25>   DW_AT_decl_line   : 965
    <b27>   DW_AT_decl_column : 17
    <b28>   DW_AT_type        : <0x3a3>
    <b2c>   DW_AT_data_member_location: 36
 <2><b2d>: Abbrev Number: 24 (DW_TAG_member)
    <b2e>   DW_AT_name        : PSC
    <b32>   DW_AT_decl_file   : 4
    <b33>   DW_AT_decl_line   : 966
    <b35>   DW_AT_decl_column : 17
    <b36>   DW_AT_type        : <0x3a3>
    <b3a>   DW_AT_data_member_location: 40
 <2><b3b>: Abbrev Number: 24 (DW_TAG_member)
    <b3c>   DW_AT_name        : ARR
    <b40>   DW_AT_decl_file   : 4
    <b41>   DW_AT_decl_line   : 967
    <b43>   DW_AT_decl_column : 17
    <b44>   DW_AT_type        : <0x3a3>
    <b48>   DW_AT_data_member_location: 44
 <2><b49>: Abbrev Number: 24 (DW_TAG_member)
    <b4a>   DW_AT_name        : RCR
    <b4e>   DW_AT_decl_file   : 4
    <b4f>   DW_AT_decl_line   : 968
    <b51>   DW_AT_decl_column : 17
    <b52>   DW_AT_type        : <0x3a3>
    <b56>   DW_AT_data_member_location: 48
 <2><b57>: Abbrev Number: 15 (DW_TAG_member)
    <b58>   DW_AT_name        : (indirect string, offset: 0x32bcf): CCR1
    <b5c>   DW_AT_decl_file   : 4
    <b5d>   DW_AT_decl_line   : 969
    <b5f>   DW_AT_decl_column : 17
    <b60>   DW_AT_type        : <0x3a3>
    <b64>   DW_AT_data_member_location: 52
 <2><b65>: Abbrev Number: 15 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0x6d6d3): CCR2
    <b6a>   DW_AT_decl_file   : 4
    <b6b>   DW_AT_decl_line   : 970
    <b6d>   DW_AT_decl_column : 17
    <b6e>   DW_AT_type        : <0x3a3>
    <b72>   DW_AT_data_member_location: 56
 <2><b73>: Abbrev Number: 15 (DW_TAG_member)
    <b74>   DW_AT_name        : (indirect string, offset: 0x62cbc): CCR3
    <b78>   DW_AT_decl_file   : 4
    <b79>   DW_AT_decl_line   : 971
    <b7b>   DW_AT_decl_column : 17
    <b7c>   DW_AT_type        : <0x3a3>
    <b80>   DW_AT_data_member_location: 60
 <2><b81>: Abbrev Number: 15 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0x107e5): CCR4
    <b86>   DW_AT_decl_file   : 4
    <b87>   DW_AT_decl_line   : 972
    <b89>   DW_AT_decl_column : 17
    <b8a>   DW_AT_type        : <0x3a3>
    <b8e>   DW_AT_data_member_location: 64
 <2><b8f>: Abbrev Number: 15 (DW_TAG_member)
    <b90>   DW_AT_name        : (indirect string, offset: 0xb23e5): BDTR
    <b94>   DW_AT_decl_file   : 4
    <b95>   DW_AT_decl_line   : 973
    <b97>   DW_AT_decl_column : 17
    <b98>   DW_AT_type        : <0x3a3>
    <b9c>   DW_AT_data_member_location: 68
 <2><b9d>: Abbrev Number: 24 (DW_TAG_member)
    <b9e>   DW_AT_name        : DCR
    <ba2>   DW_AT_decl_file   : 4
    <ba3>   DW_AT_decl_line   : 974
    <ba5>   DW_AT_decl_column : 17
    <ba6>   DW_AT_type        : <0x3a3>
    <baa>   DW_AT_data_member_location: 72
 <2><bab>: Abbrev Number: 15 (DW_TAG_member)
    <bac>   DW_AT_name        : (indirect string, offset: 0xc14d3): DMAR
    <bb0>   DW_AT_decl_file   : 4
    <bb1>   DW_AT_decl_line   : 975
    <bb3>   DW_AT_decl_column : 17
    <bb4>   DW_AT_type        : <0x3a3>
    <bb8>   DW_AT_data_member_location: 76
 <2><bb9>: Abbrev Number: 24 (DW_TAG_member)
    <bba>   DW_AT_name        : OR
    <bbd>   DW_AT_decl_file   : 4
    <bbe>   DW_AT_decl_line   : 976
    <bc0>   DW_AT_decl_column : 17
    <bc1>   DW_AT_type        : <0x3a3>
    <bc5>   DW_AT_data_member_location: 80
 <2><bc6>: Abbrev Number: 15 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0xe756b): CCMR3
    <bcb>   DW_AT_decl_file   : 4
    <bcc>   DW_AT_decl_line   : 977
    <bce>   DW_AT_decl_column : 17
    <bcf>   DW_AT_type        : <0x3a3>
    <bd3>   DW_AT_data_member_location: 84
 <2><bd4>: Abbrev Number: 15 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x5e772): CCR5
    <bd9>   DW_AT_decl_file   : 4
    <bda>   DW_AT_decl_line   : 978
    <bdc>   DW_AT_decl_column : 17
    <bdd>   DW_AT_type        : <0x3a3>
    <be1>   DW_AT_data_member_location: 88
 <2><be2>: Abbrev Number: 15 (DW_TAG_member)
    <be3>   DW_AT_name        : (indirect string, offset: 0xb8432): CCR6
    <be7>   DW_AT_decl_file   : 4
    <be8>   DW_AT_decl_line   : 979
    <bea>   DW_AT_decl_column : 17
    <beb>   DW_AT_type        : <0x3a3>
    <bef>   DW_AT_data_member_location: 92
 <2><bf0>: Abbrev Number: 24 (DW_TAG_member)
    <bf1>   DW_AT_name        : AF1
    <bf5>   DW_AT_decl_file   : 4
    <bf6>   DW_AT_decl_line   : 980
    <bf8>   DW_AT_decl_column : 17
    <bf9>   DW_AT_type        : <0x3a3>
    <bfd>   DW_AT_data_member_location: 96
 <2><bfe>: Abbrev Number: 24 (DW_TAG_member)
    <bff>   DW_AT_name        : AF2
    <c03>   DW_AT_decl_file   : 4
    <c04>   DW_AT_decl_line   : 981
    <c06>   DW_AT_decl_column : 17
    <c07>   DW_AT_type        : <0x3a3>
    <c0b>   DW_AT_data_member_location: 100
 <2><c0c>: Abbrev Number: 0
 <1><c0d>: Abbrev Number: 19 (DW_TAG_typedef)
    <c0e>   DW_AT_name        : (indirect string, offset: 0xf5e34): TIM_TypeDef
    <c12>   DW_AT_decl_file   : 4
    <c13>   DW_AT_decl_line   : 983
    <c15>   DW_AT_decl_column : 3
    <c16>   DW_AT_type        : <0xa98>
 <1><c1a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <c1b>   DW_AT_byte_size   : 44
    <c1c>   DW_AT_decl_file   : 4
    <c1d>   DW_AT_decl_line   : 1005
    <c1f>   DW_AT_decl_column : 9
    <c20>   DW_AT_sibling     : <0xcbf>
 <2><c24>: Abbrev Number: 24 (DW_TAG_member)
    <c25>   DW_AT_name        : CR1
    <c29>   DW_AT_decl_file   : 4
    <c2a>   DW_AT_decl_line   : 1007
    <c2c>   DW_AT_decl_column : 17
    <c2d>   DW_AT_type        : <0x3a3>
    <c31>   DW_AT_data_member_location: 0
 <2><c32>: Abbrev Number: 24 (DW_TAG_member)
    <c33>   DW_AT_name        : CR2
    <c37>   DW_AT_decl_file   : 4
    <c38>   DW_AT_decl_line   : 1008
    <c3a>   DW_AT_decl_column : 17
    <c3b>   DW_AT_type        : <0x3a3>
    <c3f>   DW_AT_data_member_location: 4
 <2><c40>: Abbrev Number: 24 (DW_TAG_member)
    <c41>   DW_AT_name        : CR3
    <c45>   DW_AT_decl_file   : 4
    <c46>   DW_AT_decl_line   : 1009
    <c48>   DW_AT_decl_column : 17
    <c49>   DW_AT_type        : <0x3a3>
    <c4d>   DW_AT_data_member_location: 8
 <2><c4e>: Abbrev Number: 24 (DW_TAG_member)
    <c4f>   DW_AT_name        : BRR
    <c53>   DW_AT_decl_file   : 4
    <c54>   DW_AT_decl_line   : 1010
    <c56>   DW_AT_decl_column : 17
    <c57>   DW_AT_type        : <0x3a3>
    <c5b>   DW_AT_data_member_location: 12
 <2><c5c>: Abbrev Number: 15 (DW_TAG_member)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x47133): GTPR
    <c61>   DW_AT_decl_file   : 4
    <c62>   DW_AT_decl_line   : 1011
    <c64>   DW_AT_decl_column : 17
    <c65>   DW_AT_type        : <0x3a3>
    <c69>   DW_AT_data_member_location: 16
 <2><c6a>: Abbrev Number: 15 (DW_TAG_member)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xe4cb0): RTOR
    <c6f>   DW_AT_decl_file   : 4
    <c70>   DW_AT_decl_line   : 1012
    <c72>   DW_AT_decl_column : 17
    <c73>   DW_AT_type        : <0x3a3>
    <c77>   DW_AT_data_member_location: 20
 <2><c78>: Abbrev Number: 24 (DW_TAG_member)
    <c79>   DW_AT_name        : RQR
    <c7d>   DW_AT_decl_file   : 4
    <c7e>   DW_AT_decl_line   : 1013
    <c80>   DW_AT_decl_column : 17
    <c81>   DW_AT_type        : <0x3a3>
    <c85>   DW_AT_data_member_location: 24
 <2><c86>: Abbrev Number: 24 (DW_TAG_member)
    <c87>   DW_AT_name        : ISR
    <c8b>   DW_AT_decl_file   : 4
    <c8c>   DW_AT_decl_line   : 1014
    <c8e>   DW_AT_decl_column : 17
    <c8f>   DW_AT_type        : <0x3a3>
    <c93>   DW_AT_data_member_location: 28
 <2><c94>: Abbrev Number: 24 (DW_TAG_member)
    <c95>   DW_AT_name        : ICR
    <c99>   DW_AT_decl_file   : 4
    <c9a>   DW_AT_decl_line   : 1015
    <c9c>   DW_AT_decl_column : 17
    <c9d>   DW_AT_type        : <0x3a3>
    <ca1>   DW_AT_data_member_location: 32
 <2><ca2>: Abbrev Number: 24 (DW_TAG_member)
    <ca3>   DW_AT_name        : RDR
    <ca7>   DW_AT_decl_file   : 4
    <ca8>   DW_AT_decl_line   : 1016
    <caa>   DW_AT_decl_column : 17
    <cab>   DW_AT_type        : <0x3a3>
    <caf>   DW_AT_data_member_location: 36
 <2><cb0>: Abbrev Number: 24 (DW_TAG_member)
    <cb1>   DW_AT_name        : TDR
    <cb5>   DW_AT_decl_file   : 4
    <cb6>   DW_AT_decl_line   : 1017
    <cb8>   DW_AT_decl_column : 17
    <cb9>   DW_AT_type        : <0x3a3>
    <cbd>   DW_AT_data_member_location: 40
 <2><cbe>: Abbrev Number: 0
 <1><cbf>: Abbrev Number: 19 (DW_TAG_typedef)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x8af78): USART_TypeDef
    <cc4>   DW_AT_decl_file   : 4
    <cc5>   DW_AT_decl_line   : 1018
    <cc7>   DW_AT_decl_column : 3
    <cc8>   DW_AT_type        : <0xc1a>
 <1><ccc>: Abbrev Number: 14 (DW_TAG_structure_type)
    <ccd>   DW_AT_byte_size   : 320
    <ccf>   DW_AT_decl_file   : 4
    <cd0>   DW_AT_decl_line   : 1051
    <cd2>   DW_AT_decl_column : 9
    <cd3>   DW_AT_sibling     : <0xe2a>
 <2><cd7>: Abbrev Number: 15 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x1c368): GOTGCTL
    <cdc>   DW_AT_decl_file   : 4
    <cdd>   DW_AT_decl_line   : 1053
    <cdf>   DW_AT_decl_column : 16
    <ce0>   DW_AT_type        : <0x3a3>
    <ce4>   DW_AT_data_member_location: 0
 <2><ce5>: Abbrev Number: 15 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0xbe932): GOTGINT
    <cea>   DW_AT_decl_file   : 4
    <ceb>   DW_AT_decl_line   : 1054
    <ced>   DW_AT_decl_column : 17
    <cee>   DW_AT_type        : <0x3a3>
    <cf2>   DW_AT_data_member_location: 4
 <2><cf3>: Abbrev Number: 15 (DW_TAG_member)
    <cf4>   DW_AT_name        : (indirect string, offset: 0x3c33f): GAHBCFG
    <cf8>   DW_AT_decl_file   : 4
    <cf9>   DW_AT_decl_line   : 1055
    <cfb>   DW_AT_decl_column : 17
    <cfc>   DW_AT_type        : <0x3a3>
    <d00>   DW_AT_data_member_location: 8
 <2><d01>: Abbrev Number: 15 (DW_TAG_member)
    <d02>   DW_AT_name        : (indirect string, offset: 0x8ee81): GUSBCFG
    <d06>   DW_AT_decl_file   : 4
    <d07>   DW_AT_decl_line   : 1056
    <d09>   DW_AT_decl_column : 17
    <d0a>   DW_AT_type        : <0x3a3>
    <d0e>   DW_AT_data_member_location: 12
 <2><d0f>: Abbrev Number: 15 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0x959e3): GRSTCTL
    <d14>   DW_AT_decl_file   : 4
    <d15>   DW_AT_decl_line   : 1057
    <d17>   DW_AT_decl_column : 17
    <d18>   DW_AT_type        : <0x3a3>
    <d1c>   DW_AT_data_member_location: 16
 <2><d1d>: Abbrev Number: 15 (DW_TAG_member)
    <d1e>   DW_AT_name        : (indirect string, offset: 0xe2478): GINTSTS
    <d22>   DW_AT_decl_file   : 4
    <d23>   DW_AT_decl_line   : 1058
    <d25>   DW_AT_decl_column : 17
    <d26>   DW_AT_type        : <0x3a3>
    <d2a>   DW_AT_data_member_location: 20
 <2><d2b>: Abbrev Number: 15 (DW_TAG_member)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x38871): GINTMSK
    <d30>   DW_AT_decl_file   : 4
    <d31>   DW_AT_decl_line   : 1059
    <d33>   DW_AT_decl_column : 17
    <d34>   DW_AT_type        : <0x3a3>
    <d38>   DW_AT_data_member_location: 24
 <2><d39>: Abbrev Number: 15 (DW_TAG_member)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x53223): GRXSTSR
    <d3e>   DW_AT_decl_file   : 4
    <d3f>   DW_AT_decl_line   : 1060
    <d41>   DW_AT_decl_column : 17
    <d42>   DW_AT_type        : <0x3a3>
    <d46>   DW_AT_data_member_location: 28
 <2><d47>: Abbrev Number: 15 (DW_TAG_member)
    <d48>   DW_AT_name        : (indirect string, offset: 0x53201): GRXSTSP
    <d4c>   DW_AT_decl_file   : 4
    <d4d>   DW_AT_decl_line   : 1061
    <d4f>   DW_AT_decl_column : 17
    <d50>   DW_AT_type        : <0x3a3>
    <d54>   DW_AT_data_member_location: 32
 <2><d55>: Abbrev Number: 15 (DW_TAG_member)
    <d56>   DW_AT_name        : (indirect string, offset: 0xc9350): GRXFSIZ
    <d5a>   DW_AT_decl_file   : 4
    <d5b>   DW_AT_decl_line   : 1062
    <d5d>   DW_AT_decl_column : 17
    <d5e>   DW_AT_type        : <0x3a3>
    <d62>   DW_AT_data_member_location: 36
 <2><d63>: Abbrev Number: 15 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0xdd8c4): DIEPTXF0_HNPTXFSIZ
    <d68>   DW_AT_decl_file   : 4
    <d69>   DW_AT_decl_line   : 1063
    <d6b>   DW_AT_decl_column : 17
    <d6c>   DW_AT_type        : <0x3a3>
    <d70>   DW_AT_data_member_location: 40
 <2><d71>: Abbrev Number: 15 (DW_TAG_member)
    <d72>   DW_AT_name        : (indirect string, offset: 0xa04f1): HNPTXSTS
    <d76>   DW_AT_decl_file   : 4
    <d77>   DW_AT_decl_line   : 1064
    <d79>   DW_AT_decl_column : 17
    <d7a>   DW_AT_type        : <0x3a3>
    <d7e>   DW_AT_data_member_location: 44
 <2><d7f>: Abbrev Number: 15 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0x4ea25): Reserved30
    <d84>   DW_AT_decl_file   : 4
    <d85>   DW_AT_decl_line   : 1065
    <d87>   DW_AT_decl_column : 12
    <d88>   DW_AT_type        : <0x5f5>
    <d8c>   DW_AT_data_member_location: 48
 <2><d8d>: Abbrev Number: 15 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0xc1b7c): GCCFG
    <d92>   DW_AT_decl_file   : 4
    <d93>   DW_AT_decl_line   : 1066
    <d95>   DW_AT_decl_column : 17
    <d96>   DW_AT_type        : <0x3a3>
    <d9a>   DW_AT_data_member_location: 56
 <2><d9b>: Abbrev Number: 24 (DW_TAG_member)
    <d9c>   DW_AT_name        : CID
    <da0>   DW_AT_decl_file   : 4
    <da1>   DW_AT_decl_line   : 1067
    <da3>   DW_AT_decl_column : 17
    <da4>   DW_AT_type        : <0x3a3>
    <da8>   DW_AT_data_member_location: 60
 <2><da9>: Abbrev Number: 15 (DW_TAG_member)
    <daa>   DW_AT_name        : (indirect string, offset: 0x59a98): Reserved5
    <dae>   DW_AT_decl_file   : 4
    <daf>   DW_AT_decl_line   : 1068
    <db1>   DW_AT_decl_column : 13
    <db2>   DW_AT_type        : <0x853>
    <db6>   DW_AT_data_member_location: 64
 <2><db7>: Abbrev Number: 15 (DW_TAG_member)
    <db8>   DW_AT_name        : (indirect string, offset: 0xbaa95): GHWCFG3
    <dbc>   DW_AT_decl_file   : 4
    <dbd>   DW_AT_decl_line   : 1069
    <dbf>   DW_AT_decl_column : 17
    <dc0>   DW_AT_type        : <0x3a3>
    <dc4>   DW_AT_data_member_location: 76
 <2><dc5>: Abbrev Number: 15 (DW_TAG_member)
    <dc6>   DW_AT_name        : (indirect string, offset: 0x59aa2): Reserved6
    <dca>   DW_AT_decl_file   : 4
    <dcb>   DW_AT_decl_line   : 1070
    <dcd>   DW_AT_decl_column : 13
    <dce>   DW_AT_type        : <0x397>
    <dd2>   DW_AT_data_member_location: 80
 <2><dd3>: Abbrev Number: 15 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x160d9): GLPMCFG
    <dd8>   DW_AT_decl_file   : 4
    <dd9>   DW_AT_decl_line   : 1071
    <ddb>   DW_AT_decl_column : 17
    <ddc>   DW_AT_type        : <0x3a3>
    <de0>   DW_AT_data_member_location: 84
 <2><de1>: Abbrev Number: 15 (DW_TAG_member)
    <de2>   DW_AT_name        : (indirect string, offset: 0x59aac): Reserved7
    <de6>   DW_AT_decl_file   : 4
    <de7>   DW_AT_decl_line   : 1072
    <de9>   DW_AT_decl_column : 13
    <dea>   DW_AT_type        : <0x397>
    <dee>   DW_AT_data_member_location: 88
 <2><def>: Abbrev Number: 15 (DW_TAG_member)
    <df0>   DW_AT_name        : (indirect string, offset: 0x5445a): GDFIFOCFG
    <df4>   DW_AT_decl_file   : 4
    <df5>   DW_AT_decl_line   : 1073
    <df7>   DW_AT_decl_column : 17
    <df8>   DW_AT_type        : <0x3a3>
    <dfc>   DW_AT_data_member_location: 92
 <2><dfd>: Abbrev Number: 15 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x4f65e): Reserved43
    <e02>   DW_AT_decl_file   : 4
    <e03>   DW_AT_decl_line   : 1074
    <e05>   DW_AT_decl_column : 13
    <e06>   DW_AT_type        : <0x798>
    <e0a>   DW_AT_data_member_location: 96
 <2><e0b>: Abbrev Number: 17 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x2bff9): HPTXFSIZ
    <e10>   DW_AT_decl_file   : 4
    <e11>   DW_AT_decl_line   : 1075
    <e13>   DW_AT_decl_column : 17
    <e14>   DW_AT_type        : <0x3a3>
    <e18>   DW_AT_data_member_location: 256
 <2><e1a>: Abbrev Number: 17 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x7f612): DIEPTXF
    <e1f>   DW_AT_decl_file   : 4
    <e20>   DW_AT_decl_line   : 1076
    <e22>   DW_AT_decl_column : 17
    <e23>   DW_AT_type        : <0xe3a>
    <e27>   DW_AT_data_member_location: 260
 <2><e29>: Abbrev Number: 0
 <1><e2a>: Abbrev Number: 10 (DW_TAG_array_type)
    <e2b>   DW_AT_type        : <0x3a3>
    <e2f>   DW_AT_sibling     : <0xe3a>
 <2><e33>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e34>   DW_AT_type        : <0x364>
    <e38>   DW_AT_upper_bound : 14
 <2><e39>: Abbrev Number: 0
 <1><e3a>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e3b>   DW_AT_type        : <0xe2a>
 <1><e3f>: Abbrev Number: 19 (DW_TAG_typedef)
    <e40>   DW_AT_name        : (indirect string, offset: 0xbf27b): USB_OTG_GlobalTypeDef
    <e44>   DW_AT_decl_file   : 4
    <e45>   DW_AT_decl_line   : 1077
    <e47>   DW_AT_decl_column : 3
    <e48>   DW_AT_type        : <0xccc>
 <1><e4c>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <e4d>   DW_AT_encoding    : 7	(unsigned)
    <e4e>   DW_AT_byte_size   : 1
    <e4f>   DW_AT_type        : <0x30f>
    <e53>   DW_AT_decl_file   : 7
    <e54>   DW_AT_decl_line   : 162
    <e55>   DW_AT_decl_column : 1
    <e56>   DW_AT_sibling     : <0xe67>
 <2><e5a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x305e5): DISABLE
    <e5f>   DW_AT_const_value : 0
 <2><e60>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e61>   DW_AT_name        : (indirect string, offset: 0x8a8f5): ENABLE
    <e65>   DW_AT_const_value : 1
 <2><e66>: Abbrev Number: 0
 <1><e67>: Abbrev Number: 6 (DW_TAG_typedef)
    <e68>   DW_AT_name        : (indirect string, offset: 0x23a18): FunctionalState
    <e6c>   DW_AT_decl_file   : 7
    <e6d>   DW_AT_decl_line   : 165
    <e6e>   DW_AT_decl_column : 3
    <e6f>   DW_AT_type        : <0xe4c>
 <1><e73>: Abbrev Number: 6 (DW_TAG_typedef)
    <e74>   DW_AT_name        : (indirect string, offset: 0xb829): size_t
    <e78>   DW_AT_decl_file   : 8
    <e79>   DW_AT_decl_line   : 209
    <e7a>   DW_AT_decl_column : 23
    <e7b>   DW_AT_type        : <0x364>
 <1><e7f>: Abbrev Number: 5 (DW_TAG_base_type)
    <e80>   DW_AT_byte_size   : 8
    <e81>   DW_AT_encoding    : 4	(float)
    <e82>   DW_AT_name        : (indirect string, offset: 0x17fa0): long double
 <1><e86>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <e87>   DW_AT_encoding    : 7	(unsigned)
    <e88>   DW_AT_byte_size   : 1
    <e89>   DW_AT_type        : <0x30f>
    <e8d>   DW_AT_decl_file   : 9
    <e8e>   DW_AT_decl_line   : 39
    <e8f>   DW_AT_decl_column : 1
    <e90>   DW_AT_sibling     : <0xead>
 <2><e94>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0x577ca): HAL_OK
    <e99>   DW_AT_const_value : 0
 <2><e9a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e9b>   DW_AT_name        : (indirect string, offset: 0xa2d65): HAL_ERROR
    <e9f>   DW_AT_const_value : 1
 <2><ea0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x2d133): HAL_BUSY
    <ea5>   DW_AT_const_value : 2
 <2><ea6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x4bfff): HAL_TIMEOUT
    <eab>   DW_AT_const_value : 3
 <2><eac>: Abbrev Number: 0
 <1><ead>: Abbrev Number: 6 (DW_TAG_typedef)
    <eae>   DW_AT_name        : (indirect string, offset: 0x2f7f): HAL_StatusTypeDef
    <eb2>   DW_AT_decl_file   : 9
    <eb3>   DW_AT_decl_line   : 44
    <eb4>   DW_AT_decl_column : 3
    <eb5>   DW_AT_type        : <0xe86>
 <1><eb9>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <eba>   DW_AT_encoding    : 7	(unsigned)
    <ebb>   DW_AT_byte_size   : 1
    <ebc>   DW_AT_type        : <0x30f>
    <ec0>   DW_AT_decl_file   : 9
    <ec1>   DW_AT_decl_line   : 50
    <ec2>   DW_AT_decl_column : 1
    <ec3>   DW_AT_sibling     : <0xed4>
 <2><ec7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xc0972): HAL_UNLOCKED
    <ecc>   DW_AT_const_value : 0
 <2><ecd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ece>   DW_AT_name        : (indirect string, offset: 0x103541): HAL_LOCKED
    <ed2>   DW_AT_const_value : 1
 <2><ed3>: Abbrev Number: 0
 <1><ed4>: Abbrev Number: 6 (DW_TAG_typedef)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x996a4): HAL_LockTypeDef
    <ed9>   DW_AT_decl_file   : 9
    <eda>   DW_AT_decl_line   : 53
    <edb>   DW_AT_decl_column : 3
    <edc>   DW_AT_type        : <0xeb9>
 <1><ee0>: Abbrev Number: 20 (DW_TAG_structure_type)
    <ee1>   DW_AT_byte_size   : 28
    <ee2>   DW_AT_decl_file   : 10
    <ee3>   DW_AT_decl_line   : 45
    <ee4>   DW_AT_decl_column : 9
    <ee5>   DW_AT_sibling     : <0xf45>
 <2><ee9>: Abbrev Number: 22 (DW_TAG_member)
    <eea>   DW_AT_name        : (indirect string, offset: 0xaf66a): PLLState
    <eee>   DW_AT_decl_file   : 10
    <eef>   DW_AT_decl_line   : 47
    <ef0>   DW_AT_decl_column : 12
    <ef1>   DW_AT_type        : <0x397>
    <ef5>   DW_AT_data_member_location: 0
 <2><ef6>: Abbrev Number: 22 (DW_TAG_member)
    <ef7>   DW_AT_name        : (indirect string, offset: 0xb5570): PLLSource
    <efb>   DW_AT_decl_file   : 10
    <efc>   DW_AT_decl_line   : 50
    <efd>   DW_AT_decl_column : 12
    <efe>   DW_AT_type        : <0x397>
    <f02>   DW_AT_data_member_location: 4
 <2><f03>: Abbrev Number: 22 (DW_TAG_member)
    <f04>   DW_AT_name        : (indirect string, offset: 0xd7ad4): PLLM
    <f08>   DW_AT_decl_file   : 10
    <f09>   DW_AT_decl_line   : 53
    <f0a>   DW_AT_decl_column : 12
    <f0b>   DW_AT_type        : <0x397>
    <f0f>   DW_AT_data_member_location: 8
 <2><f10>: Abbrev Number: 22 (DW_TAG_member)
    <f11>   DW_AT_name        : (indirect string, offset: 0xd7ad9): PLLN
    <f15>   DW_AT_decl_file   : 10
    <f16>   DW_AT_decl_line   : 56
    <f17>   DW_AT_decl_column : 12
    <f18>   DW_AT_type        : <0x397>
    <f1c>   DW_AT_data_member_location: 12
 <2><f1d>: Abbrev Number: 22 (DW_TAG_member)
    <f1e>   DW_AT_name        : (indirect string, offset: 0xd7af6): PLLP
    <f22>   DW_AT_decl_file   : 10
    <f23>   DW_AT_decl_line   : 59
    <f24>   DW_AT_decl_column : 12
    <f25>   DW_AT_type        : <0x397>
    <f29>   DW_AT_data_member_location: 16
 <2><f2a>: Abbrev Number: 22 (DW_TAG_member)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x70650): PLLQ
    <f2f>   DW_AT_decl_file   : 10
    <f30>   DW_AT_decl_line   : 62
    <f31>   DW_AT_decl_column : 12
    <f32>   DW_AT_type        : <0x397>
    <f36>   DW_AT_data_member_location: 20
 <2><f37>: Abbrev Number: 22 (DW_TAG_member)
    <f38>   DW_AT_name        : (indirect string, offset: 0xd7b13): PLLR
    <f3c>   DW_AT_decl_file   : 10
    <f3d>   DW_AT_decl_line   : 65
    <f3e>   DW_AT_decl_column : 12
    <f3f>   DW_AT_type        : <0x397>
    <f43>   DW_AT_data_member_location: 24
 <2><f44>: Abbrev Number: 0
 <1><f45>: Abbrev Number: 6 (DW_TAG_typedef)
    <f46>   DW_AT_name        : (indirect string, offset: 0x9d6a8): RCC_PLLInitTypeDef
    <f4a>   DW_AT_decl_file   : 10
    <f4b>   DW_AT_decl_line   : 69
    <f4c>   DW_AT_decl_column : 2
    <f4d>   DW_AT_type        : <0xee0>
 <1><f51>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f52>   DW_AT_byte_size   : 52
    <f53>   DW_AT_decl_file   : 11
    <f54>   DW_AT_decl_line   : 50
    <f55>   DW_AT_decl_column : 9
    <f56>   DW_AT_sibling     : <0xfb6>
 <2><f5a>: Abbrev Number: 22 (DW_TAG_member)
    <f5b>   DW_AT_name        : (indirect string, offset: 0xd3fca): OscillatorType
    <f5f>   DW_AT_decl_file   : 11
    <f60>   DW_AT_decl_line   : 52
    <f61>   DW_AT_decl_column : 12
    <f62>   DW_AT_type        : <0x397>
    <f66>   DW_AT_data_member_location: 0
 <2><f67>: Abbrev Number: 22 (DW_TAG_member)
    <f68>   DW_AT_name        : (indirect string, offset: 0xb142b): HSEState
    <f6c>   DW_AT_decl_file   : 11
    <f6d>   DW_AT_decl_line   : 55
    <f6e>   DW_AT_decl_column : 12
    <f6f>   DW_AT_type        : <0x397>
    <f73>   DW_AT_data_member_location: 4
 <2><f74>: Abbrev Number: 22 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0xa3d1e): LSEState
    <f79>   DW_AT_decl_file   : 11
    <f7a>   DW_AT_decl_line   : 58
    <f7b>   DW_AT_decl_column : 12
    <f7c>   DW_AT_type        : <0x397>
    <f80>   DW_AT_data_member_location: 8
 <2><f81>: Abbrev Number: 22 (DW_TAG_member)
    <f82>   DW_AT_name        : (indirect string, offset: 0x74196): HSIState
    <f86>   DW_AT_decl_file   : 11
    <f87>   DW_AT_decl_line   : 61
    <f88>   DW_AT_decl_column : 12
    <f89>   DW_AT_type        : <0x397>
    <f8d>   DW_AT_data_member_location: 12
 <2><f8e>: Abbrev Number: 22 (DW_TAG_member)
    <f8f>   DW_AT_name        : (indirect string, offset: 0xdf9ab): HSICalibrationValue
    <f93>   DW_AT_decl_file   : 11
    <f94>   DW_AT_decl_line   : 64
    <f95>   DW_AT_decl_column : 12
    <f96>   DW_AT_type        : <0x397>
    <f9a>   DW_AT_data_member_location: 16
 <2><f9b>: Abbrev Number: 22 (DW_TAG_member)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x5adce): LSIState
    <fa0>   DW_AT_decl_file   : 11
    <fa1>   DW_AT_decl_line   : 67
    <fa2>   DW_AT_decl_column : 12
    <fa3>   DW_AT_type        : <0x397>
    <fa7>   DW_AT_data_member_location: 20
 <2><fa8>: Abbrev Number: 21 (DW_TAG_member)
    <fa9>   DW_AT_name        : PLL
    <fad>   DW_AT_decl_file   : 11
    <fae>   DW_AT_decl_line   : 70
    <faf>   DW_AT_decl_column : 22
    <fb0>   DW_AT_type        : <0xf45>
    <fb4>   DW_AT_data_member_location: 24
 <2><fb5>: Abbrev Number: 0
 <1><fb6>: Abbrev Number: 6 (DW_TAG_typedef)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x89f23): RCC_OscInitTypeDef
    <fbb>   DW_AT_decl_file   : 11
    <fbc>   DW_AT_decl_line   : 72
    <fbd>   DW_AT_decl_column : 2
    <fbe>   DW_AT_type        : <0xf51>
 <1><fc2>: Abbrev Number: 20 (DW_TAG_structure_type)
    <fc3>   DW_AT_byte_size   : 20
    <fc4>   DW_AT_decl_file   : 11
    <fc5>   DW_AT_decl_line   : 77
    <fc6>   DW_AT_decl_column : 9
    <fc7>   DW_AT_sibling     : <0x100d>
 <2><fcb>: Abbrev Number: 22 (DW_TAG_member)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x4f885): ClockType
    <fd0>   DW_AT_decl_file   : 11
    <fd1>   DW_AT_decl_line   : 79
    <fd2>   DW_AT_decl_column : 12
    <fd3>   DW_AT_type        : <0x397>
    <fd7>   DW_AT_data_member_location: 0
 <2><fd8>: Abbrev Number: 22 (DW_TAG_member)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x9d193): SYSCLKSource
    <fdd>   DW_AT_decl_file   : 11
    <fde>   DW_AT_decl_line   : 82
    <fdf>   DW_AT_decl_column : 12
    <fe0>   DW_AT_type        : <0x397>
    <fe4>   DW_AT_data_member_location: 4
 <2><fe5>: Abbrev Number: 22 (DW_TAG_member)
    <fe6>   DW_AT_name        : (indirect string, offset: 0xd7382): AHBCLKDivider
    <fea>   DW_AT_decl_file   : 11
    <feb>   DW_AT_decl_line   : 85
    <fec>   DW_AT_decl_column : 12
    <fed>   DW_AT_type        : <0x397>
    <ff1>   DW_AT_data_member_location: 8
 <2><ff2>: Abbrev Number: 22 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xa7da): APB1CLKDivider
    <ff7>   DW_AT_decl_file   : 11
    <ff8>   DW_AT_decl_line   : 88
    <ff9>   DW_AT_decl_column : 12
    <ffa>   DW_AT_type        : <0x397>
    <ffe>   DW_AT_data_member_location: 12
 <2><fff>: Abbrev Number: 22 (DW_TAG_member)
    <1000>   DW_AT_name        : (indirect string, offset: 0x772a8): APB2CLKDivider
    <1004>   DW_AT_decl_file   : 11
    <1005>   DW_AT_decl_line   : 91
    <1006>   DW_AT_decl_column : 12
    <1007>   DW_AT_type        : <0x397>
    <100b>   DW_AT_data_member_location: 16
 <2><100c>: Abbrev Number: 0
 <1><100d>: Abbrev Number: 6 (DW_TAG_typedef)
    <100e>   DW_AT_name        : (indirect string, offset: 0xc8f0e): RCC_ClkInitTypeDef
    <1012>   DW_AT_decl_file   : 11
    <1013>   DW_AT_decl_line   : 94
    <1014>   DW_AT_decl_column : 2
    <1015>   DW_AT_type        : <0xfc2>
 <1><1019>: Abbrev Number: 20 (DW_TAG_structure_type)
    <101a>   DW_AT_byte_size   : 20
    <101b>   DW_AT_decl_file   : 12
    <101c>   DW_AT_decl_line   : 46
    <101d>   DW_AT_decl_column : 9
    <101e>   DW_AT_sibling     : <0x1064>
 <2><1022>: Abbrev Number: 21 (DW_TAG_member)
    <1023>   DW_AT_name        : Pin
    <1027>   DW_AT_decl_file   : 12
    <1028>   DW_AT_decl_line   : 48
    <1029>   DW_AT_decl_column : 12
    <102a>   DW_AT_type        : <0x397>
    <102e>   DW_AT_data_member_location: 0
 <2><102f>: Abbrev Number: 22 (DW_TAG_member)
    <1030>   DW_AT_name        : (indirect string, offset: 0x716bb): Mode
    <1034>   DW_AT_decl_file   : 12
    <1035>   DW_AT_decl_line   : 51
    <1036>   DW_AT_decl_column : 12
    <1037>   DW_AT_type        : <0x397>
    <103b>   DW_AT_data_member_location: 4
 <2><103c>: Abbrev Number: 22 (DW_TAG_member)
    <103d>   DW_AT_name        : (indirect string, offset: 0x85c52): Pull
    <1041>   DW_AT_decl_file   : 12
    <1042>   DW_AT_decl_line   : 54
    <1043>   DW_AT_decl_column : 12
    <1044>   DW_AT_type        : <0x397>
    <1048>   DW_AT_data_member_location: 8
 <2><1049>: Abbrev Number: 22 (DW_TAG_member)
    <104a>   DW_AT_name        : (indirect string, offset: 0x109c79): Speed
    <104e>   DW_AT_decl_file   : 12
    <104f>   DW_AT_decl_line   : 57
    <1050>   DW_AT_decl_column : 12
    <1051>   DW_AT_type        : <0x397>
    <1055>   DW_AT_data_member_location: 12
 <2><1056>: Abbrev Number: 22 (DW_TAG_member)
    <1057>   DW_AT_name        : (indirect string, offset: 0x77269): Alternate
    <105b>   DW_AT_decl_file   : 12
    <105c>   DW_AT_decl_line   : 60
    <105d>   DW_AT_decl_column : 12
    <105e>   DW_AT_type        : <0x397>
    <1062>   DW_AT_data_member_location: 16
 <2><1063>: Abbrev Number: 0
 <1><1064>: Abbrev Number: 6 (DW_TAG_typedef)
    <1065>   DW_AT_name        : (indirect string, offset: 0xcbb40): GPIO_InitTypeDef
    <1069>   DW_AT_decl_file   : 12
    <106a>   DW_AT_decl_line   : 62
    <106b>   DW_AT_decl_column : 2
    <106c>   DW_AT_type        : <0x1019>
 <1><1070>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <1071>   DW_AT_encoding    : 7	(unsigned)
    <1072>   DW_AT_byte_size   : 1
    <1073>   DW_AT_type        : <0x30f>
    <1077>   DW_AT_decl_file   : 12
    <1078>   DW_AT_decl_line   : 68
    <1079>   DW_AT_decl_column : 1
    <107a>   DW_AT_sibling     : <0x108b>
 <2><107e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <107f>   DW_AT_name        : (indirect string, offset: 0x35086): GPIO_PIN_RESET
    <1083>   DW_AT_const_value : 0
 <2><1084>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1085>   DW_AT_name        : (indirect string, offset: 0x2d687): GPIO_PIN_SET
    <1089>   DW_AT_const_value : 1
 <2><108a>: Abbrev Number: 0
 <1><108b>: Abbrev Number: 6 (DW_TAG_typedef)
    <108c>   DW_AT_name        : (indirect string, offset: 0xff563): GPIO_PinState
    <1090>   DW_AT_decl_file   : 12
    <1091>   DW_AT_decl_line   : 71
    <1092>   DW_AT_decl_column : 2
    <1093>   DW_AT_type        : <0x1070>
 <1><1097>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1098>   DW_AT_byte_size   : 48
    <1099>   DW_AT_decl_file   : 13
    <109a>   DW_AT_decl_line   : 48
    <109b>   DW_AT_decl_column : 9
    <109c>   DW_AT_sibling     : <0x113d>
 <2><10a0>: Abbrev Number: 22 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x871b9): Channel
    <10a5>   DW_AT_decl_file   : 13
    <10a6>   DW_AT_decl_line   : 50
    <10a7>   DW_AT_decl_column : 12
    <10a8>   DW_AT_type        : <0x397>
    <10ac>   DW_AT_data_member_location: 0
 <2><10ad>: Abbrev Number: 22 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x60af3): Direction
    <10b2>   DW_AT_decl_file   : 13
    <10b3>   DW_AT_decl_line   : 53
    <10b4>   DW_AT_decl_column : 12
    <10b5>   DW_AT_type        : <0x397>
    <10b9>   DW_AT_data_member_location: 4
 <2><10ba>: Abbrev Number: 22 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x1172e): PeriphInc
    <10bf>   DW_AT_decl_file   : 13
    <10c0>   DW_AT_decl_line   : 57
    <10c1>   DW_AT_decl_column : 12
    <10c2>   DW_AT_type        : <0x397>
    <10c6>   DW_AT_data_member_location: 8
 <2><10c7>: Abbrev Number: 22 (DW_TAG_member)
    <10c8>   DW_AT_name        : (indirect string, offset: 0x28653): MemInc
    <10cc>   DW_AT_decl_file   : 13
    <10cd>   DW_AT_decl_line   : 60
    <10ce>   DW_AT_decl_column : 12
    <10cf>   DW_AT_type        : <0x397>
    <10d3>   DW_AT_data_member_location: 12
 <2><10d4>: Abbrev Number: 22 (DW_TAG_member)
    <10d5>   DW_AT_name        : (indirect string, offset: 0x8186d): PeriphDataAlignment
    <10d9>   DW_AT_decl_file   : 13
    <10da>   DW_AT_decl_line   : 63
    <10db>   DW_AT_decl_column : 12
    <10dc>   DW_AT_type        : <0x397>
    <10e0>   DW_AT_data_member_location: 16
 <2><10e1>: Abbrev Number: 22 (DW_TAG_member)
    <10e2>   DW_AT_name        : (indirect string, offset: 0xeae42): MemDataAlignment
    <10e6>   DW_AT_decl_file   : 13
    <10e7>   DW_AT_decl_line   : 66
    <10e8>   DW_AT_decl_column : 12
    <10e9>   DW_AT_type        : <0x397>
    <10ed>   DW_AT_data_member_location: 20
 <2><10ee>: Abbrev Number: 22 (DW_TAG_member)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x716bb): Mode
    <10f3>   DW_AT_decl_file   : 13
    <10f4>   DW_AT_decl_line   : 69
    <10f5>   DW_AT_decl_column : 12
    <10f6>   DW_AT_type        : <0x397>
    <10fa>   DW_AT_data_member_location: 24
 <2><10fb>: Abbrev Number: 22 (DW_TAG_member)
    <10fc>   DW_AT_name        : (indirect string, offset: 0x106c17): Priority
    <1100>   DW_AT_decl_file   : 13
    <1101>   DW_AT_decl_line   : 74
    <1102>   DW_AT_decl_column : 12
    <1103>   DW_AT_type        : <0x397>
    <1107>   DW_AT_data_member_location: 28
 <2><1108>: Abbrev Number: 22 (DW_TAG_member)
    <1109>   DW_AT_name        : (indirect string, offset: 0x708a6): FIFOMode
    <110d>   DW_AT_decl_file   : 13
    <110e>   DW_AT_decl_line   : 77
    <110f>   DW_AT_decl_column : 12
    <1110>   DW_AT_type        : <0x397>
    <1114>   DW_AT_data_member_location: 32
 <2><1115>: Abbrev Number: 22 (DW_TAG_member)
    <1116>   DW_AT_name        : (indirect string, offset: 0xc5fe6): FIFOThreshold
    <111a>   DW_AT_decl_file   : 13
    <111b>   DW_AT_decl_line   : 82
    <111c>   DW_AT_decl_column : 12
    <111d>   DW_AT_type        : <0x397>
    <1121>   DW_AT_data_member_location: 36
 <2><1122>: Abbrev Number: 22 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0xc34da): MemBurst
    <1127>   DW_AT_decl_file   : 13
    <1128>   DW_AT_decl_line   : 85
    <1129>   DW_AT_decl_column : 12
    <112a>   DW_AT_type        : <0x397>
    <112e>   DW_AT_data_member_location: 40
 <2><112f>: Abbrev Number: 22 (DW_TAG_member)
    <1130>   DW_AT_name        : (indirect string, offset: 0x58f2f): PeriphBurst
    <1134>   DW_AT_decl_file   : 13
    <1135>   DW_AT_decl_line   : 91
    <1136>   DW_AT_decl_column : 12
    <1137>   DW_AT_type        : <0x397>
    <113b>   DW_AT_data_member_location: 44
 <2><113c>: Abbrev Number: 0
 <1><113d>: Abbrev Number: 6 (DW_TAG_typedef)
    <113e>   DW_AT_name        : (indirect string, offset: 0x44f7a): DMA_InitTypeDef
    <1142>   DW_AT_decl_file   : 13
    <1143>   DW_AT_decl_line   : 96
    <1144>   DW_AT_decl_column : 2
    <1145>   DW_AT_type        : <0x1097>
 <1><1149>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <114a>   DW_AT_encoding    : 7	(unsigned)
    <114b>   DW_AT_byte_size   : 1
    <114c>   DW_AT_type        : <0x30f>
    <1150>   DW_AT_decl_file   : 13
    <1151>   DW_AT_decl_line   : 102
    <1152>   DW_AT_decl_column : 1
    <1153>   DW_AT_sibling     : <0x117c>
 <2><1157>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1158>   DW_AT_name        : (indirect string, offset: 0xc1f38): HAL_DMA_STATE_RESET
    <115c>   DW_AT_const_value : 0
 <2><115d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <115e>   DW_AT_name        : (indirect string, offset: 0x46724): HAL_DMA_STATE_READY
    <1162>   DW_AT_const_value : 1
 <2><1163>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1164>   DW_AT_name        : (indirect string, offset: 0xb4ea4): HAL_DMA_STATE_BUSY
    <1168>   DW_AT_const_value : 2
 <2><1169>: Abbrev Number: 4 (DW_TAG_enumerator)
    <116a>   DW_AT_name        : (indirect string, offset: 0xffad3): HAL_DMA_STATE_TIMEOUT
    <116e>   DW_AT_const_value : 3
 <2><116f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1170>   DW_AT_name        : (indirect string, offset: 0xdea85): HAL_DMA_STATE_ERROR
    <1174>   DW_AT_const_value : 4
 <2><1175>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1176>   DW_AT_name        : (indirect string, offset: 0x3a6e6): HAL_DMA_STATE_ABORT
    <117a>   DW_AT_const_value : 5
 <2><117b>: Abbrev Number: 0
 <1><117c>: Abbrev Number: 6 (DW_TAG_typedef)
    <117d>   DW_AT_name        : (indirect string, offset: 0xcbcbe): HAL_DMA_StateTypeDef
    <1181>   DW_AT_decl_file   : 13
    <1182>   DW_AT_decl_line   : 109
    <1183>   DW_AT_decl_column : 2
    <1184>   DW_AT_type        : <0x1149>
 <1><1188>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <1189>   DW_AT_type        : <0x117c>
 <1><118d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <118e>   DW_AT_name        : (indirect string, offset: 0xdd7b0): __DMA_HandleTypeDef
    <1192>   DW_AT_byte_size   : 96
    <1193>   DW_AT_decl_file   : 13
    <1194>   DW_AT_decl_line   : 137
    <1195>   DW_AT_decl_column : 16
    <1196>   DW_AT_sibling     : <0x1251>
 <2><119a>: Abbrev Number: 22 (DW_TAG_member)
    <119b>   DW_AT_name        : (indirect string, offset: 0xfb0f2): Instance
    <119f>   DW_AT_decl_file   : 13
    <11a0>   DW_AT_decl_line   : 139
    <11a1>   DW_AT_decl_column : 31
    <11a2>   DW_AT_type        : <0x1251>
    <11a6>   DW_AT_data_member_location: 0
 <2><11a7>: Abbrev Number: 22 (DW_TAG_member)
    <11a8>   DW_AT_name        : (indirect string, offset: 0x107d8b): Init
    <11ac>   DW_AT_decl_file   : 13
    <11ad>   DW_AT_decl_line   : 141
    <11ae>   DW_AT_decl_column : 30
    <11af>   DW_AT_type        : <0x113d>
    <11b3>   DW_AT_data_member_location: 4
 <2><11b4>: Abbrev Number: 22 (DW_TAG_member)
    <11b5>   DW_AT_name        : (indirect string, offset: 0xb9a2f): Lock
    <11b9>   DW_AT_decl_file   : 13
    <11ba>   DW_AT_decl_line   : 143
    <11bb>   DW_AT_decl_column : 30
    <11bc>   DW_AT_type        : <0xed4>
    <11c0>   DW_AT_data_member_location: 52
 <2><11c1>: Abbrev Number: 22 (DW_TAG_member)
    <11c2>   DW_AT_name        : (indirect string, offset: 0x108e21): State
    <11c6>   DW_AT_decl_file   : 13
    <11c7>   DW_AT_decl_line   : 145
    <11c8>   DW_AT_decl_column : 30
    <11c9>   DW_AT_type        : <0x1188>
    <11cd>   DW_AT_data_member_location: 53
 <2><11ce>: Abbrev Number: 22 (DW_TAG_member)
    <11cf>   DW_AT_name        : (indirect string, offset: 0xf72b7): Parent
    <11d3>   DW_AT_decl_file   : 13
    <11d4>   DW_AT_decl_line   : 147
    <11d5>   DW_AT_decl_column : 31
    <11d6>   DW_AT_type        : <0x1257>
    <11da>   DW_AT_data_member_location: 56
 <2><11db>: Abbrev Number: 22 (DW_TAG_member)
    <11dc>   DW_AT_name        : (indirect string, offset: 0x1027ae): XferCpltCallback
    <11e0>   DW_AT_decl_file   : 13
    <11e1>   DW_AT_decl_line   : 149
    <11e2>   DW_AT_decl_column : 33
    <11e3>   DW_AT_type        : <0x126f>
    <11e7>   DW_AT_data_member_location: 60
 <2><11e8>: Abbrev Number: 22 (DW_TAG_member)
    <11e9>   DW_AT_name        : (indirect string, offset: 0xca55c): XferHalfCpltCallback
    <11ed>   DW_AT_decl_file   : 13
    <11ee>   DW_AT_decl_line   : 151
    <11ef>   DW_AT_decl_column : 33
    <11f0>   DW_AT_type        : <0x126f>
    <11f4>   DW_AT_data_member_location: 64
 <2><11f5>: Abbrev Number: 22 (DW_TAG_member)
    <11f6>   DW_AT_name        : (indirect string, offset: 0xee122): XferM1CpltCallback
    <11fa>   DW_AT_decl_file   : 13
    <11fb>   DW_AT_decl_line   : 153
    <11fc>   DW_AT_decl_column : 33
    <11fd>   DW_AT_type        : <0x126f>
    <1201>   DW_AT_data_member_location: 68
 <2><1202>: Abbrev Number: 22 (DW_TAG_member)
    <1203>   DW_AT_name        : (indirect string, offset: 0x7d633): XferM1HalfCpltCallback
    <1207>   DW_AT_decl_file   : 13
    <1208>   DW_AT_decl_line   : 155
    <1209>   DW_AT_decl_column : 33
    <120a>   DW_AT_type        : <0x126f>
    <120e>   DW_AT_data_member_location: 72
 <2><120f>: Abbrev Number: 22 (DW_TAG_member)
    <1210>   DW_AT_name        : (indirect string, offset: 0x24dbd): XferErrorCallback
    <1214>   DW_AT_decl_file   : 13
    <1215>   DW_AT_decl_line   : 157
    <1216>   DW_AT_decl_column : 33
    <1217>   DW_AT_type        : <0x126f>
    <121b>   DW_AT_data_member_location: 76
 <2><121c>: Abbrev Number: 22 (DW_TAG_member)
    <121d>   DW_AT_name        : (indirect string, offset: 0xf29ad): XferAbortCallback
    <1221>   DW_AT_decl_file   : 13
    <1222>   DW_AT_decl_line   : 159
    <1223>   DW_AT_decl_column : 33
    <1224>   DW_AT_type        : <0x126f>
    <1228>   DW_AT_data_member_location: 80
 <2><1229>: Abbrev Number: 22 (DW_TAG_member)
    <122a>   DW_AT_name        : (indirect string, offset: 0xfdd8e): ErrorCode
    <122e>   DW_AT_decl_file   : 13
    <122f>   DW_AT_decl_line   : 161
    <1230>   DW_AT_decl_column : 30
    <1231>   DW_AT_type        : <0x3a3>
    <1235>   DW_AT_data_member_location: 84
 <2><1236>: Abbrev Number: 22 (DW_TAG_member)
    <1237>   DW_AT_name        : (indirect string, offset: 0x748ae): StreamBaseAddress
    <123b>   DW_AT_decl_file   : 13
    <123c>   DW_AT_decl_line   : 163
    <123d>   DW_AT_decl_column : 30
    <123e>   DW_AT_type        : <0x397>
    <1242>   DW_AT_data_member_location: 88
 <2><1243>: Abbrev Number: 22 (DW_TAG_member)
    <1244>   DW_AT_name        : (indirect string, offset: 0xdabed): StreamIndex
    <1248>   DW_AT_decl_file   : 13
    <1249>   DW_AT_decl_line   : 165
    <124a>   DW_AT_decl_column : 30
    <124b>   DW_AT_type        : <0x397>
    <124f>   DW_AT_data_member_location: 92
 <2><1250>: Abbrev Number: 0
 <1><1251>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <1252>   DW_AT_byte_size   : 4
    <1253>   DW_AT_type        : <0x78b>
 <1><1257>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <1258>   DW_AT_byte_size   : 4
 <1><1259>: Abbrev Number: 9 (DW_TAG_const_type)
    <125a>   DW_AT_type        : <0x1257>
 <1><125e>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <125f>   DW_AT_prototyped  : 1
    <125f>   DW_AT_sibling     : <0x1269>
 <2><1263>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1264>   DW_AT_type        : <0x1269>
 <2><1268>: Abbrev Number: 0
 <1><1269>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <126a>   DW_AT_byte_size   : 4
    <126b>   DW_AT_type        : <0x118d>
 <1><126f>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <1270>   DW_AT_byte_size   : 4
    <1271>   DW_AT_type        : <0x125e>
 <1><1275>: Abbrev Number: 6 (DW_TAG_typedef)
    <1276>   DW_AT_name        : (indirect string, offset: 0xdd7b2): DMA_HandleTypeDef
    <127a>   DW_AT_decl_file   : 13
    <127b>   DW_AT_decl_line   : 167
    <127c>   DW_AT_decl_column : 2
    <127d>   DW_AT_type        : <0x118d>
 <1><1281>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1282>   DW_AT_byte_size   : 48
    <1283>   DW_AT_decl_file   : 14
    <1284>   DW_AT_decl_line   : 56
    <1285>   DW_AT_decl_column : 9
    <1286>   DW_AT_sibling     : <0x1327>
 <2><128a>: Abbrev Number: 22 (DW_TAG_member)
    <128b>   DW_AT_name        : (indirect string, offset: 0xe4d60): ClockPrescaler
    <128f>   DW_AT_decl_file   : 14
    <1290>   DW_AT_decl_line   : 58
    <1291>   DW_AT_decl_column : 12
    <1292>   DW_AT_type        : <0x397>
    <1296>   DW_AT_data_member_location: 0
 <2><1297>: Abbrev Number: 22 (DW_TAG_member)
    <1298>   DW_AT_name        : (indirect string, offset: 0x150e5): Resolution
    <129c>   DW_AT_decl_file   : 14
    <129d>   DW_AT_decl_line   : 61
    <129e>   DW_AT_decl_column : 12
    <129f>   DW_AT_type        : <0x397>
    <12a3>   DW_AT_data_member_location: 4
 <2><12a4>: Abbrev Number: 22 (DW_TAG_member)
    <12a5>   DW_AT_name        : (indirect string, offset: 0x37e17): DataAlign
    <12a9>   DW_AT_decl_file   : 14
    <12aa>   DW_AT_decl_line   : 63
    <12ab>   DW_AT_decl_column : 12
    <12ac>   DW_AT_type        : <0x397>
    <12b0>   DW_AT_data_member_location: 8
 <2><12b1>: Abbrev Number: 22 (DW_TAG_member)
    <12b2>   DW_AT_name        : (indirect string, offset: 0xf1cc2): ScanConvMode
    <12b6>   DW_AT_decl_file   : 14
    <12b7>   DW_AT_decl_line   : 66
    <12b8>   DW_AT_decl_column : 12
    <12b9>   DW_AT_type        : <0x397>
    <12bd>   DW_AT_data_member_location: 12
 <2><12be>: Abbrev Number: 22 (DW_TAG_member)
    <12bf>   DW_AT_name        : (indirect string, offset: 0xa16a): EOCSelection
    <12c3>   DW_AT_decl_file   : 14
    <12c4>   DW_AT_decl_line   : 74
    <12c5>   DW_AT_decl_column : 12
    <12c6>   DW_AT_type        : <0x397>
    <12ca>   DW_AT_data_member_location: 16
 <2><12cb>: Abbrev Number: 22 (DW_TAG_member)
    <12cc>   DW_AT_name        : (indirect string, offset: 0x6d78d): ContinuousConvMode
    <12d0>   DW_AT_decl_file   : 14
    <12d1>   DW_AT_decl_line   : 81
    <12d2>   DW_AT_decl_column : 12
    <12d3>   DW_AT_type        : <0x397>
    <12d7>   DW_AT_data_member_location: 20
 <2><12d8>: Abbrev Number: 22 (DW_TAG_member)
    <12d9>   DW_AT_name        : (indirect string, offset: 0x9c27c): NbrOfConversion
    <12dd>   DW_AT_decl_file   : 14
    <12de>   DW_AT_decl_line   : 84
    <12df>   DW_AT_decl_column : 12
    <12e0>   DW_AT_type        : <0x397>
    <12e4>   DW_AT_data_member_location: 24
 <2><12e5>: Abbrev Number: 22 (DW_TAG_member)
    <12e6>   DW_AT_name        : (indirect string, offset: 0x877aa): DiscontinuousConvMode
    <12ea>   DW_AT_decl_file   : 14
    <12eb>   DW_AT_decl_line   : 87
    <12ec>   DW_AT_decl_column : 19
    <12ed>   DW_AT_type        : <0xe67>
    <12f1>   DW_AT_data_member_location: 28
 <2><12f2>: Abbrev Number: 22 (DW_TAG_member)
    <12f3>   DW_AT_name        : (indirect string, offset: 0xf394c): NbrOfDiscConversion
    <12f7>   DW_AT_decl_file   : 14
    <12f8>   DW_AT_decl_line   : 91
    <12f9>   DW_AT_decl_column : 12
    <12fa>   DW_AT_type        : <0x397>
    <12fe>   DW_AT_data_member_location: 32
 <2><12ff>: Abbrev Number: 22 (DW_TAG_member)
    <1300>   DW_AT_name        : (indirect string, offset: 0xc1a15): ExternalTrigConv
    <1304>   DW_AT_decl_file   : 14
    <1305>   DW_AT_decl_line   : 94
    <1306>   DW_AT_decl_column : 12
    <1307>   DW_AT_type        : <0x397>
    <130b>   DW_AT_data_member_location: 36
 <2><130c>: Abbrev Number: 22 (DW_TAG_member)
    <130d>   DW_AT_name        : (indirect string, offset: 0x45f7b): ExternalTrigConvEdge
    <1311>   DW_AT_decl_file   : 14
    <1312>   DW_AT_decl_line   : 98
    <1313>   DW_AT_decl_column : 12
    <1314>   DW_AT_type        : <0x397>
    <1318>   DW_AT_data_member_location: 40
 <2><1319>: Abbrev Number: 22 (DW_TAG_member)
    <131a>   DW_AT_name        : (indirect string, offset: 0xdf4c): DMAContinuousRequests
    <131e>   DW_AT_decl_file   : 14
    <131f>   DW_AT_decl_line   : 101
    <1320>   DW_AT_decl_column : 19
    <1321>   DW_AT_type        : <0xe67>
    <1325>   DW_AT_data_member_location: 44
 <2><1326>: Abbrev Number: 0
 <1><1327>: Abbrev Number: 6 (DW_TAG_typedef)
    <1328>   DW_AT_name        : (indirect string, offset: 0x3c620): ADC_InitTypeDef
    <132c>   DW_AT_decl_file   : 14
    <132d>   DW_AT_decl_line   : 106
    <132e>   DW_AT_decl_column : 2
    <132f>   DW_AT_type        : <0x1281>
 <1><1333>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1334>   DW_AT_byte_size   : 16
    <1335>   DW_AT_decl_file   : 14
    <1336>   DW_AT_decl_line   : 115
    <1337>   DW_AT_decl_column : 9
    <1338>   DW_AT_sibling     : <0x1371>
 <2><133c>: Abbrev Number: 22 (DW_TAG_member)
    <133d>   DW_AT_name        : (indirect string, offset: 0x871b9): Channel
    <1341>   DW_AT_decl_file   : 14
    <1342>   DW_AT_decl_line   : 117
    <1343>   DW_AT_decl_column : 12
    <1344>   DW_AT_type        : <0x397>
    <1348>   DW_AT_data_member_location: 0
 <2><1349>: Abbrev Number: 22 (DW_TAG_member)
    <134a>   DW_AT_name        : (indirect string, offset: 0x42327): Rank
    <134e>   DW_AT_decl_file   : 14
    <134f>   DW_AT_decl_line   : 119
    <1350>   DW_AT_decl_column : 12
    <1351>   DW_AT_type        : <0x397>
    <1355>   DW_AT_data_member_location: 4
 <2><1356>: Abbrev Number: 22 (DW_TAG_member)
    <1357>   DW_AT_name        : (indirect string, offset: 0xa94e8): SamplingTime
    <135b>   DW_AT_decl_file   : 14
    <135c>   DW_AT_decl_line   : 122
    <135d>   DW_AT_decl_column : 12
    <135e>   DW_AT_type        : <0x397>
    <1362>   DW_AT_data_member_location: 8
 <2><1363>: Abbrev Number: 22 (DW_TAG_member)
    <1364>   DW_AT_name        : (indirect string, offset: 0x10772b): Offset
    <1368>   DW_AT_decl_file   : 14
    <1369>   DW_AT_decl_line   : 131
    <136a>   DW_AT_decl_column : 12
    <136b>   DW_AT_type        : <0x397>
    <136f>   DW_AT_data_member_location: 12
 <2><1370>: Abbrev Number: 0
 <1><1371>: Abbrev Number: 6 (DW_TAG_typedef)
    <1372>   DW_AT_name        : (indirect string, offset: 0x102e19): ADC_ChannelConfTypeDef
    <1376>   DW_AT_decl_file   : 14
    <1377>   DW_AT_decl_line   : 132
    <1378>   DW_AT_decl_column : 2
    <1379>   DW_AT_type        : <0x1333>
 <1><137d>: Abbrev Number: 20 (DW_TAG_structure_type)
    <137e>   DW_AT_byte_size   : 72
    <137f>   DW_AT_decl_file   : 14
    <1380>   DW_AT_decl_line   : 194
    <1381>   DW_AT_decl_column : 9
    <1382>   DW_AT_sibling     : <0x13e2>
 <2><1386>: Abbrev Number: 22 (DW_TAG_member)
    <1387>   DW_AT_name        : (indirect string, offset: 0xfb0f2): Instance
    <138b>   DW_AT_decl_file   : 14
    <138c>   DW_AT_decl_line   : 197
    <138d>   DW_AT_decl_column : 34
    <138e>   DW_AT_type        : <0x13e2>
    <1392>   DW_AT_data_member_location: 0
 <2><1393>: Abbrev Number: 22 (DW_TAG_member)
    <1394>   DW_AT_name        : (indirect string, offset: 0x107d8b): Init
    <1398>   DW_AT_decl_file   : 14
    <1399>   DW_AT_decl_line   : 199
    <139a>   DW_AT_decl_column : 33
    <139b>   DW_AT_type        : <0x1327>
    <139f>   DW_AT_data_member_location: 4
 <2><13a0>: Abbrev Number: 22 (DW_TAG_member)
    <13a1>   DW_AT_name        : (indirect string, offset: 0x42311): NbrOfCurrentConversionRank
    <13a5>   DW_AT_decl_file   : 14
    <13a6>   DW_AT_decl_line   : 201
    <13a7>   DW_AT_decl_column : 33
    <13a8>   DW_AT_type        : <0x3a3>
    <13ac>   DW_AT_data_member_location: 52
 <2><13ad>: Abbrev Number: 22 (DW_TAG_member)
    <13ae>   DW_AT_name        : (indirect string, offset: 0x2c92): DMA_Handle
    <13b2>   DW_AT_decl_file   : 14
    <13b3>   DW_AT_decl_line   : 203
    <13b4>   DW_AT_decl_column : 34
    <13b5>   DW_AT_type        : <0x13e8>
    <13b9>   DW_AT_data_member_location: 56
 <2><13ba>: Abbrev Number: 22 (DW_TAG_member)
    <13bb>   DW_AT_name        : (indirect string, offset: 0xb9a2f): Lock
    <13bf>   DW_AT_decl_file   : 14
    <13c0>   DW_AT_decl_line   : 205
    <13c1>   DW_AT_decl_column : 33
    <13c2>   DW_AT_type        : <0xed4>
    <13c6>   DW_AT_data_member_location: 60
 <2><13c7>: Abbrev Number: 22 (DW_TAG_member)
    <13c8>   DW_AT_name        : (indirect string, offset: 0x108e21): State
    <13cc>   DW_AT_decl_file   : 14
    <13cd>   DW_AT_decl_line   : 207
    <13ce>   DW_AT_decl_column : 33
    <13cf>   DW_AT_type        : <0x3a3>
    <13d3>   DW_AT_data_member_location: 64
 <2><13d4>: Abbrev Number: 22 (DW_TAG_member)
    <13d5>   DW_AT_name        : (indirect string, offset: 0xfdd8e): ErrorCode
    <13d9>   DW_AT_decl_file   : 14
    <13da>   DW_AT_decl_line   : 209
    <13db>   DW_AT_decl_column : 33
    <13dc>   DW_AT_type        : <0x3a3>
    <13e0>   DW_AT_data_member_location: 68
 <2><13e1>: Abbrev Number: 0
 <1><13e2>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <13e3>   DW_AT_byte_size   : 4
    <13e4>   DW_AT_type        : <0x711>
 <1><13e8>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <13e9>   DW_AT_byte_size   : 4
    <13ea>   DW_AT_type        : <0x1275>
 <1><13ee>: Abbrev Number: 6 (DW_TAG_typedef)
    <13ef>   DW_AT_name        : (indirect string, offset: 0x335c3): ADC_HandleTypeDef
    <13f3>   DW_AT_decl_file   : 14
    <13f4>   DW_AT_decl_line   : 219
    <13f5>   DW_AT_decl_column : 2
    <13f6>   DW_AT_type        : <0x137d>
 <1><13fa>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <13fb>   DW_AT_byte_size   : 4
    <13fc>   DW_AT_type        : <0x36b>
 <1><1400>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1401>   DW_AT_byte_size   : 24
    <1402>   DW_AT_decl_file   : 15
    <1403>   DW_AT_decl_line   : 46
    <1404>   DW_AT_decl_column : 9
    <1405>   DW_AT_sibling     : <0x1458>
 <2><1409>: Abbrev Number: 22 (DW_TAG_member)
    <140a>   DW_AT_name        : (indirect string, offset: 0x104c00): Prescaler
    <140e>   DW_AT_decl_file   : 15
    <140f>   DW_AT_decl_line   : 48
    <1410>   DW_AT_decl_column : 12
    <1411>   DW_AT_type        : <0x397>
    <1415>   DW_AT_data_member_location: 0
 <2><1416>: Abbrev Number: 22 (DW_TAG_member)
    <1417>   DW_AT_name        : (indirect string, offset: 0xec547): CounterMode
    <141b>   DW_AT_decl_file   : 15
    <141c>   DW_AT_decl_line   : 51
    <141d>   DW_AT_decl_column : 12
    <141e>   DW_AT_type        : <0x397>
    <1422>   DW_AT_data_member_location: 4
 <2><1423>: Abbrev Number: 22 (DW_TAG_member)
    <1424>   DW_AT_name        : (indirect string, offset: 0x10e88b): Period
    <1428>   DW_AT_decl_file   : 15
    <1429>   DW_AT_decl_line   : 54
    <142a>   DW_AT_decl_column : 12
    <142b>   DW_AT_type        : <0x397>
    <142f>   DW_AT_data_member_location: 8
 <2><1430>: Abbrev Number: 22 (DW_TAG_member)
    <1431>   DW_AT_name        : (indirect string, offset: 0x6a2b2): ClockDivision
    <1435>   DW_AT_decl_file   : 15
    <1436>   DW_AT_decl_line   : 58
    <1437>   DW_AT_decl_column : 12
    <1438>   DW_AT_type        : <0x397>
    <143c>   DW_AT_data_member_location: 12
 <2><143d>: Abbrev Number: 22 (DW_TAG_member)
    <143e>   DW_AT_name        : (indirect string, offset: 0xb68b4): RepetitionCounter
    <1442>   DW_AT_decl_file   : 15
    <1443>   DW_AT_decl_line   : 61
    <1444>   DW_AT_decl_column : 12
    <1445>   DW_AT_type        : <0x397>
    <1449>   DW_AT_data_member_location: 16
