Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xfd30f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1033c1): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x695b): C:/Users/volod/STM32CubeIDE/workspace_1.12.0/STM32F767Zi_FreeRTOS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x1522f): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x76e9c): long long int

    <3aa>   DW_AT_name        : (indirect string, offset: 0x1094e2): __uint8_t
    <3ae>   DW_AT_decl_file   : 5
    <3af>   DW_AT_decl_line   : 43
    <3b0>   DW_AT_decl_column : 24
    <3b1>   DW_AT_type        : <0x3b5>
 <1><3b5>: Abbrev Number: 5 (DW_TAG_base_type)
    <3b6>   DW_AT_byte_size   : 1
    <3b7>   DW_AT_encoding    : 8	(unsigned char)
    <3b8>   DW_AT_name        : (indirect string, offset: 0xfd4d9): unsigned char
 <1><3bc>: Abbrev Number: 5 (DW_TAG_base_type)
    <3bd>   DW_AT_byte_size   : 2
    <3be>   DW_AT_encoding    : 5	(signed)
    <3bf>   DW_AT_name        : (indirect string, offset: 0xc42b6): short int
 <1><3c3>: Abbrev Number: 6 (DW_TAG_typedef)
    <3c4>   DW_AT_name        : (indirect string, offset: 0x10c1fc): __uint16_t
    <3c8>   DW_AT_decl_file   : 5
    <3c9>   DW_AT_decl_line   : 57
    <3ca>   DW_AT_decl_column : 25
    <3cb>   DW_AT_type        : <0x3cf>
 <1><3cf>: Abbrev Number: 5 (DW_TAG_base_type)
    <3d0>   DW_AT_byte_size   : 2
    <3d1>   DW_AT_encoding    : 7	(unsigned)
    <3d2>   DW_AT_name        : (indirect string, offset: 0xfb9c8): short unsigned int
 <1><3d6>: Abbrev Number: 5 (DW_TAG_base_type)
    <3d7>   DW_AT_byte_size   : 4
    <3d8>   DW_AT_encoding    : 5	(signed)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x15f98): long int
 <1><3dd>: Abbrev Number: 6 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0x10b42e): __uint32_t
    <3e2>   DW_AT_decl_file   : 5
    <3e3>   DW_AT_decl_line   : 79
    <3e4>   DW_AT_decl_column : 25
    <3e5>   DW_AT_type        : <0x3e9>
 <1><3e9>: Abbrev Number: 5 (DW_TAG_base_type)
    <3ea>   DW_AT_byte_size   : 4
    <3eb>   DW_AT_encoding    : 7	(unsigned)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x63ec9): long unsigned int
 <1><3f0>: Abbrev Number: 5 (DW_TAG_base_type)
    <3f1>   DW_AT_byte_size   : 8
    <3f2>   DW_AT_encoding    : 5	(signed)
    <3f3>   DW_AT_name        : (indirect string, offset: 0x76e9c): long long int
 <1><3f7>: Abbrev Number: 5 (DW_TAG_base_type)
    <3f8>   DW_AT_byte_size   : 8
    <3f9>   DW_AT_encoding    : 7	(unsigned)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x35af0): long long unsigned int
 <1><3fe>: Abbrev Number: 7 (DW_TAG_base_type)
    <3ff>   DW_AT_byte_size   : 4
    <400>   DW_AT_encoding    : 5	(signed)
    <401>   DW_AT_name        : int
 <1><405>: Abbrev Number: 5 (DW_TAG_base_type)
    <406>   DW_AT_byte_size   : 4
    <407>   DW_AT_encoding    : 7	(unsigned)
    <408>   DW_AT_name        : (indirect string, offset: 0x1522f): unsigned int
 <1><40c>: Abbrev Number: 6 (DW_TAG_typedef)
    <40d>   DW_AT_name        : (indirect string, offset: 0x1094e4): uint8_t
    <411>   DW_AT_decl_file   : 6
    <412>   DW_AT_decl_line   : 24
    <413>   DW_AT_decl_column : 19
    <414>   DW_AT_type        : <0x3a9>
 <1><418>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <419>   DW_AT_type        : <0x40c>
 <1><41d>: Abbrev Number: 9 (DW_TAG_const_type)
    <41e>   DW_AT_type        : <0x40c>
 <1><422>: Abbrev Number: 6 (DW_TAG_typedef)
    <423>   DW_AT_name        : (indirect string, offset: 0xc0a0e): uint16_t
    <427>   DW_AT_decl_file   : 6
    <428>   DW_AT_decl_line   : 36
    <429>   DW_AT_decl_column : 20
    <42a>   DW_AT_type        : <0x3c3>
 <1><42e>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <42f>   DW_AT_type        : <0x422>
 <1><433>: Abbrev Number: 9 (DW_TAG_const_type)
    <434>   DW_AT_type        : <0x422>
 <1><438>: Abbrev Number: 6 (DW_TAG_typedef)
    <439>   DW_AT_name        : (indirect string, offset: 0xfb5ee): uint32_t
    <43d>   DW_AT_decl_file   : 6
    <43e>   DW_AT_decl_line   : 48
    <43f>   DW_AT_decl_column : 20
    <440>   DW_AT_type        : <0x3dd>
 <1><444>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <445>   DW_AT_type        : <0x438>
 <1><449>: Abbrev Number: 9 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x444>
 <1><44e>: Abbrev Number: 10 (DW_TAG_array_type)
    <44f>   DW_AT_type        : <0x438>
    <453>   DW_AT_sibling     : <0x45e>
 <2><457>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <458>   DW_AT_type        : <0x405>
    <45c>   DW_AT_upper_bound : 14
 <2><45d>: Abbrev Number: 0
 <1><45e>: Abbrev Number: 10 (DW_TAG_array_type)
    <45f>   DW_AT_type        : <0x438>
    <463>   DW_AT_sibling     : <0x46e>
 <2><467>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <468>   DW_AT_type        : <0x405>
    <46c>   DW_AT_upper_bound : 5
 <2><46d>: Abbrev Number: 0
 <1><46e>: Abbrev Number: 12 (DW_TAG_union_type)
    <46f>   DW_AT_byte_size   : 4
    <470>   DW_AT_decl_file   : 1
    <471>   DW_AT_decl_line   : 1015
    <473>   DW_AT_decl_column : 9
    <474>   DW_AT_sibling     : <0x49f>
 <2><478>: Abbrev Number: 13 (DW_TAG_member)
    <479>   DW_AT_name        : u8
    <47c>   DW_AT_decl_file   : 1
    <47d>   DW_AT_decl_line   : 1017
    <47f>   DW_AT_decl_column : 22
    <480>   DW_AT_type        : <0x418>
 <2><484>: Abbrev Number: 13 (DW_TAG_member)
    <485>   DW_AT_name        : u16
    <489>   DW_AT_decl_file   : 1
    <48a>   DW_AT_decl_line   : 1018
    <48c>   DW_AT_decl_column : 22
    <48d>   DW_AT_type        : <0x42e>
 <2><491>: Abbrev Number: 13 (DW_TAG_member)
    <492>   DW_AT_name        : u32
    <496>   DW_AT_decl_file   : 1
    <497>   DW_AT_decl_line   : 1019
    <499>   DW_AT_decl_column : 22
    <49a>   DW_AT_type        : <0x444>
 <2><49e>: Abbrev Number: 0
 <1><49f>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <4a0>   DW_AT_type        : <0x46e>
 <1><4a4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <4a5>   DW_AT_byte_size   : 4096
    <4a7>   DW_AT_decl_file   : 1
    <4a8>   DW_AT_decl_line   : 1013
    <4aa>   DW_AT_decl_column : 9
    <4ab>   DW_AT_sibling     : <0x643>
 <2><4af>: Abbrev Number: 15 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x112f3b): PORT
    <4b4>   DW_AT_decl_file   : 1
    <4b5>   DW_AT_decl_line   : 1020
    <4b7>   DW_AT_decl_column : 6
    <4b8>   DW_AT_type        : <0x653>
    <4bc>   DW_AT_data_member_location: 0
 <2><4bd>: Abbrev Number: 15 (DW_TAG_member)
    <4be>   DW_AT_name        : (indirect string, offset: 0x10cf17): RESERVED0
    <4c2>   DW_AT_decl_file   : 1
    <4c3>   DW_AT_decl_line   : 1021
    <4c5>   DW_AT_decl_column : 18
    <4c6>   DW_AT_type        : <0x658>
    <4ca>   DW_AT_data_member_location: 128
 <2><4cb>: Abbrev Number: 16 (DW_TAG_member)
    <4cc>   DW_AT_name        : TER
    <4d0>   DW_AT_decl_file   : 1
    <4d1>   DW_AT_decl_line   : 1022
    <4d3>   DW_AT_decl_column : 18
    <4d4>   DW_AT_type        : <0x444>
    <4d8>   DW_AT_data_member_location: 3584
 <2><4da>: Abbrev Number: 17 (DW_TAG_member)
    <4db>   DW_AT_name        : (indirect string, offset: 0x10cf21): RESERVED1
    <4df>   DW_AT_decl_file   : 1
    <4e0>   DW_AT_decl_line   : 1023
    <4e2>   DW_AT_decl_column : 18
    <4e3>   DW_AT_type        : <0x44e>
    <4e7>   DW_AT_data_member_location: 3588
 <2><4e9>: Abbrev Number: 16 (DW_TAG_member)
    <4ea>   DW_AT_name        : TPR
    <4ee>   DW_AT_decl_file   : 1
    <4ef>   DW_AT_decl_line   : 1024
    <4f1>   DW_AT_decl_column : 18
    <4f2>   DW_AT_type        : <0x444>
    <4f6>   DW_AT_data_member_location: 3648
 <2><4f8>: Abbrev Number: 17 (DW_TAG_member)
    <4f9>   DW_AT_name        : (indirect string, offset: 0x10cf2b): RESERVED2
    <4fd>   DW_AT_decl_file   : 1
    <4fe>   DW_AT_decl_line   : 1025
    <500>   DW_AT_decl_column : 18
    <501>   DW_AT_type        : <0x44e>
    <505>   DW_AT_data_member_location: 3652
 <2><507>: Abbrev Number: 16 (DW_TAG_member)
    <508>   DW_AT_name        : TCR
    <50c>   DW_AT_decl_file   : 1
    <50d>   DW_AT_decl_line   : 1026
    <50f>   DW_AT_decl_column : 18
    <510>   DW_AT_type        : <0x444>
    <514>   DW_AT_data_member_location: 3712
 <2><516>: Abbrev Number: 17 (DW_TAG_member)
    <517>   DW_AT_name        : (indirect string, offset: 0x10cf35): RESERVED3
    <51b>   DW_AT_decl_file   : 1
    <51c>   DW_AT_decl_line   : 1027
    <51e>   DW_AT_decl_column : 18
    <51f>   DW_AT_type        : <0x669>
    <523>   DW_AT_data_member_location: 3716
 <2><525>: Abbrev Number: 16 (DW_TAG_member)
    <526>   DW_AT_name        : IWR
    <52a>   DW_AT_decl_file   : 1
    <52b>   DW_AT_decl_line   : 1028
    <52d>   DW_AT_decl_column : 18
    <52e>   DW_AT_type        : <0x444>
    <532>   DW_AT_data_member_location: 3832
 <2><534>: Abbrev Number: 16 (DW_TAG_member)
    <535>   DW_AT_name        : IRR
    <539>   DW_AT_decl_file   : 1
    <53a>   DW_AT_decl_line   : 1029
    <53c>   DW_AT_decl_column : 18
    <53d>   DW_AT_type        : <0x449>
    <541>   DW_AT_data_member_location: 3836
 <2><543>: Abbrev Number: 17 (DW_TAG_member)
    <544>   DW_AT_name        : (indirect string, offset: 0x10b053): IMCR
    <548>   DW_AT_decl_file   : 1
    <549>   DW_AT_decl_line   : 1030
    <54b>   DW_AT_decl_column : 18
    <54c>   DW_AT_type        : <0x444>
    <550>   DW_AT_data_member_location: 3840
 <2><552>: Abbrev Number: 17 (DW_TAG_member)
    <553>   DW_AT_name        : (indirect string, offset: 0x10cf3f): RESERVED4
    <557>   DW_AT_decl_file   : 1
    <558>   DW_AT_decl_line   : 1031
    <55a>   DW_AT_decl_column : 18
    <55b>   DW_AT_type        : <0x679>
    <55f>   DW_AT_data_member_location: 3844
 <2><561>: Abbrev Number: 16 (DW_TAG_member)
    <562>   DW_AT_name        : LAR
    <566>   DW_AT_decl_file   : 1
    <567>   DW_AT_decl_line   : 1032
    <569>   DW_AT_decl_column : 18
    <56a>   DW_AT_type        : <0x444>
    <56e>   DW_AT_data_member_location: 4016
 <2><570>: Abbrev Number: 16 (DW_TAG_member)
    <571>   DW_AT_name        : LSR
    <575>   DW_AT_decl_file   : 1
    <576>   DW_AT_decl_line   : 1033
    <578>   DW_AT_decl_column : 18
    <579>   DW_AT_type        : <0x449>
    <57d>   DW_AT_data_member_location: 4020
 <2><57f>: Abbrev Number: 17 (DW_TAG_member)
    <580>   DW_AT_name        : (indirect string, offset: 0x10cf49): RESERVED5
    <584>   DW_AT_decl_file   : 1
    <585>   DW_AT_decl_line   : 1034
    <587>   DW_AT_decl_column : 18
    <588>   DW_AT_type        : <0x45e>
    <58c>   DW_AT_data_member_location: 4024
 <2><58e>: Abbrev Number: 17 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0x109eca): PID4
    <593>   DW_AT_decl_file   : 1
    <594>   DW_AT_decl_line   : 1035
    <596>   DW_AT_decl_column : 18
    <597>   DW_AT_type        : <0x449>
    <59b>   DW_AT_data_member_location: 4048
 <2><59d>: Abbrev Number: 17 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x10c047): PID5
    <5a2>   DW_AT_decl_file   : 1
    <5a3>   DW_AT_decl_line   : 1036
    <5a5>   DW_AT_decl_column : 18
    <5a6>   DW_AT_type        : <0x449>
    <5aa>   DW_AT_data_member_location: 4052
 <2><5ac>: Abbrev Number: 17 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x109ecf): PID6
    <5b1>   DW_AT_decl_file   : 1
    <5b2>   DW_AT_decl_line   : 1037
    <5b4>   DW_AT_decl_column : 18
    <5b5>   DW_AT_type        : <0x449>
    <5b9>   DW_AT_data_member_location: 4056
 <2><5bb>: Abbrev Number: 17 (DW_TAG_member)
    <5bc>   DW_AT_name        : (indirect string, offset: 0x109ed4): PID7
    <5c0>   DW_AT_decl_file   : 1
    <5c1>   DW_AT_decl_line   : 1038
    <5c3>   DW_AT_decl_column : 18
    <5c4>   DW_AT_type        : <0x449>
    <5c8>   DW_AT_data_member_location: 4060
 <2><5ca>: Abbrev Number: 17 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x109ec0): PID0
    <5cf>   DW_AT_decl_file   : 1
    <5d0>   DW_AT_decl_line   : 1039
    <5d2>   DW_AT_decl_column : 18
    <5d3>   DW_AT_type        : <0x449>
    <5d7>   DW_AT_data_member_location: 4064
 <2><5d9>: Abbrev Number: 17 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x10acd1): PID1
    <5de>   DW_AT_decl_file   : 1
    <5df>   DW_AT_decl_line   : 1040
    <5e1>   DW_AT_decl_column : 18
    <5e2>   DW_AT_type        : <0x449>
    <5e6>   DW_AT_data_member_location: 4068
 <2><5e8>: Abbrev Number: 17 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x10c042): PID2
    <5ed>   DW_AT_decl_file   : 1
    <5ee>   DW_AT_decl_line   : 1041
    <5f0>   DW_AT_decl_column : 18
    <5f1>   DW_AT_type        : <0x449>
    <5f5>   DW_AT_data_member_location: 4072
 <2><5f7>: Abbrev Number: 17 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x109ec5): PID3
    <5fc>   DW_AT_decl_file   : 1
    <5fd>   DW_AT_decl_line   : 1042
    <5ff>   DW_AT_decl_column : 18
    <600>   DW_AT_type        : <0x449>
    <604>   DW_AT_data_member_location: 4076
 <2><606>: Abbrev Number: 17 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x107c2c): CID0
    <60b>   DW_AT_decl_file   : 1
    <60c>   DW_AT_decl_line   : 1043
    <60e>   DW_AT_decl_column : 18
    <60f>   DW_AT_type        : <0x449>
    <613>   DW_AT_data_member_location: 4080
 <2><615>: Abbrev Number: 17 (DW_TAG_member)
    <616>   DW_AT_name        : (indirect string, offset: 0x107c31): CID1
    <61a>   DW_AT_decl_file   : 1
    <61b>   DW_AT_decl_line   : 1044
    <61d>   DW_AT_decl_column : 18
    <61e>   DW_AT_type        : <0x449>
    <622>   DW_AT_data_member_location: 4084
 <2><624>: Abbrev Number: 17 (DW_TAG_member)
    <625>   DW_AT_name        : (indirect string, offset: 0x107c36): CID2
    <629>   DW_AT_decl_file   : 1
    <62a>   DW_AT_decl_line   : 1045
    <62c>   DW_AT_decl_column : 18
    <62d>   DW_AT_type        : <0x449>
    <631>   DW_AT_data_member_location: 4088
 <2><633>: Abbrev Number: 17 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x107c3b): CID3
    <638>   DW_AT_decl_file   : 1
    <639>   DW_AT_decl_line   : 1046
    <63b>   DW_AT_decl_column : 18
    <63c>   DW_AT_type        : <0x449>
    <640>   DW_AT_data_member_location: 4092
 <2><642>: Abbrev Number: 0
 <1><643>: Abbrev Number: 10 (DW_TAG_array_type)
    <644>   DW_AT_type        : <0x49f>
    <648>   DW_AT_sibling     : <0x653>
 <2><64c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <64d>   DW_AT_type        : <0x405>
    <651>   DW_AT_upper_bound : 31
 <2><652>: Abbrev Number: 0
 <1><653>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <654>   DW_AT_type        : <0x643>
 <1><658>: Abbrev Number: 10 (DW_TAG_array_type)
    <659>   DW_AT_type        : <0x438>
    <65d>   DW_AT_sibling     : <0x669>
 <2><661>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <662>   DW_AT_type        : <0x405>
    <666>   DW_AT_upper_bound : 863
 <2><668>: Abbrev Number: 0
 <1><669>: Abbrev Number: 10 (DW_TAG_array_type)
    <66a>   DW_AT_type        : <0x438>
    <66e>   DW_AT_sibling     : <0x679>
 <2><672>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <673>   DW_AT_type        : <0x405>
    <677>   DW_AT_upper_bound : 28
 <2><678>: Abbrev Number: 0
 <1><679>: Abbrev Number: 10 (DW_TAG_array_type)
    <67a>   DW_AT_type        : <0x438>
    <67e>   DW_AT_sibling     : <0x689>
 <2><682>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <683>   DW_AT_type        : <0x405>
    <687>   DW_AT_upper_bound : 42
 <2><688>: Abbrev Number: 0
 <1><689>: Abbrev Number: 19 (DW_TAG_typedef)
    <68a>   DW_AT_name        : (indirect string, offset: 0x10c227): ITM_Type
    <68e>   DW_AT_decl_file   : 1
    <68f>   DW_AT_decl_line   : 1047
    <691>   DW_AT_decl_column : 3
    <692>   DW_AT_type        : <0x4a4>
 <1><696>: Abbrev Number: 10 (DW_TAG_array_type)
    <697>   DW_AT_type        : <0x438>
    <69b>   DW_AT_sibling     : <0x6a6>
 <2><69f>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <6a0>   DW_AT_type        : <0x405>
    <6a4>   DW_AT_upper_bound : 1
 <2><6a5>: Abbrev Number: 0
 <1><6a6>: Abbrev Number: 20 (DW_TAG_structure_type)
    <6a7>   DW_AT_byte_size   : 80
    <6a8>   DW_AT_decl_file   : 4
    <6a9>   DW_AT_decl_line   : 198
    <6aa>   DW_AT_decl_column : 9
    <6ab>   DW_AT_sibling     : <0x7b2>
 <2><6af>: Abbrev Number: 21 (DW_TAG_member)
    <6b0>   DW_AT_name        : SR
    <6b3>   DW_AT_decl_file   : 4
    <6b4>   DW_AT_decl_line   : 200
    <6b5>   DW_AT_decl_column : 17
    <6b6>   DW_AT_type        : <0x444>
    <6ba>   DW_AT_data_member_location: 0
 <2><6bb>: Abbrev Number: 21 (DW_TAG_member)
    <6bc>   DW_AT_name        : CR1
    <6c0>   DW_AT_decl_file   : 4
    <6c1>   DW_AT_decl_line   : 201
    <6c2>   DW_AT_decl_column : 17
    <6c3>   DW_AT_type        : <0x444>
    <6c7>   DW_AT_data_member_location: 4
 <2><6c8>: Abbrev Number: 21 (DW_TAG_member)
    <6c9>   DW_AT_name        : CR2
    <6cd>   DW_AT_decl_file   : 4
    <6ce>   DW_AT_decl_line   : 202
    <6cf>   DW_AT_decl_column : 17
    <6d0>   DW_AT_type        : <0x444>
    <6d4>   DW_AT_data_member_location: 8
 <2><6d5>: Abbrev Number: 22 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0xdfca6): SMPR1
    <6da>   DW_AT_decl_file   : 4
    <6db>   DW_AT_decl_line   : 203
    <6dc>   DW_AT_decl_column : 17
    <6dd>   DW_AT_type        : <0x444>
    <6e1>   DW_AT_data_member_location: 12
 <2><6e2>: Abbrev Number: 22 (DW_TAG_member)
    <6e3>   DW_AT_name        : (indirect string, offset: 0x5d0a8): SMPR2
    <6e7>   DW_AT_decl_file   : 4
    <6e8>   DW_AT_decl_line   : 204
    <6e9>   DW_AT_decl_column : 17
    <6ea>   DW_AT_type        : <0x444>
    <6ee>   DW_AT_data_member_location: 16
 <2><6ef>: Abbrev Number: 22 (DW_TAG_member)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x109a8c): JOFR1
    <6f4>   DW_AT_decl_file   : 4
    <6f5>   DW_AT_decl_line   : 205
    <6f6>   DW_AT_decl_column : 17
    <6f7>   DW_AT_type        : <0x444>
    <6fb>   DW_AT_data_member_location: 20
 <2><6fc>: Abbrev Number: 22 (DW_TAG_member)
    <6fd>   DW_AT_name        : (indirect string, offset: 0x109a92): JOFR2
    <701>   DW_AT_decl_file   : 4
    <702>   DW_AT_decl_line   : 206
    <703>   DW_AT_decl_column : 17
    <704>   DW_AT_type        : <0x444>
    <708>   DW_AT_data_member_location: 24
 <2><709>: Abbrev Number: 22 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0x109a98): JOFR3
    <70e>   DW_AT_decl_file   : 4
    <70f>   DW_AT_decl_line   : 207
    <710>   DW_AT_decl_column : 17
    <711>   DW_AT_type        : <0x444>
    <715>   DW_AT_data_member_location: 28
 <2><716>: Abbrev Number: 22 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0x108e90): JOFR4
    <71b>   DW_AT_decl_file   : 4
    <71c>   DW_AT_decl_line   : 208
    <71d>   DW_AT_decl_column : 17
    <71e>   DW_AT_type        : <0x444>
    <722>   DW_AT_data_member_location: 32
 <2><723>: Abbrev Number: 21 (DW_TAG_member)
    <724>   DW_AT_name        : HTR
    <728>   DW_AT_decl_file   : 4
    <729>   DW_AT_decl_line   : 209
    <72a>   DW_AT_decl_column : 17
    <72b>   DW_AT_type        : <0x444>
    <72f>   DW_AT_data_member_location: 36
 <2><730>: Abbrev Number: 21 (DW_TAG_member)
    <731>   DW_AT_name        : LTR
    <735>   DW_AT_decl_file   : 4
    <736>   DW_AT_decl_line   : 210
    <737>   DW_AT_decl_column : 17
    <738>   DW_AT_type        : <0x444>
    <73c>   DW_AT_data_member_location: 40
 <2><73d>: Abbrev Number: 22 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0xb7ba9): SQR1
    <742>   DW_AT_decl_file   : 4
    <743>   DW_AT_decl_line   : 211
    <744>   DW_AT_decl_column : 17
    <745>   DW_AT_type        : <0x444>
    <749>   DW_AT_data_member_location: 44
 <2><74a>: Abbrev Number: 22 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x108103): SQR2
    <74f>   DW_AT_decl_file   : 4
    <750>   DW_AT_decl_line   : 212
    <751>   DW_AT_decl_column : 17
    <752>   DW_AT_type        : <0x444>
    <756>   DW_AT_data_member_location: 48
 <2><757>: Abbrev Number: 22 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x108108): SQR3
    <75c>   DW_AT_decl_file   : 4
    <75d>   DW_AT_decl_line   : 213
    <75e>   DW_AT_decl_column : 17
    <75f>   DW_AT_type        : <0x444>
    <763>   DW_AT_data_member_location: 52
 <2><764>: Abbrev Number: 22 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0x53ffc): JSQR
    <769>   DW_AT_decl_file   : 4
    <76a>   DW_AT_decl_line   : 214
    <76b>   DW_AT_decl_column : 17
    <76c>   DW_AT_type        : <0x444>
    <770>   DW_AT_data_member_location: 56
 <2><771>: Abbrev Number: 22 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0x10b45a): JDR1
    <776>   DW_AT_decl_file   : 4
    <777>   DW_AT_decl_line   : 215
    <778>   DW_AT_decl_column : 17
    <779>   DW_AT_type        : <0x444>
    <77d>   DW_AT_data_member_location: 60
 <2><77e>: Abbrev Number: 22 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0x10b45f): JDR2
    <783>   DW_AT_decl_file   : 4
    <784>   DW_AT_decl_line   : 216
    <785>   DW_AT_decl_column : 17
    <786>   DW_AT_type        : <0x444>
    <78a>   DW_AT_data_member_location: 64
 <2><78b>: Abbrev Number: 22 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x10b464): JDR3
    <790>   DW_AT_decl_file   : 4
    <791>   DW_AT_decl_line   : 217
    <792>   DW_AT_decl_column : 17
    <793>   DW_AT_type        : <0x444>
    <797>   DW_AT_data_member_location: 68
 <2><798>: Abbrev Number: 22 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0x109233): JDR4
    <79d>   DW_AT_decl_file   : 4
    <79e>   DW_AT_decl_line   : 218
    <79f>   DW_AT_decl_column : 17
    <7a0>   DW_AT_type        : <0x444>
    <7a4>   DW_AT_data_member_location: 72
 <2><7a5>: Abbrev Number: 21 (DW_TAG_member)
    <7a6>   DW_AT_name        : DR
    <7a9>   DW_AT_decl_file   : 4
    <7aa>   DW_AT_decl_line   : 219
    <7ab>   DW_AT_decl_column : 17
    <7ac>   DW_AT_type        : <0x444>
    <7b0>   DW_AT_data_member_location: 76
 <2><7b1>: Abbrev Number: 0
 <1><7b2>: Abbrev Number: 6 (DW_TAG_typedef)
    <7b3>   DW_AT_name        : (indirect string, offset: 0x10bdde): ADC_TypeDef
    <7b7>   DW_AT_decl_file   : 4
    <7b8>   DW_AT_decl_line   : 220
    <7b9>   DW_AT_decl_column : 3
    <7ba>   DW_AT_type        : <0x6a6>
 <1><7be>: Abbrev Number: 10 (DW_TAG_array_type)
    <7bf>   DW_AT_type        : <0x438>
    <7c3>   DW_AT_sibling     : <0x7ce>
 <2><7c7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <7c8>   DW_AT_type        : <0x405>
    <7cc>   DW_AT_upper_bound : 11
 <2><7cd>: Abbrev Number: 0
 <1><7ce>: Abbrev Number: 23 (DW_TAG_structure_type)
    <7cf>   DW_AT_byte_size   : 24
    <7d0>   DW_AT_decl_file   : 4
    <7d1>   DW_AT_decl_line   : 417
    <7d3>   DW_AT_decl_column : 9
    <7d4>   DW_AT_sibling     : <0x82c>
 <2><7d8>: Abbrev Number: 24 (DW_TAG_member)
    <7d9>   DW_AT_name        : CR
    <7dc>   DW_AT_decl_file   : 4
    <7dd>   DW_AT_decl_line   : 419
    <7df>   DW_AT_decl_column : 17
    <7e0>   DW_AT_type        : <0x444>
    <7e4>   DW_AT_data_member_location: 0
 <2><7e5>: Abbrev Number: 15 (DW_TAG_member)
    <7e6>   DW_AT_name        : (indirect string, offset: 0x109de7): NDTR
    <7ea>   DW_AT_decl_file   : 4
    <7eb>   DW_AT_decl_line   : 420
    <7ed>   DW_AT_decl_column : 17
    <7ee>   DW_AT_type        : <0x444>
    <7f2>   DW_AT_data_member_location: 4
 <2><7f3>: Abbrev Number: 24 (DW_TAG_member)
    <7f4>   DW_AT_name        : PAR
    <7f8>   DW_AT_decl_file   : 4
    <7f9>   DW_AT_decl_line   : 421
    <7fb>   DW_AT_decl_column : 17
    <7fc>   DW_AT_type        : <0x444>
    <800>   DW_AT_data_member_location: 8
 <2><801>: Abbrev Number: 15 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0x109ff7): M0AR
    <806>   DW_AT_decl_file   : 4
    <807>   DW_AT_decl_line   : 422
    <809>   DW_AT_decl_column : 17
    <80a>   DW_AT_type        : <0x444>
    <80e>   DW_AT_data_member_location: 12
 <2><80f>: Abbrev Number: 15 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0x10ab2d): M1AR
    <814>   DW_AT_decl_file   : 4
    <815>   DW_AT_decl_line   : 423
    <817>   DW_AT_decl_column : 17
    <818>   DW_AT_type        : <0x444>
    <81c>   DW_AT_data_member_location: 16
 <2><81d>: Abbrev Number: 24 (DW_TAG_member)
    <81e>   DW_AT_name        : FCR
    <822>   DW_AT_decl_file   : 4
    <823>   DW_AT_decl_line   : 424
    <825>   DW_AT_decl_column : 17
    <826>   DW_AT_type        : <0x444>
    <82a>   DW_AT_data_member_location: 20
 <2><82b>: Abbrev Number: 0
 <1><82c>: Abbrev Number: 19 (DW_TAG_typedef)
    <82d>   DW_AT_name        : (indirect string, offset: 0x108425): DMA_Stream_TypeDef
    <831>   DW_AT_decl_file   : 4
    <832>   DW_AT_decl_line   : 425
    <834>   DW_AT_decl_column : 3
    <835>   DW_AT_type        : <0x7ce>
 <1><839>: Abbrev Number: 10 (DW_TAG_array_type)
    <83a>   DW_AT_type        : <0x438>
    <83e>   DW_AT_sibling     : <0x849>
 <2><842>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <843>   DW_AT_type        : <0x405>
    <847>   DW_AT_upper_bound : 39
 <2><848>: Abbrev Number: 0
 <1><849>: Abbrev Number: 10 (DW_TAG_array_type)
    <84a>   DW_AT_type        : <0x444>
    <84e>   DW_AT_sibling     : <0x859>
 <2><852>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <853>   DW_AT_type        : <0x405>
    <857>   DW_AT_upper_bound : 1
 <2><858>: Abbrev Number: 0
 <1><859>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <85a>   DW_AT_type        : <0x849>
 <1><85e>: Abbrev Number: 23 (DW_TAG_structure_type)
    <85f>   DW_AT_byte_size   : 40
    <860>   DW_AT_decl_file   : 4
    <861>   DW_AT_decl_line   : 624
    <863>   DW_AT_decl_column : 9
    <864>   DW_AT_sibling     : <0x8e7>
 <2><868>: Abbrev Number: 15 (DW_TAG_member)
    <869>   DW_AT_name        : (indirect string, offset: 0x107bdc): MODER
    <86d>   DW_AT_decl_file   : 4
    <86e>   DW_AT_decl_line   : 626
    <870>   DW_AT_decl_column : 17
    <871>   DW_AT_type        : <0x444>
    <875>   DW_AT_data_member_location: 0
 <2><876>: Abbrev Number: 15 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0x10be44): OTYPER
    <87b>   DW_AT_decl_file   : 4
    <87c>   DW_AT_decl_line   : 627
    <87e>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x444>
    <883>   DW_AT_data_member_location: 4
 <2><884>: Abbrev Number: 15 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x10c740): OSPEEDR
    <889>   DW_AT_decl_file   : 4
    <88a>   DW_AT_decl_line   : 628
    <88c>   DW_AT_decl_column : 17
    <88d>   DW_AT_type        : <0x444>
    <891>   DW_AT_data_member_location: 8
 <2><892>: Abbrev Number: 15 (DW_TAG_member)
    <893>   DW_AT_name        : (indirect string, offset: 0x10b9c4): PUPDR
    <897>   DW_AT_decl_file   : 4
    <898>   DW_AT_decl_line   : 629
    <89a>   DW_AT_decl_column : 17
    <89b>   DW_AT_type        : <0x444>
    <89f>   DW_AT_data_member_location: 12
 <2><8a0>: Abbrev Number: 24 (DW_TAG_member)
    <8a1>   DW_AT_name        : IDR
    <8a5>   DW_AT_decl_file   : 4
    <8a6>   DW_AT_decl_line   : 630
    <8a8>   DW_AT_decl_column : 17
    <8a9>   DW_AT_type        : <0x444>
    <8ad>   DW_AT_data_member_location: 16
 <2><8ae>: Abbrev Number: 24 (DW_TAG_member)
    <8af>   DW_AT_name        : ODR
    <8b3>   DW_AT_decl_file   : 4
    <8b4>   DW_AT_decl_line   : 631
    <8b6>   DW_AT_decl_column : 17
    <8b7>   DW_AT_type        : <0x444>
    <8bb>   DW_AT_data_member_location: 20
 <2><8bc>: Abbrev Number: 15 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x108fc9): BSRR
    <8c1>   DW_AT_decl_file   : 4
    <8c2>   DW_AT_decl_line   : 632
    <8c4>   DW_AT_decl_column : 17
    <8c5>   DW_AT_type        : <0x444>
    <8c9>   DW_AT_data_member_location: 24
 <2><8ca>: Abbrev Number: 15 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x10c666): LCKR
    <8cf>   DW_AT_decl_file   : 4
    <8d0>   DW_AT_decl_line   : 633
    <8d2>   DW_AT_decl_column : 17
    <8d3>   DW_AT_type        : <0x444>
    <8d7>   DW_AT_data_member_location: 28
 <2><8d8>: Abbrev Number: 24 (DW_TAG_member)
    <8d9>   DW_AT_name        : AFR
    <8dd>   DW_AT_decl_file   : 4
    <8de>   DW_AT_decl_line   : 634
    <8e0>   DW_AT_decl_column : 17
    <8e1>   DW_AT_type        : <0x859>
    <8e5>   DW_AT_data_member_location: 32
 <2><8e6>: Abbrev Number: 0
 <1><8e7>: Abbrev Number: 19 (DW_TAG_typedef)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x10d17c): GPIO_TypeDef
    <8ec>   DW_AT_decl_file   : 4
    <8ed>   DW_AT_decl_line   : 635
    <8ef>   DW_AT_decl_column : 3
    <8f0>   DW_AT_type        : <0x85e>
 <1><8f4>: Abbrev Number: 10 (DW_TAG_array_type)
    <8f5>   DW_AT_type        : <0x438>
    <8f9>   DW_AT_sibling     : <0x904>
 <2><8fd>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8fe>   DW_AT_type        : <0x405>
    <902>   DW_AT_upper_bound : 2
 <2><903>: Abbrev Number: 0
 <1><904>: Abbrev Number: 23 (DW_TAG_structure_type)
    <905>   DW_AT_byte_size   : 16
    <906>   DW_AT_decl_file   : 4
    <907>   DW_AT_decl_line   : 736
    <909>   DW_AT_decl_column : 9
    <90a>   DW_AT_sibling     : <0x947>
 <2><90e>: Abbrev Number: 24 (DW_TAG_member)
    <90f>   DW_AT_name        : CR1
    <913>   DW_AT_decl_file   : 4
    <914>   DW_AT_decl_line   : 738
    <916>   DW_AT_decl_column : 17
    <917>   DW_AT_type        : <0x444>
    <91b>   DW_AT_data_member_location: 0
 <2><91c>: Abbrev Number: 15 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0x109f98): CSR1
    <921>   DW_AT_decl_file   : 4
    <922>   DW_AT_decl_line   : 739
    <924>   DW_AT_decl_column : 17
    <925>   DW_AT_type        : <0x444>
    <929>   DW_AT_data_member_location: 4
 <2><92a>: Abbrev Number: 24 (DW_TAG_member)
    <92b>   DW_AT_name        : CR2
    <92f>   DW_AT_decl_file   : 4
    <930>   DW_AT_decl_line   : 740
    <932>   DW_AT_decl_column : 17
    <933>   DW_AT_type        : <0x444>
    <937>   DW_AT_data_member_location: 8
 <2><938>: Abbrev Number: 15 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x109f9d): CSR2
    <93d>   DW_AT_decl_file   : 4
    <93e>   DW_AT_decl_line   : 741
    <940>   DW_AT_decl_column : 17
    <941>   DW_AT_type        : <0x444>
    <945>   DW_AT_data_member_location: 12
 <2><946>: Abbrev Number: 0
 <1><947>: Abbrev Number: 19 (DW_TAG_typedef)
    <948>   DW_AT_name        : (indirect string, offset: 0x10ba2c): PWR_TypeDef
    <94c>   DW_AT_decl_file   : 4
    <94d>   DW_AT_decl_line   : 742
    <94f>   DW_AT_decl_column : 3
    <950>   DW_AT_type        : <0x904>
 <1><954>: Abbrev Number: 23 (DW_TAG_structure_type)
    <955>   DW_AT_byte_size   : 148
    <956>   DW_AT_decl_file   : 4
    <957>   DW_AT_decl_line   : 749
    <959>   DW_AT_decl_column : 9
    <95a>   DW_AT_sibling     : <0xb2c>
 <2><95e>: Abbrev Number: 24 (DW_TAG_member)
    <95f>   DW_AT_name        : CR
    <962>   DW_AT_decl_file   : 4
    <963>   DW_AT_decl_line   : 751
    <965>   DW_AT_decl_column : 17
    <966>   DW_AT_type        : <0x444>
    <96a>   DW_AT_data_member_location: 0
 <2><96b>: Abbrev Number: 15 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0x10b927): PLLCFGR
    <970>   DW_AT_decl_file   : 4
    <971>   DW_AT_decl_line   : 752
    <973>   DW_AT_decl_column : 17
    <974>   DW_AT_type        : <0x444>
    <978>   DW_AT_data_member_location: 4
 <2><979>: Abbrev Number: 15 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x109335): CFGR
    <97e>   DW_AT_decl_file   : 4
    <97f>   DW_AT_decl_line   : 753
    <981>   DW_AT_decl_column : 17
    <982>   DW_AT_type        : <0x444>
    <986>   DW_AT_data_member_location: 8
 <2><987>: Abbrev Number: 24 (DW_TAG_member)
    <988>   DW_AT_name        : CIR
    <98c>   DW_AT_decl_file   : 4
    <98d>   DW_AT_decl_line   : 754
    <98f>   DW_AT_decl_column : 17
    <990>   DW_AT_type        : <0x444>
    <994>   DW_AT_data_member_location: 12
 <2><995>: Abbrev Number: 15 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0x10c069): AHB1RSTR
    <99a>   DW_AT_decl_file   : 4
    <99b>   DW_AT_decl_line   : 755
    <99d>   DW_AT_decl_column : 17
    <99e>   DW_AT_type        : <0x444>
    <9a2>   DW_AT_data_member_location: 16
 <2><9a3>: Abbrev Number: 15 (DW_TAG_member)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x108382): AHB2RSTR
    <9a8>   DW_AT_decl_file   : 4
    <9a9>   DW_AT_decl_line   : 756
    <9ab>   DW_AT_decl_column : 17
    <9ac>   DW_AT_type        : <0x444>
    <9b0>   DW_AT_data_member_location: 20
 <2><9b1>: Abbrev Number: 15 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0x10a167): AHB3RSTR
    <9b6>   DW_AT_decl_file   : 4
    <9b7>   DW_AT_decl_line   : 757
    <9b9>   DW_AT_decl_column : 17
    <9ba>   DW_AT_type        : <0x444>
    <9be>   DW_AT_data_member_location: 24
 <2><9bf>: Abbrev Number: 15 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x10cf17): RESERVED0
    <9c4>   DW_AT_decl_file   : 4
    <9c5>   DW_AT_decl_line   : 758
    <9c7>   DW_AT_decl_column : 17
    <9c8>   DW_AT_type        : <0x438>
    <9cc>   DW_AT_data_member_location: 28
 <2><9cd>: Abbrev Number: 15 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x10835c): APB1RSTR
    <9d2>   DW_AT_decl_file   : 4
    <9d3>   DW_AT_decl_line   : 759
    <9d5>   DW_AT_decl_column : 17
    <9d6>   DW_AT_type        : <0x444>
    <9da>   DW_AT_data_member_location: 32
 <2><9db>: Abbrev Number: 15 (DW_TAG_member)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x10a14d): APB2RSTR
    <9e0>   DW_AT_decl_file   : 4
    <9e1>   DW_AT_decl_line   : 760
    <9e3>   DW_AT_decl_column : 17
    <9e4>   DW_AT_type        : <0x444>
    <9e8>   DW_AT_data_member_location: 36
 <2><9e9>: Abbrev Number: 15 (DW_TAG_member)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x10cf21): RESERVED1
    <9ee>   DW_AT_decl_file   : 4
    <9ef>   DW_AT_decl_line   : 761
    <9f1>   DW_AT_decl_column : 17
    <9f2>   DW_AT_type        : <0x696>
    <9f6>   DW_AT_data_member_location: 40
 <2><9f7>: Abbrev Number: 15 (DW_TAG_member)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x108138): AHB1ENR
    <9fc>   DW_AT_decl_file   : 4
    <9fd>   DW_AT_decl_line   : 762
    <9ff>   DW_AT_decl_column : 17
    <a00>   DW_AT_type        : <0x444>
    <a04>   DW_AT_data_member_location: 48
 <2><a05>: Abbrev Number: 15 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0x10922b): AHB2ENR
    <a0a>   DW_AT_decl_file   : 4
    <a0b>   DW_AT_decl_line   : 763
    <a0d>   DW_AT_decl_column : 17
    <a0e>   DW_AT_type        : <0x444>
    <a12>   DW_AT_data_member_location: 52
 <2><a13>: Abbrev Number: 15 (DW_TAG_member)
    <a14>   DW_AT_name        : (indirect string, offset: 0x10a241): AHB3ENR
    <a18>   DW_AT_decl_file   : 4
    <a19>   DW_AT_decl_line   : 764
    <a1b>   DW_AT_decl_column : 17
    <a1c>   DW_AT_type        : <0x444>
    <a20>   DW_AT_data_member_location: 56
 <2><a21>: Abbrev Number: 15 (DW_TAG_member)
    <a22>   DW_AT_name        : (indirect string, offset: 0x10cf2b): RESERVED2
    <a26>   DW_AT_decl_file   : 4
    <a27>   DW_AT_decl_line   : 765
    <a29>   DW_AT_decl_column : 17
    <a2a>   DW_AT_type        : <0x438>
    <a2e>   DW_AT_data_member_location: 60
 <2><a2f>: Abbrev Number: 15 (DW_TAG_member)
    <a30>   DW_AT_name        : (indirect string, offset: 0x10acff): APB1ENR
    <a34>   DW_AT_decl_file   : 4
    <a35>   DW_AT_decl_line   : 766
    <a37>   DW_AT_decl_column : 17
    <a38>   DW_AT_type        : <0x444>
    <a3c>   DW_AT_data_member_location: 64
 <2><a3d>: Abbrev Number: 15 (DW_TAG_member)
    <a3e>   DW_AT_name        : (indirect string, offset: 0x10a5de): APB2ENR
    <a42>   DW_AT_decl_file   : 4
    <a43>   DW_AT_decl_line   : 767
    <a45>   DW_AT_decl_column : 17
    <a46>   DW_AT_type        : <0x444>
    <a4a>   DW_AT_data_member_location: 68
 <2><a4b>: Abbrev Number: 15 (DW_TAG_member)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x10cf35): RESERVED3
    <a50>   DW_AT_decl_file   : 4
    <a51>   DW_AT_decl_line   : 768
    <a53>   DW_AT_decl_column : 17
    <a54>   DW_AT_type        : <0x696>
    <a58>   DW_AT_data_member_location: 72
 <2><a59>: Abbrev Number: 15 (DW_TAG_member)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x10c1f2): AHB1LPENR
    <a5e>   DW_AT_decl_file   : 4
    <a5f>   DW_AT_decl_line   : 769
    <a61>   DW_AT_decl_column : 17
    <a62>   DW_AT_type        : <0x444>
    <a66>   DW_AT_data_member_location: 80
 <2><a67>: Abbrev Number: 15 (DW_TAG_member)
    <a68>   DW_AT_name        : (indirect string, offset: 0x108fb2): AHB2LPENR
    <a6c>   DW_AT_decl_file   : 4
    <a6d>   DW_AT_decl_line   : 770
    <a6f>   DW_AT_decl_column : 17
    <a70>   DW_AT_type        : <0x444>
    <a74>   DW_AT_data_member_location: 84
 <2><a75>: Abbrev Number: 15 (DW_TAG_member)
    <a76>   DW_AT_name        : (indirect string, offset: 0x10b76b): AHB3LPENR
    <a7a>   DW_AT_decl_file   : 4
    <a7b>   DW_AT_decl_line   : 771
    <a7d>   DW_AT_decl_column : 17
    <a7e>   DW_AT_type        : <0x444>
    <a82>   DW_AT_data_member_location: 88
 <2><a83>: Abbrev Number: 15 (DW_TAG_member)
    <a84>   DW_AT_name        : (indirect string, offset: 0x10cf3f): RESERVED4
    <a88>   DW_AT_decl_file   : 4
    <a89>   DW_AT_decl_line   : 772
    <a8b>   DW_AT_decl_column : 17
    <a8c>   DW_AT_type        : <0x438>
    <a90>   DW_AT_data_member_location: 92
 <2><a91>: Abbrev Number: 15 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0x10c3f6): APB1LPENR
    <a96>   DW_AT_decl_file   : 4
    <a97>   DW_AT_decl_line   : 773
    <a99>   DW_AT_decl_column : 17
    <a9a>   DW_AT_type        : <0x444>
    <a9e>   DW_AT_data_member_location: 96
 <2><a9f>: Abbrev Number: 15 (DW_TAG_member)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x10882d): APB2LPENR
    <aa4>   DW_AT_decl_file   : 4
    <aa5>   DW_AT_decl_line   : 774
    <aa7>   DW_AT_decl_column : 17
    <aa8>   DW_AT_type        : <0x444>
    <aac>   DW_AT_data_member_location: 100
 <2><aad>: Abbrev Number: 15 (DW_TAG_member)
    <aae>   DW_AT_name        : (indirect string, offset: 0x10cf49): RESERVED5
    <ab2>   DW_AT_decl_file   : 4
    <ab3>   DW_AT_decl_line   : 775
    <ab5>   DW_AT_decl_column : 17
    <ab6>   DW_AT_type        : <0x696>
    <aba>   DW_AT_data_member_location: 104
 <2><abb>: Abbrev Number: 15 (DW_TAG_member)
    <abc>   DW_AT_name        : (indirect string, offset: 0x10855a): BDCR
    <ac0>   DW_AT_decl_file   : 4
    <ac1>   DW_AT_decl_line   : 776
    <ac3>   DW_AT_decl_column : 17
    <ac4>   DW_AT_type        : <0x444>
    <ac8>   DW_AT_data_member_location: 112
 <2><ac9>: Abbrev Number: 24 (DW_TAG_member)
    <aca>   DW_AT_name        : CSR
    <ace>   DW_AT_decl_file   : 4
    <acf>   DW_AT_decl_line   : 777
    <ad1>   DW_AT_decl_column : 17
    <ad2>   DW_AT_type        : <0x444>
    <ad6>   DW_AT_data_member_location: 116
 <2><ad7>: Abbrev Number: 15 (DW_TAG_member)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x10cf53): RESERVED6
    <adc>   DW_AT_decl_file   : 4
    <add>   DW_AT_decl_line   : 778
    <adf>   DW_AT_decl_column : 17
    <ae0>   DW_AT_type        : <0x696>
    <ae4>   DW_AT_data_member_location: 120
 <2><ae5>: Abbrev Number: 15 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x10a9aa): SSCGR
    <aea>   DW_AT_decl_file   : 4
    <aeb>   DW_AT_decl_line   : 779
    <aed>   DW_AT_decl_column : 17
    <aee>   DW_AT_type        : <0x444>
    <af2>   DW_AT_data_member_location: 128
 <2><af3>: Abbrev Number: 15 (DW_TAG_member)
    <af4>   DW_AT_name        : (indirect string, offset: 0x109933): PLLI2SCFGR
    <af8>   DW_AT_decl_file   : 4
    <af9>   DW_AT_decl_line   : 780
    <afb>   DW_AT_decl_column : 17
    <afc>   DW_AT_type        : <0x444>
    <b00>   DW_AT_data_member_location: 132
 <2><b01>: Abbrev Number: 15 (DW_TAG_member)
    <b02>   DW_AT_name        : (indirect string, offset: 0x10932f): PLLSAICFGR
    <b06>   DW_AT_decl_file   : 4
    <b07>   DW_AT_decl_line   : 781
    <b09>   DW_AT_decl_column : 17
    <b0a>   DW_AT_type        : <0x444>
    <b0e>   DW_AT_data_member_location: 136
 <2><b0f>: Abbrev Number: 15 (DW_TAG_member)
    <b10>   DW_AT_name        : (indirect string, offset: 0x1082cd): DCKCFGR1
    <b14>   DW_AT_decl_file   : 4
    <b15>   DW_AT_decl_line   : 782
    <b17>   DW_AT_decl_column : 17
    <b18>   DW_AT_type        : <0x444>
    <b1c>   DW_AT_data_member_location: 140
 <2><b1d>: Abbrev Number: 15 (DW_TAG_member)
    <b1e>   DW_AT_name        : (indirect string, offset: 0x10a76c): DCKCFGR2
    <b22>   DW_AT_decl_file   : 4
    <b23>   DW_AT_decl_line   : 783
    <b25>   DW_AT_decl_column : 17
    <b26>   DW_AT_type        : <0x444>
    <b2a>   DW_AT_data_member_location: 144
 <2><b2b>: Abbrev Number: 0
 <1><b2c>: Abbrev Number: 19 (DW_TAG_typedef)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x10a42f): RCC_TypeDef
    <b31>   DW_AT_decl_file   : 4
    <b32>   DW_AT_decl_line   : 785
    <b34>   DW_AT_decl_column : 3
    <b35>   DW_AT_type        : <0x954>
 <1><b39>: Abbrev Number: 23 (DW_TAG_structure_type)
    <b3a>   DW_AT_byte_size   : 104
    <b3b>   DW_AT_decl_file   : 4
    <b3c>   DW_AT_decl_line   : 954
    <b3e>   DW_AT_decl_column : 9
    <b3f>   DW_AT_sibling     : <0xcae>
 <2><b43>: Abbrev Number: 24 (DW_TAG_member)
    <b44>   DW_AT_name        : CR1
    <b48>   DW_AT_decl_file   : 4
    <b49>   DW_AT_decl_line   : 956
    <b4b>   DW_AT_decl_column : 17
    <b4c>   DW_AT_type        : <0x444>
    <b50>   DW_AT_data_member_location: 0
 <2><b51>: Abbrev Number: 24 (DW_TAG_member)
    <b52>   DW_AT_name        : CR2
    <b56>   DW_AT_decl_file   : 4
    <b57>   DW_AT_decl_line   : 957
    <b59>   DW_AT_decl_column : 17
    <b5a>   DW_AT_type        : <0x444>
    <b5e>   DW_AT_data_member_location: 4
 <2><b5f>: Abbrev Number: 15 (DW_TAG_member)
    <b60>   DW_AT_name        : (indirect string, offset: 0x4c051): SMCR
    <b64>   DW_AT_decl_file   : 4
    <b65>   DW_AT_decl_line   : 958
    <b67>   DW_AT_decl_column : 17
    <b68>   DW_AT_type        : <0x444>
    <b6c>   DW_AT_data_member_location: 8
 <2><b6d>: Abbrev Number: 15 (DW_TAG_member)
    <b6e>   DW_AT_name        : (indirect string, offset: 0x53b9a): DIER
    <b72>   DW_AT_decl_file   : 4
    <b73>   DW_AT_decl_line   : 959
    <b75>   DW_AT_decl_column : 17
    <b76>   DW_AT_type        : <0x444>
    <b7a>   DW_AT_data_member_location: 12
 <2><b7b>: Abbrev Number: 24 (DW_TAG_member)
    <b7c>   DW_AT_name        : SR
    <b7f>   DW_AT_decl_file   : 4
    <b80>   DW_AT_decl_line   : 960
    <b82>   DW_AT_decl_column : 17
    <b83>   DW_AT_type        : <0x444>
    <b87>   DW_AT_data_member_location: 16
 <2><b88>: Abbrev Number: 24 (DW_TAG_member)
    <b89>   DW_AT_name        : EGR
    <b8d>   DW_AT_decl_file   : 4
    <b8e>   DW_AT_decl_line   : 961
    <b90>   DW_AT_decl_column : 17
    <b91>   DW_AT_type        : <0x444>
    <b95>   DW_AT_data_member_location: 20
 <2><b96>: Abbrev Number: 15 (DW_TAG_member)
    <b97>   DW_AT_name        : (indirect string, offset: 0x8f916): CCMR1
    <b9b>   DW_AT_decl_file   : 4
    <b9c>   DW_AT_decl_line   : 962
    <b9e>   DW_AT_decl_column : 17
    <b9f>   DW_AT_type        : <0x444>
    <ba3>   DW_AT_data_member_location: 24
 <2><ba4>: Abbrev Number: 15 (DW_TAG_member)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x1df04): CCMR2
    <ba9>   DW_AT_decl_file   : 4
    <baa>   DW_AT_decl_line   : 963
    <bac>   DW_AT_decl_column : 17
    <bad>   DW_AT_type        : <0x444>
    <bb1>   DW_AT_data_member_location: 28
 <2><bb2>: Abbrev Number: 15 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x3ea1f): CCER
    <bb7>   DW_AT_decl_file   : 4
    <bb8>   DW_AT_decl_line   : 964
    <bba>   DW_AT_decl_column : 17
    <bbb>   DW_AT_type        : <0x444>
    <bbf>   DW_AT_data_member_location: 32
 <2><bc0>: Abbrev Number: 24 (DW_TAG_member)
    <bc1>   DW_AT_name        : CNT
    <bc5>   DW_AT_decl_file   : 4
    <bc6>   DW_AT_decl_line   : 965
    <bc8>   DW_AT_decl_column : 17
    <bc9>   DW_AT_type        : <0x444>
    <bcd>   DW_AT_data_member_location: 36
 <2><bce>: Abbrev Number: 24 (DW_TAG_member)
    <bcf>   DW_AT_name        : PSC
    <bd3>   DW_AT_decl_file   : 4
    <bd4>   DW_AT_decl_line   : 966
    <bd6>   DW_AT_decl_column : 17
    <bd7>   DW_AT_type        : <0x444>
    <bdb>   DW_AT_data_member_location: 40
 <2><bdc>: Abbrev Number: 24 (DW_TAG_member)
    <bdd>   DW_AT_name        : ARR
    <be1>   DW_AT_decl_file   : 4
    <be2>   DW_AT_decl_line   : 967
    <be4>   DW_AT_decl_column : 17
    <be5>   DW_AT_type        : <0x444>
    <be9>   DW_AT_data_member_location: 44
 <2><bea>: Abbrev Number: 24 (DW_TAG_member)
    <beb>   DW_AT_name        : RCR
    <bef>   DW_AT_decl_file   : 4
    <bf0>   DW_AT_decl_line   : 968
    <bf2>   DW_AT_decl_column : 17
    <bf3>   DW_AT_type        : <0x444>
    <bf7>   DW_AT_data_member_location: 48
 <2><bf8>: Abbrev Number: 15 (DW_TAG_member)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x1f0c5): CCR1
    <bfd>   DW_AT_decl_file   : 4
    <bfe>   DW_AT_decl_line   : 969
    <c00>   DW_AT_decl_column : 17
    <c01>   DW_AT_type        : <0x444>
    <c05>   DW_AT_data_member_location: 52
 <2><c06>: Abbrev Number: 15 (DW_TAG_member)
    <c07>   DW_AT_name        : (indirect string, offset: 0x6d9b0): CCR2
    <c0b>   DW_AT_decl_file   : 4
    <c0c>   DW_AT_decl_line   : 970
    <c0e>   DW_AT_decl_column : 17
    <c0f>   DW_AT_type        : <0x444>
    <c13>   DW_AT_data_member_location: 56
 <2><c14>: Abbrev Number: 15 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0x49e94): CCR3
    <c19>   DW_AT_decl_file   : 4
    <c1a>   DW_AT_decl_line   : 971
    <c1c>   DW_AT_decl_column : 17
    <c1d>   DW_AT_type        : <0x444>
    <c21>   DW_AT_data_member_location: 60
 <2><c22>: Abbrev Number: 15 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0x10500): CCR4
    <c27>   DW_AT_decl_file   : 4
    <c28>   DW_AT_decl_line   : 972
    <c2a>   DW_AT_decl_column : 17
    <c2b>   DW_AT_type        : <0x444>
    <c2f>   DW_AT_data_member_location: 64
 <2><c30>: Abbrev Number: 15 (DW_TAG_member)
    <c31>   DW_AT_name        : (indirect string, offset: 0xb43bc): BDTR
    <c35>   DW_AT_decl_file   : 4
    <c36>   DW_AT_decl_line   : 973
    <c38>   DW_AT_decl_column : 17
    <c39>   DW_AT_type        : <0x444>
    <c3d>   DW_AT_data_member_location: 68
 <2><c3e>: Abbrev Number: 24 (DW_TAG_member)
    <c3f>   DW_AT_name        : DCR
    <c43>   DW_AT_decl_file   : 4
    <c44>   DW_AT_decl_line   : 974
    <c46>   DW_AT_decl_column : 17
    <c47>   DW_AT_type        : <0x444>
    <c4b>   DW_AT_data_member_location: 72
 <2><c4c>: Abbrev Number: 15 (DW_TAG_member)
    <c4d>   DW_AT_name        : (indirect string, offset: 0xc3ca1): DMAR
    <c51>   DW_AT_decl_file   : 4
    <c52>   DW_AT_decl_line   : 975
    <c54>   DW_AT_decl_column : 17
    <c55>   DW_AT_type        : <0x444>
    <c59>   DW_AT_data_member_location: 76
 <2><c5a>: Abbrev Number: 24 (DW_TAG_member)
    <c5b>   DW_AT_name        : OR
    <c5e>   DW_AT_decl_file   : 4
    <c5f>   DW_AT_decl_line   : 976
    <c61>   DW_AT_decl_column : 17
    <c62>   DW_AT_type        : <0x444>
    <c66>   DW_AT_data_member_location: 80
 <2><c67>: Abbrev Number: 15 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0xea230): CCMR3
    <c6c>   DW_AT_decl_file   : 4
    <c6d>   DW_AT_decl_line   : 977
    <c6f>   DW_AT_decl_column : 17
    <c70>   DW_AT_type        : <0x444>
    <c74>   DW_AT_data_member_location: 84
 <2><c75>: Abbrev Number: 15 (DW_TAG_member)
    <c76>   DW_AT_name        : (indirect string, offset: 0x5e222): CCR5
    <c7a>   DW_AT_decl_file   : 4
    <c7b>   DW_AT_decl_line   : 978
    <c7d>   DW_AT_decl_column : 17
    <c7e>   DW_AT_type        : <0x444>
    <c82>   DW_AT_data_member_location: 88
 <2><c83>: Abbrev Number: 15 (DW_TAG_member)
    <c84>   DW_AT_name        : (indirect string, offset: 0xba590): CCR6
    <c88>   DW_AT_decl_file   : 4
    <c89>   DW_AT_decl_line   : 979
    <c8b>   DW_AT_decl_column : 17
    <c8c>   DW_AT_type        : <0x444>
    <c90>   DW_AT_data_member_location: 92
 <2><c91>: Abbrev Number: 24 (DW_TAG_member)
    <c92>   DW_AT_name        : AF1
    <c96>   DW_AT_decl_file   : 4
    <c97>   DW_AT_decl_line   : 980
    <c99>   DW_AT_decl_column : 17
    <c9a>   DW_AT_type        : <0x444>
    <c9e>   DW_AT_data_member_location: 96
 <2><c9f>: Abbrev Number: 24 (DW_TAG_member)
    <ca0>   DW_AT_name        : AF2
    <ca4>   DW_AT_decl_file   : 4
    <ca5>   DW_AT_decl_line   : 981
    <ca7>   DW_AT_decl_column : 17
    <ca8>   DW_AT_type        : <0x444>
    <cac>   DW_AT_data_member_location: 100
 <2><cad>: Abbrev Number: 0
 <1><cae>: Abbrev Number: 19 (DW_TAG_typedef)
    <caf>   DW_AT_name        : (indirect string, offset: 0x10cf79): TIM_TypeDef
    <cb3>   DW_AT_decl_file   : 4
    <cb4>   DW_AT_decl_line   : 983
    <cb6>   DW_AT_decl_column : 3
    <cb7>   DW_AT_type        : <0xb39>
 <1><cbb>: Abbrev Number: 23 (DW_TAG_structure_type)
    <cbc>   DW_AT_byte_size   : 44
    <cbd>   DW_AT_decl_file   : 4
    <cbe>   DW_AT_decl_line   : 1005
    <cc0>   DW_AT_decl_column : 9
    <cc1>   DW_AT_sibling     : <0xd60>
 <2><cc5>: Abbrev Number: 24 (DW_TAG_member)
    <cc6>   DW_AT_name        : CR1
    <cca>   DW_AT_decl_file   : 4
    <ccb>   DW_AT_decl_line   : 1007
    <ccd>   DW_AT_decl_column : 17
    <cce>   DW_AT_type        : <0x444>
    <cd2>   DW_AT_data_member_location: 0
 <2><cd3>: Abbrev Number: 24 (DW_TAG_member)
    <cd4>   DW_AT_name        : CR2
    <cd8>   DW_AT_decl_file   : 4
    <cd9>   DW_AT_decl_line   : 1008
    <cdb>   DW_AT_decl_column : 17
    <cdc>   DW_AT_type        : <0x444>
    <ce0>   DW_AT_data_member_location: 4
 <2><ce1>: Abbrev Number: 24 (DW_TAG_member)
    <ce2>   DW_AT_name        : CR3
    <ce6>   DW_AT_decl_file   : 4
    <ce7>   DW_AT_decl_line   : 1009
    <ce9>   DW_AT_decl_column : 17
    <cea>   DW_AT_type        : <0x444>
    <cee>   DW_AT_data_member_location: 8
 <2><cef>: Abbrev Number: 24 (DW_TAG_member)
    <cf0>   DW_AT_name        : BRR
    <cf4>   DW_AT_decl_file   : 4
    <cf5>   DW_AT_decl_line   : 1010
    <cf7>   DW_AT_decl_column : 17
    <cf8>   DW_AT_type        : <0x444>
    <cfc>   DW_AT_data_member_location: 12
 <2><cfd>: Abbrev Number: 15 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x10933a): GTPR
    <d02>   DW_AT_decl_file   : 4
    <d03>   DW_AT_decl_line   : 1011
    <d05>   DW_AT_decl_column : 17
    <d06>   DW_AT_type        : <0x444>
    <d0a>   DW_AT_data_member_location: 16
 <2><d0b>: Abbrev Number: 15 (DW_TAG_member)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x10c7c8): RTOR
    <d10>   DW_AT_decl_file   : 4
    <d11>   DW_AT_decl_line   : 1012
    <d13>   DW_AT_decl_column : 17
    <d14>   DW_AT_type        : <0x444>
    <d18>   DW_AT_data_member_location: 20
 <2><d19>: Abbrev Number: 24 (DW_TAG_member)
    <d1a>   DW_AT_name        : RQR
    <d1e>   DW_AT_decl_file   : 4
    <d1f>   DW_AT_decl_line   : 1013
    <d21>   DW_AT_decl_column : 17
    <d22>   DW_AT_type        : <0x444>
    <d26>   DW_AT_data_member_location: 24
 <2><d27>: Abbrev Number: 24 (DW_TAG_member)
    <d28>   DW_AT_name        : ISR
    <d2c>   DW_AT_decl_file   : 4
    <d2d>   DW_AT_decl_line   : 1014
    <d2f>   DW_AT_decl_column : 17
    <d30>   DW_AT_type        : <0x444>
    <d34>   DW_AT_data_member_location: 28
 <2><d35>: Abbrev Number: 24 (DW_TAG_member)
    <d36>   DW_AT_name        : ICR
    <d3a>   DW_AT_decl_file   : 4
    <d3b>   DW_AT_decl_line   : 1015
    <d3d>   DW_AT_decl_column : 17
    <d3e>   DW_AT_type        : <0x444>
    <d42>   DW_AT_data_member_location: 32
 <2><d43>: Abbrev Number: 24 (DW_TAG_member)
    <d44>   DW_AT_name        : RDR
    <d48>   DW_AT_decl_file   : 4
    <d49>   DW_AT_decl_line   : 1016
    <d4b>   DW_AT_decl_column : 17
    <d4c>   DW_AT_type        : <0x444>
    <d50>   DW_AT_data_member_location: 36
 <2><d51>: Abbrev Number: 24 (DW_TAG_member)
    <d52>   DW_AT_name        : TDR
    <d56>   DW_AT_decl_file   : 4
    <d57>   DW_AT_decl_line   : 1017
    <d59>   DW_AT_decl_column : 17
    <d5a>   DW_AT_type        : <0x444>
    <d5e>   DW_AT_data_member_location: 40
 <2><d5f>: Abbrev Number: 0
 <1><d60>: Abbrev Number: 19 (DW_TAG_typedef)
    <d61>   DW_AT_name        : (indirect string, offset: 0x10a9ef): USART_TypeDef
    <d65>   DW_AT_decl_file   : 4
    <d66>   DW_AT_decl_line   : 1018
    <d68>   DW_AT_decl_column : 3
    <d69>   DW_AT_type        : <0xcbb>
 <1><d6d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <d6e>   DW_AT_byte_size   : 320
    <d70>   DW_AT_decl_file   : 4
    <d71>   DW_AT_decl_line   : 1051
    <d73>   DW_AT_decl_column : 9
    <d74>   DW_AT_sibling     : <0xecb>
 <2><d78>: Abbrev Number: 15 (DW_TAG_member)
    <d79>   DW_AT_name        : (indirect string, offset: 0x10833d): GOTGCTL
    <d7d>   DW_AT_decl_file   : 4
    <d7e>   DW_AT_decl_line   : 1053
    <d80>   DW_AT_decl_column : 16
    <d81>   DW_AT_type        : <0x444>
    <d85>   DW_AT_data_member_location: 0
 <2><d86>: Abbrev Number: 15 (DW_TAG_member)
    <d87>   DW_AT_name        : (indirect string, offset: 0x10bae9): GOTGINT
    <d8b>   DW_AT_decl_file   : 4
    <d8c>   DW_AT_decl_line   : 1054
    <d8e>   DW_AT_decl_column : 17
    <d8f>   DW_AT_type        : <0x444>
    <d93>   DW_AT_data_member_location: 4
 <2><d94>: Abbrev Number: 15 (DW_TAG_member)
    <d95>   DW_AT_name        : (indirect string, offset: 0x10909f): GAHBCFG
    <d99>   DW_AT_decl_file   : 4
    <d9a>   DW_AT_decl_line   : 1055
    <d9c>   DW_AT_decl_column : 17
    <d9d>   DW_AT_type        : <0x444>
    <da1>   DW_AT_data_member_location: 8
 <2><da2>: Abbrev Number: 15 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0x10aa6e): GUSBCFG
    <da7>   DW_AT_decl_file   : 4
    <da8>   DW_AT_decl_line   : 1056
    <daa>   DW_AT_decl_column : 17
    <dab>   DW_AT_type        : <0x444>
    <daf>   DW_AT_data_member_location: 12
 <2><db0>: Abbrev Number: 15 (DW_TAG_member)
    <db1>   DW_AT_name        : (indirect string, offset: 0x10ad07): GRSTCTL
    <db5>   DW_AT_decl_file   : 4
    <db6>   DW_AT_decl_line   : 1057
    <db8>   DW_AT_decl_column : 17
    <db9>   DW_AT_type        : <0x444>
    <dbd>   DW_AT_data_member_location: 16
 <2><dbe>: Abbrev Number: 15 (DW_TAG_member)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x10c75a): GINTSTS
    <dc3>   DW_AT_decl_file   : 4
    <dc4>   DW_AT_decl_line   : 1058
    <dc6>   DW_AT_decl_column : 17
    <dc7>   DW_AT_type        : <0x444>
    <dcb>   DW_AT_data_member_location: 20
 <2><dcc>: Abbrev Number: 15 (DW_TAG_member)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x108f7a): GINTMSK
    <dd1>   DW_AT_decl_file   : 4
    <dd2>   DW_AT_decl_line   : 1059
    <dd4>   DW_AT_decl_column : 17
    <dd5>   DW_AT_type        : <0x444>
    <dd9>   DW_AT_data_member_location: 24
 <2><dda>: Abbrev Number: 15 (DW_TAG_member)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x109877): GRXSTSR
    <ddf>   DW_AT_decl_file   : 4
    <de0>   DW_AT_decl_line   : 1060
    <de2>   DW_AT_decl_column : 17
    <de3>   DW_AT_type        : <0x444>
    <de7>   DW_AT_data_member_location: 28
 <2><de8>: Abbrev Number: 15 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x10986f): GRXSTSP
    <ded>   DW_AT_decl_file   : 4
    <dee>   DW_AT_decl_line   : 1061
    <df0>   DW_AT_decl_column : 17
    <df1>   DW_AT_type        : <0x444>
    <df5>   DW_AT_data_member_location: 32
 <2><df6>: Abbrev Number: 15 (DW_TAG_member)
    <df7>   DW_AT_name        : (indirect string, offset: 0x10be2e): GRXFSIZ
    <dfb>   DW_AT_decl_file   : 4
    <dfc>   DW_AT_decl_line   : 1062
    <dfe>   DW_AT_decl_column : 17
    <dff>   DW_AT_type        : <0x444>
    <e03>   DW_AT_data_member_location: 36
 <2><e04>: Abbrev Number: 15 (DW_TAG_member)
    <e05>   DW_AT_name        : (indirect string, offset: 0x10c590): DIEPTXF0_HNPTXFSIZ
    <e09>   DW_AT_decl_file   : 4
    <e0a>   DW_AT_decl_line   : 1063
    <e0c>   DW_AT_decl_column : 17
    <e0d>   DW_AT_type        : <0x444>
    <e11>   DW_AT_data_member_location: 40
 <2><e12>: Abbrev Number: 15 (DW_TAG_member)
    <e13>   DW_AT_name        : (indirect string, offset: 0x10b155): HNPTXSTS
    <e17>   DW_AT_decl_file   : 4
    <e18>   DW_AT_decl_line   : 1064
    <e1a>   DW_AT_decl_column : 17
    <e1b>   DW_AT_type        : <0x444>
    <e1f>   DW_AT_data_member_location: 44
 <2><e20>: Abbrev Number: 15 (DW_TAG_member)
    <e21>   DW_AT_name        : (indirect string, offset: 0x10975e): Reserved30
    <e25>   DW_AT_decl_file   : 4
    <e26>   DW_AT_decl_line   : 1065
    <e28>   DW_AT_decl_column : 12
    <e29>   DW_AT_type        : <0x696>
    <e2d>   DW_AT_data_member_location: 48
 <2><e2e>: Abbrev Number: 15 (DW_TAG_member)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x10bc12): GCCFG
    <e33>   DW_AT_decl_file   : 4
    <e34>   DW_AT_decl_line   : 1066
    <e36>   DW_AT_decl_column : 17
    <e37>   DW_AT_type        : <0x444>
    <e3b>   DW_AT_data_member_location: 56
 <2><e3c>: Abbrev Number: 24 (DW_TAG_member)
    <e3d>   DW_AT_name        : CID
    <e41>   DW_AT_decl_file   : 4
    <e42>   DW_AT_decl_line   : 1067
    <e44>   DW_AT_decl_column : 17
    <e45>   DW_AT_type        : <0x444>
    <e49>   DW_AT_data_member_location: 60
 <2><e4a>: Abbrev Number: 15 (DW_TAG_member)
    <e4b>   DW_AT_name        : (indirect string, offset: 0x109a9e): Reserved5
    <e4f>   DW_AT_decl_file   : 4
    <e50>   DW_AT_decl_line   : 1068
    <e52>   DW_AT_decl_column : 13
    <e53>   DW_AT_type        : <0x8f4>
    <e57>   DW_AT_data_member_location: 64
 <2><e58>: Abbrev Number: 15 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x10ba04): GHWCFG3
    <e5d>   DW_AT_decl_file   : 4
    <e5e>   DW_AT_decl_line   : 1069
    <e60>   DW_AT_decl_column : 17
    <e61>   DW_AT_type        : <0x444>
    <e65>   DW_AT_data_member_location: 76
 <2><e66>: Abbrev Number: 15 (DW_TAG_member)
    <e67>   DW_AT_name        : (indirect string, offset: 0x109aa8): Reserved6
    <e6b>   DW_AT_decl_file   : 4
    <e6c>   DW_AT_decl_line   : 1070
    <e6e>   DW_AT_decl_column : 13
    <e6f>   DW_AT_type        : <0x438>
    <e73>   DW_AT_data_member_location: 80
 <2><e74>: Abbrev Number: 15 (DW_TAG_member)
    <e75>   DW_AT_name        : (indirect string, offset: 0x10815e): GLPMCFG
    <e79>   DW_AT_decl_file   : 4
    <e7a>   DW_AT_decl_line   : 1071
    <e7c>   DW_AT_decl_column : 17
    <e7d>   DW_AT_type        : <0x444>
    <e81>   DW_AT_data_member_location: 84
 <2><e82>: Abbrev Number: 15 (DW_TAG_member)
    <e83>   DW_AT_name        : (indirect string, offset: 0x109ab2): Reserved7
    <e87>   DW_AT_decl_file   : 4
    <e88>   DW_AT_decl_line   : 1072
    <e8a>   DW_AT_decl_column : 13
    <e8b>   DW_AT_type        : <0x438>
    <e8f>   DW_AT_data_member_location: 88
 <2><e90>: Abbrev Number: 15 (DW_TAG_member)
    <e91>   DW_AT_name        : (indirect string, offset: 0x1098eb): GDFIFOCFG
    <e95>   DW_AT_decl_file   : 4
    <e96>   DW_AT_decl_line   : 1073
    <e98>   DW_AT_decl_column : 17
    <e99>   DW_AT_type        : <0x444>
    <e9d>   DW_AT_data_member_location: 92
 <2><e9e>: Abbrev Number: 15 (DW_TAG_member)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x109785): Reserved43
    <ea3>   DW_AT_decl_file   : 4
    <ea4>   DW_AT_decl_line   : 1074
    <ea6>   DW_AT_decl_column : 13
    <ea7>   DW_AT_type        : <0x839>
    <eab>   DW_AT_data_member_location: 96
 <2><eac>: Abbrev Number: 17 (DW_TAG_member)
    <ead>   DW_AT_name        : (indirect string, offset: 0x10885a): HPTXFSIZ
    <eb1>   DW_AT_decl_file   : 4
    <eb2>   DW_AT_decl_line   : 1075
    <eb4>   DW_AT_decl_column : 17
    <eb5>   DW_AT_type        : <0x444>
    <eb9>   DW_AT_data_member_location: 256
 <2><ebb>: Abbrev Number: 17 (DW_TAG_member)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x10a5f2): DIEPTXF
    <ec0>   DW_AT_decl_file   : 4
    <ec1>   DW_AT_decl_line   : 1076
    <ec3>   DW_AT_decl_column : 17
    <ec4>   DW_AT_type        : <0xedb>
    <ec8>   DW_AT_data_member_location: 260
 <2><eca>: Abbrev Number: 0
 <1><ecb>: Abbrev Number: 10 (DW_TAG_array_type)
    <ecc>   DW_AT_type        : <0x444>
    <ed0>   DW_AT_sibling     : <0xedb>
 <2><ed4>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <ed5>   DW_AT_type        : <0x405>
    <ed9>   DW_AT_upper_bound : 14
 <2><eda>: Abbrev Number: 0
 <1><edb>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <edc>   DW_AT_type        : <0xecb>
 <1><ee0>: Abbrev Number: 19 (DW_TAG_typedef)
    <ee1>   DW_AT_name        : (indirect string, offset: 0x10bb75): USB_OTG_GlobalTypeDef
    <ee5>   DW_AT_decl_file   : 4
    <ee6>   DW_AT_decl_line   : 1077
    <ee8>   DW_AT_decl_column : 3
    <ee9>   DW_AT_type        : <0xd6d>
 <1><eed>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <eee>   DW_AT_encoding    : 7	(unsigned)
    <eef>   DW_AT_byte_size   : 1
    <ef0>   DW_AT_type        : <0x3b5>
    <ef4>   DW_AT_decl_file   : 7
    <ef5>   DW_AT_decl_line   : 162
    <ef6>   DW_AT_decl_column : 1
    <ef7>   DW_AT_sibling     : <0xf08>
 <2><efb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <efc>   DW_AT_name        : (indirect string, offset: 0x30684): DISABLE
    <f00>   DW_AT_const_value : 0
 <2><f01>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f02>   DW_AT_name        : (indirect string, offset: 0x8af5d): ENABLE
    <f06>   DW_AT_const_value : 1
 <2><f07>: Abbrev Number: 0
 <1><f08>: Abbrev Number: 6 (DW_TAG_typedef)
    <f09>   DW_AT_name        : (indirect string, offset: 0x10854a): FunctionalState
    <f0d>   DW_AT_decl_file   : 7
    <f0e>   DW_AT_decl_line   : 165
    <f0f>   DW_AT_decl_column : 3
    <f10>   DW_AT_type        : <0xeed>
 <1><f14>: Abbrev Number: 6 (DW_TAG_typedef)
    <f15>   DW_AT_name        : (indirect string, offset: 0xb5fb): size_t
    <f19>   DW_AT_decl_file   : 8
    <f1a>   DW_AT_decl_line   : 209
    <f1b>   DW_AT_decl_column : 23
    <f1c>   DW_AT_type        : <0x405>
 <1><f20>: Abbrev Number: 5 (DW_TAG_base_type)
    <f21>   DW_AT_byte_size   : 8
    <f22>   DW_AT_encoding    : 4	(float)
    <f23>   DW_AT_name        : (indirect string, offset: 0x17c94): long double
 <1><f27>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f28>   DW_AT_encoding    : 7	(unsigned)
    <f29>   DW_AT_byte_size   : 1
    <f2a>   DW_AT_type        : <0x3b5>
    <f2e>   DW_AT_decl_file   : 9
    <f2f>   DW_AT_decl_line   : 39
    <f30>   DW_AT_decl_column : 1
    <f31>   DW_AT_sibling     : <0xf4e>
 <2><f35>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0x1099ab): HAL_OK
    <f3a>   DW_AT_const_value : 0
 <2><f3b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x10b20b): HAL_ERROR
    <f40>   DW_AT_const_value : 1
 <2><f41>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0x10888f): HAL_BUSY
    <f46>   DW_AT_const_value : 2
 <2><f47>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f48>   DW_AT_name        : (indirect string, offset: 0x1094ec): HAL_TIMEOUT
    <f4c>   DW_AT_const_value : 3
 <2><f4d>: Abbrev Number: 0
 <1><f4e>: Abbrev Number: 6 (DW_TAG_typedef)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x107c57): HAL_StatusTypeDef
    <f53>   DW_AT_decl_file   : 9
    <f54>   DW_AT_decl_line   : 44
    <f55>   DW_AT_decl_column : 3
    <f56>   DW_AT_type        : <0xf27>
 <1><f5a>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f5b>   DW_AT_encoding    : 7	(unsigned)
    <f5c>   DW_AT_byte_size   : 1
    <f5d>   DW_AT_type        : <0x3b5>
    <f61>   DW_AT_decl_file   : 9
    <f62>   DW_AT_decl_line   : 50
    <f63>   DW_AT_decl_column : 1
    <f64>   DW_AT_sibling     : <0xf75>
 <2><f68>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f69>   DW_AT_name        : (indirect string, offset: 0x10bbb3): HAL_UNLOCKED
    <f6d>   DW_AT_const_value : 0
 <2><f6e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x10d40b): HAL_LOCKED
    <f73>   DW_AT_const_value : 1
 <2><f74>: Abbrev Number: 0
 <1><f75>: Abbrev Number: 6 (DW_TAG_typedef)
    <f76>   DW_AT_name        : (indirect string, offset: 0x10af2e): HAL_LockTypeDef
    <f7a>   DW_AT_decl_file   : 9
    <f7b>   DW_AT_decl_line   : 53
    <f7c>   DW_AT_decl_column : 3
    <f7d>   DW_AT_type        : <0xf5a>
 <1><f81>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f82>   DW_AT_byte_size   : 28
    <f83>   DW_AT_decl_file   : 10
    <f84>   DW_AT_decl_line   : 45
    <f85>   DW_AT_decl_column : 9
    <f86>   DW_AT_sibling     : <0xfe6>
 <2><f8a>: Abbrev Number: 22 (DW_TAG_member)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x10b749): PLLState
    <f8f>   DW_AT_decl_file   : 10
    <f90>   DW_AT_decl_line   : 47
    <f91>   DW_AT_decl_column : 12
    <f92>   DW_AT_type        : <0x438>
    <f96>   DW_AT_data_member_location: 0
 <2><f97>: Abbrev Number: 22 (DW_TAG_member)
    <f98>   DW_AT_name        : (indirect string, offset: 0x10b8af): PLLSource
    <f9c>   DW_AT_decl_file   : 10
    <f9d>   DW_AT_decl_line   : 50
    <f9e>   DW_AT_decl_column : 12
    <f9f>   DW_AT_type        : <0x438>
    <fa3>   DW_AT_data_member_location: 4
 <2><fa4>: Abbrev Number: 22 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x10c304): PLLM
    <fa9>   DW_AT_decl_file   : 10
    <faa>   DW_AT_decl_line   : 53
    <fab>   DW_AT_decl_column : 12
    <fac>   DW_AT_type        : <0x438>
    <fb0>   DW_AT_data_member_location: 8
 <2><fb1>: Abbrev Number: 22 (DW_TAG_member)
    <fb2>   DW_AT_name        : (indirect string, offset: 0x10c309): PLLN
    <fb6>   DW_AT_decl_file   : 10
    <fb7>   DW_AT_decl_line   : 56
    <fb8>   DW_AT_decl_column : 12
    <fb9>   DW_AT_type        : <0x438>
    <fbd>   DW_AT_data_member_location: 12
 <2><fbe>: Abbrev Number: 22 (DW_TAG_member)
    <fbf>   DW_AT_name        : (indirect string, offset: 0x10c30e): PLLP
    <fc3>   DW_AT_decl_file   : 10
    <fc4>   DW_AT_decl_line   : 59
    <fc5>   DW_AT_decl_column : 12
    <fc6>   DW_AT_type        : <0x438>
    <fca>   DW_AT_data_member_location: 16
 <2><fcb>: Abbrev Number: 22 (DW_TAG_member)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x70aa8): PLLQ
    <fd0>   DW_AT_decl_file   : 10
    <fd1>   DW_AT_decl_line   : 62
    <fd2>   DW_AT_decl_column : 12
    <fd3>   DW_AT_type        : <0x438>
    <fd7>   DW_AT_data_member_location: 20
 <2><fd8>: Abbrev Number: 22 (DW_TAG_member)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x10c313): PLLR
    <fdd>   DW_AT_decl_file   : 10
    <fde>   DW_AT_decl_line   : 65
    <fdf>   DW_AT_decl_column : 12
    <fe0>   DW_AT_type        : <0x438>
    <fe4>   DW_AT_data_member_location: 24
 <2><fe5>: Abbrev Number: 0
 <1><fe6>: Abbrev Number: 6 (DW_TAG_typedef)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x10b0f9): RCC_PLLInitTypeDef
    <feb>   DW_AT_decl_file   : 10
    <fec>   DW_AT_decl_line   : 69
    <fed>   DW_AT_decl_column : 2
    <fee>   DW_AT_type        : <0xf81>
 <1><ff2>: Abbrev Number: 20 (DW_TAG_structure_type)
    <ff3>   DW_AT_byte_size   : 52
    <ff4>   DW_AT_decl_file   : 11
    <ff5>   DW_AT_decl_line   : 50
    <ff6>   DW_AT_decl_column : 9
    <ff7>   DW_AT_sibling     : <0x1057>
 <2><ffb>: Abbrev Number: 22 (DW_TAG_member)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x10c1a4): OscillatorType
    <1000>   DW_AT_decl_file   : 11
    <1001>   DW_AT_decl_line   : 52
    <1002>   DW_AT_decl_column : 12
    <1003>   DW_AT_type        : <0x438>
    <1007>   DW_AT_data_member_location: 0
 <2><1008>: Abbrev Number: 22 (DW_TAG_member)
    <1009>   DW_AT_name        : (indirect string, offset: 0x10b79d): HSEState
    <100d>   DW_AT_decl_file   : 11
    <100e>   DW_AT_decl_line   : 55
    <100f>   DW_AT_decl_column : 12
    <1010>   DW_AT_type        : <0x438>
    <1014>   DW_AT_data_member_location: 4
 <2><1015>: Abbrev Number: 22 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0x10b2c5): LSEState
    <101a>   DW_AT_decl_file   : 11
    <101b>   DW_AT_decl_line   : 58
    <101c>   DW_AT_decl_column : 12
    <101d>   DW_AT_type        : <0x438>
    <1021>   DW_AT_data_member_location: 8
 <2><1022>: Abbrev Number: 22 (DW_TAG_member)
    <1023>   DW_AT_name        : (indirect string, offset: 0x10a1e0): HSIState
    <1027>   DW_AT_decl_file   : 11
    <1028>   DW_AT_decl_line   : 61
    <1029>   DW_AT_decl_column : 12
    <102a>   DW_AT_type        : <0x438>
    <102e>   DW_AT_data_member_location: 12
 <2><102f>: Abbrev Number: 22 (DW_TAG_member)
    <1030>   DW_AT_name        : (indirect string, offset: 0x10c66b): HSICalibrationValue
    <1034>   DW_AT_decl_file   : 11
    <1035>   DW_AT_decl_line   : 64
    <1036>   DW_AT_decl_column : 12
    <1037>   DW_AT_type        : <0x438>
    <103b>   DW_AT_data_member_location: 16
 <2><103c>: Abbrev Number: 22 (DW_TAG_member)
    <103d>   DW_AT_name        : (indirect string, offset: 0x109b50): LSIState
    <1041>   DW_AT_decl_file   : 11
    <1042>   DW_AT_decl_line   : 67
    <1043>   DW_AT_decl_column : 12
    <1044>   DW_AT_type        : <0x438>
    <1048>   DW_AT_data_member_location: 20
 <2><1049>: Abbrev Number: 21 (DW_TAG_member)
    <104a>   DW_AT_name        : PLL
    <104e>   DW_AT_decl_file   : 11
    <104f>   DW_AT_decl_line   : 70
    <1050>   DW_AT_decl_column : 22
    <1051>   DW_AT_type        : <0xfe6>
    <1055>   DW_AT_data_member_location: 24
 <2><1056>: Abbrev Number: 0
 <1><1057>: Abbrev Number: 6 (DW_TAG_typedef)
    <1058>   DW_AT_name        : (indirect string, offset: 0x10a9b5): RCC_OscInitTypeDef
    <105c>   DW_AT_decl_file   : 11
    <105d>   DW_AT_decl_line   : 72
    <105e>   DW_AT_decl_column : 2
    <105f>   DW_AT_type        : <0xff2>
 <1><1063>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1064>   DW_AT_byte_size   : 20
    <1065>   DW_AT_decl_file   : 11
    <1066>   DW_AT_decl_line   : 77
    <1067>   DW_AT_decl_column : 9
    <1068>   DW_AT_sibling     : <0x10ae>
 <2><106c>: Abbrev Number: 22 (DW_TAG_member)
    <106d>   DW_AT_name        : (indirect string, offset: 0x1097b0): ClockType
    <1071>   DW_AT_decl_file   : 11
    <1072>   DW_AT_decl_line   : 79
    <1073>   DW_AT_decl_column : 12
    <1074>   DW_AT_type        : <0x438>
    <1078>   DW_AT_data_member_location: 0
 <2><1079>: Abbrev Number: 22 (DW_TAG_member)
    <107a>   DW_AT_name        : (indirect string, offset: 0x10b0da): SYSCLKSource
    <107e>   DW_AT_decl_file   : 11
    <107f>   DW_AT_decl_line   : 82
    <1080>   DW_AT_decl_column : 12
    <1081>   DW_AT_type        : <0x438>
    <1085>   DW_AT_data_member_location: 4
 <2><1086>: Abbrev Number: 22 (DW_TAG_member)
    <1087>   DW_AT_name        : (indirect string, offset: 0x10c287): AHBCLKDivider
    <108b>   DW_AT_decl_file   : 11
    <108c>   DW_AT_decl_line   : 85
    <108d>   DW_AT_decl_column : 12
    <108e>   DW_AT_type        : <0x438>
    <1092>   DW_AT_data_member_location: 8
 <2><1093>: Abbrev Number: 22 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0x107e35): APB1CLKDivider
    <1098>   DW_AT_decl_file   : 11
    <1099>   DW_AT_decl_line   : 88
    <109a>   DW_AT_decl_column : 12
    <109b>   DW_AT_type        : <0x438>
    <109f>   DW_AT_data_member_location: 12
 <2><10a0>: Abbrev Number: 22 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x10a353): APB2CLKDivider
    <10a5>   DW_AT_decl_file   : 11
    <10a6>   DW_AT_decl_line   : 91
    <10a7>   DW_AT_decl_column : 12
    <10a8>   DW_AT_type        : <0x438>
    <10ac>   DW_AT_data_member_location: 16
 <2><10ad>: Abbrev Number: 0
 <1><10ae>: Abbrev Number: 6 (DW_TAG_typedef)
    <10af>   DW_AT_name        : (indirect string, offset: 0x10be1b): RCC_ClkInitTypeDef
    <10b3>   DW_AT_decl_file   : 11
    <10b4>   DW_AT_decl_line   : 94
    <10b5>   DW_AT_decl_column : 2
    <10b6>   DW_AT_type        : <0x1063>
 <1><10ba>: Abbrev Number: 20 (DW_TAG_structure_type)
    <10bb>   DW_AT_byte_size   : 20
    <10bc>   DW_AT_decl_file   : 12
    <10bd>   DW_AT_decl_line   : 46
    <10be>   DW_AT_decl_column : 9
    <10bf>   DW_AT_sibling     : <0x1105>
 <2><10c3>: Abbrev Number: 21 (DW_TAG_member)
    <10c4>   DW_AT_name        : Pin
    <10c8>   DW_AT_decl_file   : 12
    <10c9>   DW_AT_decl_line   : 48
    <10ca>   DW_AT_decl_column : 12
    <10cb>   DW_AT_type        : <0x438>
    <10cf>   DW_AT_data_member_location: 0
 <2><10d0>: Abbrev Number: 22 (DW_TAG_member)
    <10d1>   DW_AT_name        : (indirect string, offset: 0x10a162): Mode
    <10d5>   DW_AT_decl_file   : 12
    <10d6>   DW_AT_decl_line   : 51
    <10d7>   DW_AT_decl_column : 12
    <10d8>   DW_AT_type        : <0x438>
    <10dc>   DW_AT_data_member_location: 4
 <2><10dd>: Abbrev Number: 22 (DW_TAG_member)
    <10de>   DW_AT_name        : (indirect string, offset: 0x10a81a): Pull
    <10e2>   DW_AT_decl_file   : 12
    <10e3>   DW_AT_decl_line   : 54
    <10e4>   DW_AT_decl_column : 12
    <10e5>   DW_AT_type        : <0x438>
    <10e9>   DW_AT_data_member_location: 8
 <2><10ea>: Abbrev Number: 22 (DW_TAG_member)
    <10eb>   DW_AT_name        : (indirect string, offset: 0x11545d): Speed
    <10ef>   DW_AT_decl_file   : 12
    <10f0>   DW_AT_decl_line   : 57
    <10f1>   DW_AT_decl_column : 12
    <10f2>   DW_AT_type        : <0x438>
    <10f6>   DW_AT_data_member_location: 12
 <2><10f7>: Abbrev Number: 22 (DW_TAG_member)
    <10f8>   DW_AT_name        : (indirect string, offset: 0x10a349): Alternate
    <10fc>   DW_AT_decl_file   : 12
    <10fd>   DW_AT_decl_line   : 60
    <10fe>   DW_AT_decl_column : 12
    <10ff>   DW_AT_type        : <0x438>
    <1103>   DW_AT_data_member_location: 16
 <2><1104>: Abbrev Number: 0
 <1><1105>: Abbrev Number: 6 (DW_TAG_typedef)
    <1106>   DW_AT_name        : (indirect string, offset: 0x10bf2a): GPIO_InitTypeDef
    <110a>   DW_AT_decl_file   : 12
    <110b>   DW_AT_decl_line   : 62
    <110c>   DW_AT_decl_column : 2
    <110d>   DW_AT_type        : <0x10ba>
 <1><1111>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <1112>   DW_AT_encoding    : 7	(unsigned)
    <1113>   DW_AT_byte_size   : 1
    <1114>   DW_AT_type        : <0x3b5>
    <1118>   DW_AT_decl_file   : 12
    <1119>   DW_AT_decl_line   : 68
    <111a>   DW_AT_decl_column : 1
    <111b>   DW_AT_sibling     : <0x112c>
 <2><111f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1120>   DW_AT_name        : (indirect string, offset: 0x108d73): GPIO_PIN_RESET
    <1124>   DW_AT_const_value : 0
 <2><1125>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1126>   DW_AT_name        : (indirect string, offset: 0x108898): GPIO_PIN_SET
    <112a>   DW_AT_const_value : 1
 <2><112b>: Abbrev Number: 0
 <1><112c>: Abbrev Number: 6 (DW_TAG_typedef)
    <112d>   DW_AT_name        : (indirect string, offset: 0x10d211): GPIO_PinState
    <1131>   DW_AT_decl_file   : 12
    <1132>   DW_AT_decl_line   : 71
    <1133>   DW_AT_decl_column : 2
    <1134>   DW_AT_type        : <0x1111>
 <1><1138>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1139>   DW_AT_byte_size   : 48
    <113a>   DW_AT_decl_file   : 13
    <113b>   DW_AT_decl_line   : 48
    <113c>   DW_AT_decl_column : 9
    <113d>   DW_AT_sibling     : <0x11de>
 <2><1141>: Abbrev Number: 22 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0x111377): Channel
    <1146>   DW_AT_decl_file   : 13
    <1147>   DW_AT_decl_line   : 50
    <1148>   DW_AT_decl_column : 12
    <1149>   DW_AT_type        : <0x438>
    <114d>   DW_AT_data_member_location: 0
 <2><114e>: Abbrev Number: 22 (DW_TAG_member)
    <114f>   DW_AT_name        : (indirect string, offset: 0x109c52): Direction
    <1153>   DW_AT_decl_file   : 13
    <1154>   DW_AT_decl_line   : 53
    <1155>   DW_AT_decl_column : 12
    <1156>   DW_AT_type        : <0x438>
    <115a>   DW_AT_data_member_location: 4
 <2><115b>: Abbrev Number: 22 (DW_TAG_member)
    <115c>   DW_AT_name        : (indirect string, offset: 0x1080a0): PeriphInc
    <1160>   DW_AT_decl_file   : 13
    <1161>   DW_AT_decl_line   : 57
    <1162>   DW_AT_decl_column : 12
    <1163>   DW_AT_type        : <0x438>
    <1167>   DW_AT_data_member_location: 8
 <2><1168>: Abbrev Number: 22 (DW_TAG_member)
    <1169>   DW_AT_name        : (indirect string, offset: 0x1086ca): MemInc
    <116d>   DW_AT_decl_file   : 13
    <116e>   DW_AT_decl_line   : 60
    <116f>   DW_AT_decl_column : 12
    <1170>   DW_AT_type        : <0x438>
    <1174>   DW_AT_data_member_location: 12
 <2><1175>: Abbrev Number: 22 (DW_TAG_member)
    <1176>   DW_AT_name        : (indirect string, offset: 0x10a6d2): PeriphDataAlignment
    <117a>   DW_AT_decl_file   : 13
    <117b>   DW_AT_decl_line   : 63
    <117c>   DW_AT_decl_column : 12
    <117d>   DW_AT_type        : <0x438>
    <1181>   DW_AT_data_member_location: 16
 <2><1182>: Abbrev Number: 22 (DW_TAG_member)
    <1183>   DW_AT_name        : (indirect string, offset: 0x10cbdb): MemDataAlignment
    <1187>   DW_AT_decl_file   : 13
    <1188>   DW_AT_decl_line   : 66
    <1189>   DW_AT_decl_column : 12
    <118a>   DW_AT_type        : <0x438>
    <118e>   DW_AT_data_member_location: 20
 <2><118f>: Abbrev Number: 22 (DW_TAG_member)
    <1190>   DW_AT_name        : (indirect string, offset: 0x10a162): Mode
    <1194>   DW_AT_decl_file   : 13
    <1195>   DW_AT_decl_line   : 69
    <1196>   DW_AT_decl_column : 12
    <1197>   DW_AT_type        : <0x438>
    <119b>   DW_AT_data_member_location: 24
 <2><119c>: Abbrev Number: 22 (DW_TAG_member)
    <119d>   DW_AT_name        : (indirect string, offset: 0x11241a): Priority
    <11a1>   DW_AT_decl_file   : 13
    <11a2>   DW_AT_decl_line   : 74
    <11a3>   DW_AT_decl_column : 12
    <11a4>   DW_AT_type        : <0x438>
    <11a8>   DW_AT_data_member_location: 28
 <2><11a9>: Abbrev Number: 22 (DW_TAG_member)
    <11aa>   DW_AT_name        : (indirect string, offset: 0x10a112): FIFOMode
    <11ae>   DW_AT_decl_file   : 13
    <11af>   DW_AT_decl_line   : 77
    <11b0>   DW_AT_decl_column : 12
    <11b1>   DW_AT_type        : <0x438>
    <11b5>   DW_AT_data_member_location: 32
 <2><11b6>: Abbrev Number: 22 (DW_TAG_member)
    <11b7>   DW_AT_name        : (indirect string, offset: 0x10bd5a): FIFOThreshold
    <11bb>   DW_AT_decl_file   : 13
    <11bc>   DW_AT_decl_line   : 82
    <11bd>   DW_AT_decl_column : 12
    <11be>   DW_AT_type        : <0x438>
    <11c2>   DW_AT_data_member_location: 36
 <2><11c3>: Abbrev Number: 22 (DW_TAG_member)
    <11c4>   DW_AT_name        : (indirect string, offset: 0x10bcce): MemBurst
    <11c8>   DW_AT_decl_file   : 13
    <11c9>   DW_AT_decl_line   : 85
    <11ca>   DW_AT_decl_column : 12
    <11cb>   DW_AT_type        : <0x438>
    <11cf>   DW_AT_data_member_location: 40
 <2><11d0>: Abbrev Number: 22 (DW_TAG_member)
    <11d1>   DW_AT_name        : (indirect string, offset: 0x109a59): PeriphBurst
    <11d5>   DW_AT_decl_file   : 13
    <11d6>   DW_AT_decl_line   : 91
    <11d7>   DW_AT_decl_column : 12
    <11d8>   DW_AT_type        : <0x438>
    <11dc>   DW_AT_data_member_location: 44
 <2><11dd>: Abbrev Number: 0
 <1><11de>: Abbrev Number: 6 (DW_TAG_typedef)
    <11df>   DW_AT_name        : (indirect string, offset: 0x10929d): DMA_InitTypeDef
    <11e3>   DW_AT_decl_file   : 13
    <11e4>   DW_AT_decl_line   : 96
    <11e5>   DW_AT_decl_column : 2
    <11e6>   DW_AT_type        : <0x1138>
 <1><11ea>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <11eb>   DW_AT_encoding    : 7	(unsigned)
    <11ec>   DW_AT_byte_size   : 1
    <11ed>   DW_AT_type        : <0x3b5>
    <11f1>   DW_AT_decl_file   : 13
    <11f2>   DW_AT_decl_line   : 102
    <11f3>   DW_AT_decl_column : 1
    <11f4>   DW_AT_sibling     : <0x121d>
 <2><11f8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11f9>   DW_AT_name        : (indirect string, offset: 0x10bc33): HAL_DMA_STATE_RESET
    <11fd>   DW_AT_const_value : 0
 <2><11fe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11ff>   DW_AT_name        : (indirect string, offset: 0x1092f8): HAL_DMA_STATE_READY
    <1203>   DW_AT_const_value : 1
 <2><1204>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1205>   DW_AT_name        : (indirect string, offset: 0x10b872): HAL_DMA_STATE_BUSY
    <1209>   DW_AT_const_value : 2
 <2><120a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <120b>   DW_AT_name        : (indirect string, offset: 0x10d224): HAL_DMA_STATE_TIMEOUT
    <120f>   DW_AT_const_value : 3
 <2><1210>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1211>   DW_AT_name        : (indirect string, offset: 0x10c5bd): HAL_DMA_STATE_ERROR
    <1215>   DW_AT_const_value : 4
 <2><1216>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1217>   DW_AT_name        : (indirect string, offset: 0x10900c): HAL_DMA_STATE_ABORT
    <121b>   DW_AT_const_value : 5
 <2><121c>: Abbrev Number: 0
 <1><121d>: Abbrev Number: 6 (DW_TAG_typedef)
    <121e>   DW_AT_name        : (indirect string, offset: 0x10bf3b): HAL_DMA_StateTypeDef
    <1222>   DW_AT_decl_file   : 13
    <1223>   DW_AT_decl_line   : 109
    <1224>   DW_AT_decl_column : 2
    <1225>   DW_AT_type        : <0x11ea>
 <1><1229>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <122a>   DW_AT_type        : <0x121d>
 <1><122e>: Abbrev Number: 25 (DW_TAG_structure_type)
    <122f>   DW_AT_name        : (indirect string, offset: 0x10c57c): __DMA_HandleTypeDef
    <1233>   DW_AT_byte_size   : 96
    <1234>   DW_AT_decl_file   : 13
    <1235>   DW_AT_decl_line   : 137
    <1236>   DW_AT_decl_column : 16
    <1237>   DW_AT_sibling     : <0x12f2>
 <2><123b>: Abbrev Number: 22 (DW_TAG_member)
    <123c>   DW_AT_name        : (indirect string, offset: 0x10d12d): Instance
    <1240>   DW_AT_decl_file   : 13
    <1241>   DW_AT_decl_line   : 139
    <1242>   DW_AT_decl_column : 31
    <1243>   DW_AT_type        : <0x12f2>
    <1247>   DW_AT_data_member_location: 0
 <2><1248>: Abbrev Number: 22 (DW_TAG_member)
    <1249>   DW_AT_name        : (indirect string, offset: 0x11356f): Init
    <124d>   DW_AT_decl_file   : 13
    <124e>   DW_AT_decl_line   : 141
    <124f>   DW_AT_decl_column : 30
    <1250>   DW_AT_type        : <0x11de>
    <1254>   DW_AT_data_member_location: 4
 <2><1255>: Abbrev Number: 22 (DW_TAG_member)
    <1256>   DW_AT_name        : (indirect string, offset: 0xbbfbd): Lock
    <125a>   DW_AT_decl_file   : 13
    <125b>   DW_AT_decl_line   : 143
    <125c>   DW_AT_decl_column : 30
    <125d>   DW_AT_type        : <0xf75>
    <1261>   DW_AT_data_member_location: 52
 <2><1262>: Abbrev Number: 22 (DW_TAG_member)
    <1263>   DW_AT_name        : (indirect string, offset: 0x114605): State
    <1267>   DW_AT_decl_file   : 13
    <1268>   DW_AT_decl_line   : 145
    <1269>   DW_AT_decl_column : 30
    <126a>   DW_AT_type        : <0x1229>
    <126e>   DW_AT_data_member_location: 53
 <2><126f>: Abbrev Number: 22 (DW_TAG_member)
    <1270>   DW_AT_name        : (indirect string, offset: 0x10d028): Parent
    <1274>   DW_AT_decl_file   : 13
    <1275>   DW_AT_decl_line   : 147
    <1276>   DW_AT_decl_column : 31
    <1277>   DW_AT_type        : <0x12f8>
    <127b>   DW_AT_data_member_location: 56
 <2><127c>: Abbrev Number: 22 (DW_TAG_member)
    <127d>   DW_AT_name        : (indirect string, offset: 0x10d2fa): XferCpltCallback
    <1281>   DW_AT_decl_file   : 13
    <1282>   DW_AT_decl_line   : 149
    <1283>   DW_AT_decl_column : 33
    <1284>   DW_AT_type        : <0x1310>
    <1288>   DW_AT_data_member_location: 60
 <2><1289>: Abbrev Number: 22 (DW_TAG_member)
    <128a>   DW_AT_name        : (indirect string, offset: 0x10beb6): XferHalfCpltCallback
    <128e>   DW_AT_decl_file   : 13
    <128f>   DW_AT_decl_line   : 151
    <1290>   DW_AT_decl_column : 33
    <1291>   DW_AT_type        : <0x1310>
    <1295>   DW_AT_data_member_location: 64
 <2><1296>: Abbrev Number: 22 (DW_TAG_member)
    <1297>   DW_AT_name        : (indirect string, offset: 0x10ccdf): XferM1CpltCallback
    <129b>   DW_AT_decl_file   : 13
    <129c>   DW_AT_decl_line   : 153
    <129d>   DW_AT_decl_column : 33
    <129e>   DW_AT_type        : <0x1310>
    <12a2>   DW_AT_data_member_location: 68
 <2><12a3>: Abbrev Number: 22 (DW_TAG_member)
    <12a4>   DW_AT_name        : (indirect string, offset: 0x10a59e): XferM1HalfCpltCallback
    <12a8>   DW_AT_decl_file   : 13
    <12a9>   DW_AT_decl_line   : 155
    <12aa>   DW_AT_decl_column : 33
    <12ab>   DW_AT_type        : <0x1310>
    <12af>   DW_AT_data_member_location: 72
 <2><12b0>: Abbrev Number: 22 (DW_TAG_member)
    <12b1>   DW_AT_name        : (indirect string, offset: 0x1085d0): XferErrorCallback
    <12b5>   DW_AT_decl_file   : 13
    <12b6>   DW_AT_decl_line   : 157
    <12b7>   DW_AT_decl_column : 33
    <12b8>   DW_AT_type        : <0x1310>
    <12bc>   DW_AT_data_member_location: 76
 <2><12bd>: Abbrev Number: 22 (DW_TAG_member)
    <12be>   DW_AT_name        : (indirect string, offset: 0x10ce56): XferAbortCallback
    <12c2>   DW_AT_decl_file   : 13
    <12c3>   DW_AT_decl_line   : 159
    <12c4>   DW_AT_decl_column : 33
    <12c5>   DW_AT_type        : <0x1310>
    <12c9>   DW_AT_data_member_location: 80
 <2><12ca>: Abbrev Number: 22 (DW_TAG_member)
    <12cb>   DW_AT_name        : (indirect string, offset: 0x10d1e5): ErrorCode
    <12cf>   DW_AT_decl_file   : 13
    <12d0>   DW_AT_decl_line   : 161
    <12d1>   DW_AT_decl_column : 30
    <12d2>   DW_AT_type        : <0x444>
    <12d6>   DW_AT_data_member_location: 84
 <2><12d7>: Abbrev Number: 22 (DW_TAG_member)
    <12d8>   DW_AT_name        : (indirect string, offset: 0x10a20d): StreamBaseAddress
    <12dc>   DW_AT_decl_file   : 13
    <12dd>   DW_AT_decl_line   : 163
    <12de>   DW_AT_decl_column : 30
    <12df>   DW_AT_type        : <0x438>
    <12e3>   DW_AT_data_member_location: 88
 <2><12e4>: Abbrev Number: 22 (DW_TAG_member)
    <12e5>   DW_AT_name        : (indirect string, offset: 0x10c411): StreamIndex
    <12e9>   DW_AT_decl_file   : 13
    <12ea>   DW_AT_decl_line   : 165
    <12eb>   DW_AT_decl_column : 30
    <12ec>   DW_AT_type        : <0x438>
    <12f0>   DW_AT_data_member_location: 92
 <2><12f1>: Abbrev Number: 0
 <1><12f2>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <12f3>   DW_AT_byte_size   : 4
    <12f4>   DW_AT_type        : <0x82c>
 <1><12f8>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <12f9>   DW_AT_byte_size   : 4
 <1><12fa>: Abbrev Number: 9 (DW_TAG_const_type)
    <12fb>   DW_AT_type        : <0x12f8>
 <1><12ff>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <1300>   DW_AT_prototyped  : 1
    <1300>   DW_AT_sibling     : <0x130a>
 <2><1304>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1305>   DW_AT_type        : <0x130a>
 <2><1309>: Abbrev Number: 0
 <1><130a>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <130b>   DW_AT_byte_size   : 4
    <130c>   DW_AT_type        : <0x122e>
 <1><1310>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <1311>   DW_AT_byte_size   : 4
    <1312>   DW_AT_type        : <0x12ff>
 <1><1316>: Abbrev Number: 6 (DW_TAG_typedef)
    <1317>   DW_AT_name        : (indirect string, offset: 0x10c57e): DMA_HandleTypeDef
    <131b>   DW_AT_decl_file   : 13
    <131c>   DW_AT_decl_line   : 167
    <131d>   DW_AT_decl_column : 2
    <131e>   DW_AT_type        : <0x122e>
 <1><1322>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1323>   DW_AT_byte_size   : 48
    <1324>   DW_AT_decl_file   : 14
    <1325>   DW_AT_decl_line   : 56
    <1326>   DW_AT_decl_column : 9
    <1327>   DW_AT_sibling     : <0x13c8>
 <2><132b>: Abbrev Number: 22 (DW_TAG_member)
    <132c>   DW_AT_name        : (indirect string, offset: 0x10c7cd): ClockPrescaler
    <1330>   DW_AT_decl_file   : 14
    <1331>   DW_AT_decl_line   : 58
    <1332>   DW_AT_decl_column : 12
    <1333>   DW_AT_type        : <0x438>
    <1337>   DW_AT_data_member_location: 0
 <2><1338>: Abbrev Number: 22 (DW_TAG_member)
    <1339>   DW_AT_name        : (indirect string, offset: 0x10811f): Resolution
    <133d>   DW_AT_decl_file   : 14
    <133e>   DW_AT_decl_line   : 61
    <133f>   DW_AT_decl_column : 12
    <1340>   DW_AT_type        : <0x438>
    <1344>   DW_AT_data_member_location: 4
 <2><1345>: Abbrev Number: 22 (DW_TAG_member)
    <1346>   DW_AT_name        : (indirect string, offset: 0x108f0c): DataAlign
    <134a>   DW_AT_decl_file   : 14
    <134b>   DW_AT_decl_line   : 63
    <134c>   DW_AT_decl_column : 12
    <134d>   DW_AT_type        : <0x438>
    <1351>   DW_AT_data_member_location: 8
 <2><1352>: Abbrev Number: 22 (DW_TAG_member)
    <1353>   DW_AT_name        : (indirect string, offset: 0x10ce26): ScanConvMode
    <1357>   DW_AT_decl_file   : 14
    <1358>   DW_AT_decl_line   : 66
    <1359>   DW_AT_decl_column : 12
    <135a>   DW_AT_type        : <0x438>
    <135e>   DW_AT_data_member_location: 12
 <2><135f>: Abbrev Number: 22 (DW_TAG_member)
    <1360>   DW_AT_name        : (indirect string, offset: 0x9c95): EOCSelection
    <1364>   DW_AT_decl_file   : 14
    <1365>   DW_AT_decl_line   : 74
    <1366>   DW_AT_decl_column : 12
    <1367>   DW_AT_type        : <0x438>
    <136b>   DW_AT_data_member_location: 16
 <2><136c>: Abbrev Number: 22 (DW_TAG_member)
    <136d>   DW_AT_name        : (indirect string, offset: 0x10a031): ContinuousConvMode
    <1371>   DW_AT_decl_file   : 14
    <1372>   DW_AT_decl_line   : 81
    <1373>   DW_AT_decl_column : 12
    <1374>   DW_AT_type        : <0x438>
    <1378>   DW_AT_data_member_location: 20
 <2><1379>: Abbrev Number: 22 (DW_TAG_member)
    <137a>   DW_AT_name        : (indirect string, offset: 0x10b058): NbrOfConversion
    <137e>   DW_AT_decl_file   : 14
    <137f>   DW_AT_decl_line   : 84
    <1380>   DW_AT_decl_column : 12
    <1381>   DW_AT_type        : <0x438>
    <1385>   DW_AT_data_member_location: 24
 <2><1386>: Abbrev Number: 22 (DW_TAG_member)
    <1387>   DW_AT_name        : (indirect string, offset: 0x10a900): DiscontinuousConvMode
    <138b>   DW_AT_decl_file   : 14
    <138c>   DW_AT_decl_line   : 87
    <138d>   DW_AT_decl_column : 19
    <138e>   DW_AT_type        : <0xf08>
    <1392>   DW_AT_data_member_location: 28
 <2><1393>: Abbrev Number: 22 (DW_TAG_member)
    <1394>   DW_AT_name        : (indirect string, offset: 0x10ce8d): NbrOfDiscConversion
    <1398>   DW_AT_decl_file   : 14
    <1399>   DW_AT_decl_line   : 91
    <139a>   DW_AT_decl_column : 12
    <139b>   DW_AT_type        : <0x438>
    <139f>   DW_AT_data_member_location: 32
 <2><13a0>: Abbrev Number: 22 (DW_TAG_member)
    <13a1>   DW_AT_name        : (indirect string, offset: 0x10bc01): ExternalTrigConv
    <13a5>   DW_AT_decl_file   : 14
    <13a6>   DW_AT_decl_line   : 94
    <13a7>   DW_AT_decl_column : 12
    <13a8>   DW_AT_type        : <0x438>
    <13ac>   DW_AT_data_member_location: 36
 <2><13ad>: Abbrev Number: 22 (DW_TAG_member)
    <13ae>   DW_AT_name        : (indirect string, offset: 0x1092bd): ExternalTrigConvEdge
    <13b2>   DW_AT_decl_file   : 14
    <13b3>   DW_AT_decl_line   : 98
    <13b4>   DW_AT_decl_column : 12
    <13b5>   DW_AT_type        : <0x438>
    <13b9>   DW_AT_data_member_location: 40
 <2><13ba>: Abbrev Number: 22 (DW_TAG_member)
    <13bb>   DW_AT_name        : (indirect string, offset: 0x107f75): DMAContinuousRequests
    <13bf>   DW_AT_decl_file   : 14
    <13c0>   DW_AT_decl_line   : 101
    <13c1>   DW_AT_decl_column : 19
    <13c2>   DW_AT_type        : <0xf08>
    <13c6>   DW_AT_data_member_location: 44
 <2><13c7>: Abbrev Number: 0
 <1><13c8>: Abbrev Number: 6 (DW_TAG_typedef)
    <13c9>   DW_AT_name        : (indirect string, offset: 0x1090a7): ADC_InitTypeDef
    <13cd>   DW_AT_decl_file   : 14
    <13ce>   DW_AT_decl_line   : 106
    <13cf>   DW_AT_decl_column : 2
    <13d0>   DW_AT_type        : <0x1322>
 <1><13d4>: Abbrev Number: 20 (DW_TAG_structure_type)
    <13d5>   DW_AT_byte_size   : 16
    <13d6>   DW_AT_decl_file   : 14
    <13d7>   DW_AT_decl_line   : 115
    <13d8>   DW_AT_decl_column : 9
    <13d9>   DW_AT_sibling     : <0x1412>
 <2><13dd>: Abbrev Number: 22 (DW_TAG_member)
    <13de>   DW_AT_name        : (indirect string, offset: 0x111377): Channel
    <13e2>   DW_AT_decl_file   : 14
    <13e3>   DW_AT_decl_line   : 117
    <13e4>   DW_AT_decl_column : 12
    <13e5>   DW_AT_type        : <0x438>
    <13e9>   DW_AT_data_member_location: 0
 <2><13ea>: Abbrev Number: 22 (DW_TAG_member)
    <13eb>   DW_AT_name        : (indirect string, offset: 0x1091da): Rank
    <13ef>   DW_AT_decl_file   : 14
    <13f0>   DW_AT_decl_line   : 119
    <13f1>   DW_AT_decl_column : 12
    <13f2>   DW_AT_type        : <0x438>
    <13f6>   DW_AT_data_member_location: 4
 <2><13f7>: Abbrev Number: 22 (DW_TAG_member)
    <13f8>   DW_AT_name        : (indirect string, offset: 0x10b4d8): SamplingTime
    <13fc>   DW_AT_decl_file   : 14
    <13fd>   DW_AT_decl_line   : 122
    <13fe>   DW_AT_decl_column : 12
    <13ff>   DW_AT_type        : <0x438>
    <1403>   DW_AT_data_member_location: 8
 <2><1404>: Abbrev Number: 22 (DW_TAG_member)
    <1405>   DW_AT_name        : (indirect string, offset: 0x112f19): Offset
    <1409>   DW_AT_decl_file   : 14
    <140a>   DW_AT_decl_line   : 131
    <140b>   DW_AT_decl_column : 12
    <140c>   DW_AT_type        : <0x438>
    <1410>   DW_AT_data_member_location: 12
 <2><1411>: Abbrev Number: 0
 <1><1412>: Abbrev Number: 6 (DW_TAG_typedef)
    <1413>   DW_AT_name        : (indirect string, offset: 0x10d327): ADC_ChannelConfTypeDef
    <1417>   DW_AT_decl_file   : 14
    <1418>   DW_AT_decl_line   : 132
    <1419>   DW_AT_decl_column : 2
    <141a>   DW_AT_type        : <0x13d4>
 <1><141e>: Abbrev Number: 20 (DW_TAG_structure_type)
    <141f>   DW_AT_byte_size   : 72
    <1420>   DW_AT_decl_file   : 14
    <1421>   DW_AT_decl_line   : 194
    <1422>   DW_AT_decl_column : 9
    <1423>   DW_AT_sibling     : <0x1483>
 <2><1427>: Abbrev Number: 22 (DW_TAG_member)
    <1428>   DW_AT_name        : (indirect string, offset: 0x10d12d): Instance
    <142c>   DW_AT_decl_file   : 14
    <142d>   DW_AT_decl_line   : 197
    <142e>   DW_AT_decl_column : 34
    <142f>   DW_AT_type        : <0x1483>
    <1433>   DW_AT_data_member_location: 0
 <2><1434>: Abbrev Number: 22 (DW_TAG_member)
    <1435>   DW_AT_name        : (indirect string, offset: 0x11356f): Init
    <1439>   DW_AT_decl_file   : 14
    <143a>   DW_AT_decl_line   : 199
    <143b>   DW_AT_decl_column : 33
    <143c>   DW_AT_type        : <0x13c8>
    <1440>   DW_AT_data_member_location: 4
 <2><1441>: Abbrev Number: 22 (DW_TAG_member)
    <1442>   DW_AT_name        : (indirect string, offset: 0x1091c4): NbrOfCurrentConversionRank
    <1446>   DW_AT_decl_file   : 14
    <1447>   DW_AT_decl_line   : 201
    <1448>   DW_AT_decl_column : 33
    <1449>   DW_AT_type        : <0x444>
    <144d>   DW_AT_data_member_location: 52
 <2><144e>: Abbrev Number: 22 (DW_TAG_member)
    <144f>   DW_AT_name        : (indirect string, offset: 0x107c40): DMA_Handle
    <1453>   DW_AT_decl_file   : 14
    <1454>   DW_AT_decl_line   : 203
    <1455>   DW_AT_decl_column : 34
    <1456>   DW_AT_type        : <0x1489>
    <145a>   DW_AT_data_member_location: 56
 <2><145b>: Abbrev Number: 22 (DW_TAG_member)
    <145c>   DW_AT_name        : (indirect string, offset: 0xbbfbd): Lock
    <1460>   DW_AT_decl_file   : 14
    <1461>   DW_AT_decl_line   : 205
    <1462>   DW_AT_decl_column : 33
    <1463>   DW_AT_type        : <0xf75>
    <1467>   DW_AT_data_member_location: 60
 <2><1468>: Abbrev Number: 22 (DW_TAG_member)
    <1469>   DW_AT_name        : (indirect string, offset: 0x114605): State
    <146d>   DW_AT_decl_file   : 14
    <146e>   DW_AT_decl_line   : 207
    <146f>   DW_AT_decl_column : 33
    <1470>   DW_AT_type        : <0x444>
    <1474>   DW_AT_data_member_location: 64
 <2><1475>: Abbrev Number: 22 (DW_TAG_member)
    <1476>   DW_AT_name        : (indirect string, offset: 0x10d1e5): ErrorCode
    <147a>   DW_AT_decl_file   : 14
    <147b>   DW_AT_decl_line   : 209
    <147c>   DW_AT_decl_column : 33
    <147d>   DW_AT_type        : <0x444>
    <1481>   DW_AT_data_member_location: 68
 <2><1482>: Abbrev Number: 0
 <1><1483>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <1484>   DW_AT_byte_size   : 4
    <1485>   DW_AT_type        : <0x7b2>
 <1><1489>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <148a>   DW_AT_byte_size   : 4
    <148b>   DW_AT_type        : <0x1316>
 <1><148f>: Abbrev Number: 6 (DW_TAG_typedef)
    <1490>   DW_AT_name        : (indirect string, offset: 0x108d1e): ADC_HandleTypeDef
    <1494>   DW_AT_decl_file   : 14
    <1495>   DW_AT_decl_line   : 219
    <1496>   DW_AT_decl_column : 2
    <1497>   DW_AT_type        : <0x141e>
 <1><149b>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <149c>   DW_AT_byte_size   : 4
    <149d>   DW_AT_type        : <0x40c>
 <1><14a1>: Abbrev Number: 20 (DW_TAG_structure_type)
    <14a2>   DW_AT_byte_size   : 24
    <14a3>   DW_AT_decl_file   : 15
    <14a4>   DW_AT_decl_line   : 46
    <14a5>   DW_AT_decl_column : 9
    <14a6>   DW_AT_sibling     : <0x14f9>
 <2><14aa>: Abbrev Number: 22 (DW_TAG_member)
    <14ab>   DW_AT_name        : (indirect string, offset: 0x113d46): Prescaler
    <14af>   DW_AT_decl_file   : 15
    <14b0>   DW_AT_decl_line   : 48
    <14b1>   DW_AT_decl_column : 12
    <14b2>   DW_AT_type        : <0x438>
    <14b6>   DW_AT_data_member_location: 0
 <2><14b7>: Abbrev Number: 22 (DW_TAG_member)
    <14b8>   DW_AT_name        : (indirect string, offset: 0x10cc87): CounterMode
    <14bc>   DW_AT_decl_file   : 15
    <14bd>   DW_AT_decl_line   : 51
    <14be>   DW_AT_decl_column : 12
    <14bf>   DW_AT_type        : <0x438>
    <14c3>   DW_AT_data_member_location: 4
 <2><14c4>: Abbrev Number: 22 (DW_TAG_member)
    <14c5>   DW_AT_name        : (indirect string, offset: 0x118ef7): Period
    <14c9>   DW_AT_decl_file   : 15
    <14ca>   DW_AT_decl_line   : 54
    <14cb>   DW_AT_decl_column : 12
    <14cc>   DW_AT_type        : <0x438>
    <14d0>   DW_AT_data_member_location: 8
 <2><14d1>: Abbrev Number: 22 (DW_TAG_member)
    <14d2>   DW_AT_name        : (indirect string, offset: 0x109f52): ClockDivision
    <14d6>   DW_AT_decl_file   : 15
    <14d7>   DW_AT_decl_line   : 58
    <14d8>   DW_AT_decl_column : 12
    <14d9>   DW_AT_type        : <0x438>
